// Derived from kongvut/thai-province-data (MIT). See thaiLocations.LICENSE.txt.
// Source commit: 3dddbb03345635206c96f7089297d3d6faf9057b; snapshot: 2026-10-21. Municipal-only records omitted.
export const THAI_LOCATIONS = {
  "กรุงเทพมหานคร": {
    "พระนคร": [
      "พระบรมมหาราชวัง",
      "วังบูรพาภิรมย์",
      "วัดราชบพิธ",
      "สำราญราษฎร์",
      "ศาลเจ้าพ่อเสือ",
      "เสาชิงช้า",
      "บวรนิเวศ",
      "ตลาดยอด",
      "ชนะสงคราม",
      "บ้านพานถม",
      "บางขุนพรหม",
      "วัดสามพระยา"
    ],
    "ดุสิต": [
      "ดุสิต",
      "วชิรพยาบาล",
      "สวนจิตรลดา",
      "สี่แยกมหานาค",
      "ถนนนครไชยศรี"
    ],
    "หนองจอก": [
      "กระทุ่มราย",
      "หนองจอก",
      "คลองสิบ",
      "คลองสิบสอง",
      "โคกแฝด",
      "คู้ฝั่งเหนือ",
      "ลำผักชี",
      "ลำต้อยติ่ง"
    ],
    "บางรัก": [
      "มหาพฤฒาราม",
      "สีลม",
      "สุริยวงศ์",
      "บางรัก",
      "สี่พระยา"
    ],
    "บางเขน": [
      "อนุสาวรีย์",
      "ท่าแร้ง"
    ],
    "บางกะปิ": [
      "คลองจั่น",
      "หัวหมาก"
    ],
    "ปทุมวัน": [
      "รองเมือง",
      "วังใหม่",
      "ปทุมวัน",
      "ลุมพินี"
    ],
    "ป้อมปราบศัตรูพ่าย": [
      "ป้อมปราบ",
      "วัดเทพศิรินทร์",
      "คลองมหานาค",
      "บ้านบาตร",
      "วัดโสมนัส"
    ],
    "พระโขนง": [
      "บางจาก",
      "พระโขนงใต้"
    ],
    "มีนบุรี": [
      "มีนบุรี",
      "แสนแสบ"
    ],
    "ลาดกระบัง": [
      "ลาดกระบัง",
      "คลองสองต้นนุ่น",
      "คลองสามประเวศ",
      "ลำปลาทิว",
      "ทับยาว",
      "ขุมทอง"
    ],
    "ยานนาวา": [
      "ช่องนนทรี",
      "บางโพงพาง"
    ],
    "สัมพันธวงศ์": [
      "จักรวรรดิ",
      "สัมพันธวงศ์",
      "ตลาดน้อย"
    ],
    "พญาไท": [
      "สามเสนใน",
      "พญาไท"
    ],
    "ธนบุรี": [
      "วัดกัลยาณ์",
      "หิรัญรูจี",
      "บางยี่เรือ",
      "บุคคโล",
      "ตลาดพลู",
      "ดาวคะนอง",
      "สำเหร่"
    ],
    "บางกอกใหญ่": [
      "วัดอรุณ",
      "วัดท่าพระ"
    ],
    "ห้วยขวาง": [
      "ห้วยขวาง",
      "บางกะปิ",
      "สามเสนนอก"
    ],
    "คลองสาน": [
      "สมเด็จเจ้าพระยา",
      "คลองสาน",
      "บางลำภูล่าง",
      "คลองต้นไทร"
    ],
    "ตลิ่งชัน": [
      "คลองชักพระ",
      "ตลิ่งชัน",
      "ฉิมพลี",
      "บางพรม",
      "บางระมาด",
      "บางเชือกหนัง"
    ],
    "บางกอกน้อย": [
      "ศิริราช",
      "บ้านช่างหล่อ",
      "บางขุนนนท์",
      "บางขุนศรี",
      "อรุณอมรินทร์"
    ],
    "บางขุนเทียน": [
      "ท่าข้าม",
      "แสมดำ"
    ],
    "ภาษีเจริญ": [
      "บางหว้า",
      "บางด้วน",
      "บางจาก",
      "บางแวก",
      "คลองขวาง",
      "ปากคลองภาษีเจริญ",
      "คูหาสวรรค์"
    ],
    "หนองแขม": [
      "หนองแขม",
      "หนองค้างพลู"
    ],
    "ราษฎร์บูรณะ": [
      "ราษฎร์บูรณะ",
      "บางปะกอก"
    ],
    "บางพลัด": [
      "บางพลัด",
      "บางอ้อ",
      "บางบำหรุ",
      "บางยี่ขัน"
    ],
    "ดินแดง": [
      "ดินแดง",
      "รัชดาภิเษก"
    ],
    "บึงกุ่ม": [
      "คลองกุ่ม",
      "นวมินทร์",
      "นวลจันทร์"
    ],
    "สาทร": [
      "ทุ่งวัดดอน",
      "ยานนาวา",
      "ทุ่งมหาเมฆ"
    ],
    "บางซื่อ": [
      "บางซื่อ",
      "วงศ์สว่าง"
    ],
    "จตุจักร": [
      "ลาดยาว",
      "เสนานิคม",
      "จันทรเกษม",
      "จอมพล",
      "จตุจักร"
    ],
    "บางคอแหลม": [
      "บางคอแหลม",
      "วัดพระยาไกร",
      "บางโคล่"
    ],
    "ประเวศ": [
      "ประเวศ",
      "หนองบอน",
      "ดอกไม้"
    ],
    "คลองเตย": [
      "คลองเตย",
      "คลองตัน",
      "พระโขนง"
    ],
    "สวนหลวง": [
      "สวนหลวง",
      "อ่อนนุช",
      "พัฒนาการ"
    ],
    "จอมทอง": [
      "บางขุนเทียน",
      "บางค้อ",
      "บางมด",
      "จอมทอง"
    ],
    "ดอนเมือง": [
      "สีกัน",
      "ดอนเมือง",
      "สนามบิน"
    ],
    "ราชเทวี": [
      "ทุ่งพญาไท",
      "ถนนพญาไท",
      "ถนนเพชรบุรี",
      "มักกะสัน"
    ],
    "ลาดพร้าว": [
      "ลาดพร้าว",
      "จรเข้บัว"
    ],
    "วัฒนา": [
      "คลองเตยเหนือ",
      "คลองตันเหนือ",
      "พระโขนงเหนือ"
    ],
    "บางแค": [
      "บางแค",
      "บางแคเหนือ",
      "บางไผ่",
      "หลักสอง"
    ],
    "หลักสี่": [
      "ทุ่งสองห้อง",
      "ตลาดบางเขน"
    ],
    "สายไหม": [
      "สายไหม",
      "ออเงิน",
      "คลองถนน"
    ],
    "คันนายาว": [
      "คันนายาว",
      "รามอินทรา"
    ],
    "สะพานสูง": [
      "สะพานสูง",
      "ราษฎร์พัฒนา",
      "ทับช้าง"
    ],
    "วังทองหลาง": [
      "วังทองหลาง",
      "สะพานสอง",
      "คลองเจ้าคุณสิงห์",
      "พลับพลา"
    ],
    "คลองสามวา": [
      "สามวาตะวันตก",
      "สามวาตะวันออก",
      "บางชัน",
      "ทรายกองดิน",
      "ทรายกองดินใต้"
    ],
    "บางนา": [
      "บางนาเหนือ",
      "บางนาใต้"
    ],
    "ทวีวัฒนา": [
      "ทวีวัฒนา",
      "ศาลาธรรมสพน์"
    ],
    "ทุ่งครุ": [
      "บางมด",
      "ทุ่งครุ"
    ],
    "บางบอน": [
      "บางบอนเหนือ",
      "บางบอนใต้",
      "คลองบางพราน",
      "คลองบางบอน"
    ]
  },
  "สมุทรปราการ": {
    "เมืองสมุทรปราการ": [
      "ปากน้ำ",
      "สำโรงเหนือ",
      "บางเมือง",
      "ท้ายบ้าน",
      "บางปูใหม่",
      "แพรกษา",
      "บางโปรง",
      "บางปู",
      "บางด้วน",
      "บางเมืองใหม่",
      "เทพารักษ์",
      "ท้ายบ้านใหม่",
      "แพรกษาใหม่"
    ],
    "บางบ่อ": [
      "บางบ่อ",
      "บ้านระกาศ",
      "บางพลีน้อย",
      "บางเพรียง",
      "คลองด่าน",
      "คลองสวน",
      "เปร็ง",
      "คลองนิยมยาตรา"
    ],
    "บางพลี": [
      "บางพลีใหญ่",
      "บางแก้ว",
      "บางปลา",
      "บางโฉลง",
      "ราชาเทวะ",
      "หนองปรือ"
    ],
    "พระประแดง": [
      "ตลาด",
      "บางพึ่ง",
      "บางจาก",
      "บางครุ",
      "บางหญ้าแพรก",
      "บางหัวเสือ",
      "สำโรงใต้",
      "บางยอ",
      "บางกะเจ้า",
      "บางน้ำผึ้ง",
      "บางกระสอบ",
      "บางกอบัว",
      "ทรงคนอง",
      "สำโรง",
      "สำโรงกลาง"
    ],
    "พระสมุทรเจดีย์": [
      "นาเกลือ",
      "บ้านคลองสวน",
      "แหลมฟ้าผ่า",
      "ปากคลองบางปลากด",
      "ในคลองบางปลากด"
    ],
    "บางเสาธง": [
      "บางเสาธง",
      "ศีรษะจรเข้น้อย",
      "ศีรษะจรเข้ใหญ่"
    ]
  },
  "นนทบุรี": {
    "เมืองนนทบุรี": [
      "สวนใหญ่",
      "ตลาดขวัญ",
      "บางเขน",
      "บางกระสอ",
      "ท่าทราย",
      "บางไผ่",
      "บางศรีเมือง",
      "บางกร่าง",
      "ไทรม้า",
      "บางรักน้อย"
    ],
    "บางกรวย": [
      "วัดชลอ",
      "บางกรวย",
      "บางสีทอง",
      "บางขนุน",
      "บางขุนกอง",
      "บางคูเวียง",
      "มหาสวัสดิ์",
      "ปลายบาง",
      "ศาลากลาง"
    ],
    "บางใหญ่": [
      "บางม่วง",
      "บางแม่นาง",
      "บางเลน",
      "เสาธงหิน",
      "บางใหญ่",
      "บ้านใหม่"
    ],
    "บางบัวทอง": [
      "โสนลอย",
      "บางบัวทอง",
      "บางรักใหญ่",
      "บางคูรัด",
      "ละหาร",
      "ลำโพ",
      "พิมลราช",
      "บางรักพัฒนา"
    ],
    "ไทรน้อย": [
      "ไทรน้อย",
      "ราษฎร์นิยม",
      "หนองเพรางาย",
      "ไทรใหญ่",
      "ขุนศรี",
      "คลองขวาง",
      "ทวีวัฒนา"
    ],
    "ปากเกร็ด": [
      "ปากเกร็ด",
      "บางตลาด",
      "บ้านใหม่",
      "บางพูด",
      "บางตะไนย์",
      "คลองพระอุดม",
      "ท่าอิฐ",
      "เกาะเกร็ด",
      "อ้อมเกร็ด",
      "คลองข่อย",
      "บางพลับ",
      "คลองเกลือ"
    ]
  },
  "ปทุมธานี": {
    "เมืองปทุมธานี": [
      "บางปรอก",
      "บ้านใหม่",
      "บ้านกลาง",
      "บ้านฉาง",
      "บ้านกระแชง",
      "บางขะแยง",
      "บางคูวัด",
      "บางหลวง",
      "บางเดื่อ",
      "บางพูด",
      "บางพูน",
      "บางกะดี",
      "สวนพริกไทย",
      "หลักหก"
    ],
    "คลองหลวง": [
      "คลองหนึ่ง",
      "คลองสอง",
      "คลองสาม",
      "คลองสี่",
      "คลองห้า",
      "คลองหก",
      "คลองเจ็ด"
    ],
    "ธัญบุรี": [
      "ประชาธิปัตย์",
      "บึงยี่โถ",
      "รังสิต",
      "ลำผักกูด",
      "บึงสนั่น",
      "บึงน้ำรักษ์"
    ],
    "หนองเสือ": [
      "บึงบา",
      "บึงบอน",
      "บึงกาสาม",
      "บึงชำอ้อ",
      "หนองสามวัง",
      "ศาลาครุ",
      "นพรัตน์"
    ],
    "ลาดหลุมแก้ว": [
      "ระแหง",
      "ลาดหลุมแก้ว",
      "คูบางหลวง",
      "คูขวาง",
      "คลองพระอุดม",
      "บ่อเงิน",
      "หน้าไม้"
    ],
    "ลำลูกกา": [
      "คูคต",
      "ลาดสวาย",
      "บึงคำพร้อย",
      "ลำลูกกา",
      "บึงทองหลาง",
      "ลำไทร",
      "บึงคอไห",
      "พืชอุดม"
    ],
    "สามโคก": [
      "บางเตย",
      "คลองควาย",
      "สามโคก",
      "กระแชง",
      "บางโพธิ์เหนือ",
      "เชียงรากใหญ่",
      "บ้านปทุม",
      "บ้านงิ้ว",
      "เชียงรากน้อย",
      "บางกระบือ",
      "ท้ายเกาะ"
    ]
  },
  "พระนครศรีอยุธยา": {
    "พระนครศรีอยุธยา": [
      "ประตูชัย",
      "กะมัง",
      "หอรัตนไชย",
      "หัวรอ",
      "ท่าวาสุกรี",
      "ไผ่ลิง",
      "ปากกราน",
      "ภูเขาทอง",
      "สำเภาล่ม",
      "สวนพริก",
      "คลองตะเคียน",
      "วัดตูม",
      "หันตรา",
      "ลุมพลี",
      "บ้านใหม่",
      "บ้านเกาะ",
      "คลองสวนพลู",
      "คลองสระบัว",
      "เกาะเรียน",
      "บ้านป้อม",
      "บ้านรุน"
    ],
    "ท่าเรือ": [
      "ท่าเรือ",
      "จำปา",
      "ท่าหลวง",
      "บ้านร่อม",
      "ศาลาลอย",
      "วังแดง",
      "โพธิ์เอน",
      "ปากท่า",
      "หนองขนาก",
      "ท่าเจ้าสนุก"
    ],
    "นครหลวง": [
      "นครหลวง",
      "ท่าช้าง",
      "บ่อโพง",
      "บ้านชุ้ง",
      "ปากจั่น",
      "บางระกำ",
      "บางพระครู",
      "แม่ลา",
      "หนองปลิง",
      "คลองสะแก",
      "สามไถ",
      "พระนอน"
    ],
    "บางไทร": [
      "บางไทร",
      "บางพลี",
      "สนามชัย",
      "บ้านแป้ง",
      "หน้าไม้",
      "บางยี่โท",
      "แคออก",
      "แคตก",
      "ช่างเหล็ก",
      "กระแชง",
      "บ้านกลึง",
      "ช้างน้อย",
      "ห่อหมก",
      "ไผ่พระ",
      "กกแก้วบูรพา",
      "ไม้ตรา",
      "บ้านม้า",
      "บ้านเกาะ",
      "ราชคราม",
      "ช้างใหญ่",
      "โพแตง",
      "เชียงรากน้อย",
      "โคกช้าง"
    ],
    "บางบาล": [
      "บางบาล",
      "วัดยม",
      "ไทรน้อย",
      "สะพานไทย",
      "มหาพราหมณ์",
      "กบเจา",
      "บ้านคลัง",
      "พระขาว",
      "น้ำเต้า",
      "ทางช้าง",
      "วัดตะกู",
      "บางหลวง",
      "บางหลวงโดด",
      "บางหัก",
      "บางชะนี",
      "บ้านกุ่ม"
    ],
    "บางปะอิน": [
      "บ้านเลน",
      "เชียงรากน้อย",
      "บ้านโพ",
      "บ้านกรด",
      "บางกระสั้น",
      "คลองจิก",
      "บ้านหว้า",
      "วัดยม",
      "บางประแดง",
      "สามเรือน",
      "เกาะเกิด",
      "บ้านพลับ",
      "บ้านแป้ง",
      "คุ้งลาน",
      "ตลิ่งชัน",
      "บ้านสร้าง",
      "ตลาดเกรียบ",
      "ขนอนหลวง"
    ],
    "บางปะหัน": [
      "บางปะหัน",
      "ขยาย",
      "บางเดื่อ",
      "เสาธง",
      "ทางกลาง",
      "บางเพลิง",
      "หันสัง",
      "บางนางร้า",
      "ตานิม",
      "ทับน้ำ",
      "บ้านม้า",
      "ขวัญเมือง",
      "บ้านลี่",
      "โพธิ์สามต้น",
      "พุทเลา",
      "ตาลเอน",
      "บ้านขล้อ"
    ],
    "ผักไห่": [
      "ผักไห่",
      "อมฤต",
      "บ้านแค",
      "ลาดน้ำเค็ม",
      "ตาลาน",
      "ท่าดินแดง",
      "ดอนลาน",
      "นาคู",
      "กุฎี",
      "ลำตะเคียน",
      "โคกช้าง",
      "จักราช",
      "หนองน้ำใหญ่",
      "ลาดชิด",
      "หน้าโคก",
      "บ้านใหญ่"
    ],
    "ภาชี": [
      "ภาชี",
      "โคกม่วง",
      "ระโสม",
      "หนองน้ำใส",
      "ดอนหญ้านาง",
      "ไผ่ล้อม",
      "กระจิว",
      "พระแก้ว"
    ],
    "ลาดบัวหลวง": [
      "ลาดบัวหลวง",
      "หลักชัย",
      "สามเมือง",
      "พระยาบันลือ",
      "สิงหนาท",
      "คู้สลอด",
      "คลองพระยาบันลือ"
    ],
    "วังน้อย": [
      "ลำตาเสา",
      "บ่อตาโล่",
      "วังน้อย",
      "ลำไทร",
      "สนับทึบ",
      "พยอม",
      "หันตะเภา",
      "วังจุฬา",
      "ข้าวงาม",
      "ชะแมบ"
    ],
    "เสนา": [
      "เสนา",
      "บ้านแพน",
      "เจ้าเจ็ด",
      "สามกอ",
      "บางนมโค",
      "หัวเวียง",
      "มารวิชัย",
      "บ้านโพธิ์",
      "รางจรเข้",
      "บ้านกระทุ่ม",
      "บ้านแถว",
      "ชายนา",
      "สามตุ่ม",
      "ลาดงา",
      "ดอนทอง",
      "บ้านหลวง",
      "เจ้าเสด็จ"
    ],
    "บางซ้าย": [
      "บางซ้าย",
      "แก้วฟ้า",
      "เต่าเล่า",
      "ปลายกลัด",
      "เทพมงคล",
      "วังพัฒนา"
    ],
    "อุทัย": [
      "คานหาม",
      "บ้านช้าง",
      "สามบัณฑิต",
      "บ้านหีบ",
      "หนองไม้ซุง",
      "อุทัย",
      "เสนา",
      "หนองน้ำส้ม",
      "โพสาวหาญ",
      "ธนู",
      "ข้าวเม่า"
    ],
    "มหาราช": [
      "หัวไผ่",
      "กะทุ่ม",
      "มหาราช",
      "น้ำเต้า",
      "บางนา",
      "โรงช้าง",
      "เจ้าปลุก",
      "พิตเพียน",
      "บ้านนา",
      "บ้านขวาง",
      "ท่าตอ",
      "บ้านใหม่"
    ],
    "บ้านแพรก": [
      "บ้านแพรก",
      "บ้านใหม่",
      "สำพะเนียง",
      "คลองน้อย",
      "สองห้อง"
    ]
  },
  "อ่างทอง": {
    "เมืองอ่างทอง": [
      "ตลาดหลวง",
      "บางแก้ว",
      "ศาลาแดง",
      "ป่างิ้ว",
      "บ้านแห",
      "ตลาดกรวด",
      "มหาดไทย",
      "บ้านอิฐ",
      "หัวไผ่",
      "จำปาหล่อ",
      "โพสะ",
      "บ้านรี",
      "คลองวัว",
      "ย่านซื่อ"
    ],
    "ไชโย": [
      "จรเข้ร้อง",
      "ไชยภูมิ",
      "ชัยฤทธิ์",
      "เทวราช",
      "ราชสถิตย์",
      "ไชโย",
      "หลักฟ้า",
      "ชะไว",
      "ตรีณรงค์"
    ],
    "ป่าโมก": [
      "บางปลากด",
      "ป่าโมก",
      "สายทอง",
      "โรงช้าง",
      "บางเสด็จ",
      "นรสิงห์",
      "เอกราช",
      "โผงเผง"
    ],
    "โพธิ์ทอง": [
      "อ่างแก้ว",
      "อินทประมูล",
      "บางพลับ",
      "หนองแม่ไก่",
      "รำมะสัก",
      "บางระกำ",
      "โพธิ์รังนก",
      "องครักษ์",
      "โคกพุทรา",
      "ยางช้าย",
      "บ่อแร่",
      "ทางพระ",
      "สามง่าม",
      "บางเจ้าฉ่า",
      "คำหยาด"
    ],
    "แสวงหา": [
      "แสวงหา",
      "ศรีพราน",
      "บ้านพราน",
      "วังน้ำเย็น",
      "สีบัวทอง",
      "ห้วยไผ่",
      "จำลอง"
    ],
    "วิเศษชัยชาญ": [
      "ไผ่จำศิล",
      "ศาลเจ้าโรงทอง",
      "ไผ่ดำพัฒนา",
      "สาวร้องไห้",
      "ท่าช้าง",
      "ยี่ล้น",
      "บางจัก",
      "ห้วยคันแหลน",
      "คลองขนาก",
      "ไผ่วง",
      "สี่ร้อย",
      "ม่วงเตี้ย",
      "หัวตะพาน",
      "หลักแก้ว",
      "ตลาดใหม่"
    ],
    "สามโก้": [
      "สามโก้",
      "ราษฎรพัฒนา",
      "อบทม",
      "โพธิ์ม่วงพันธ์",
      "มงคลธรรมนิมิต"
    ]
  },
  "ลพบุรี": {
    "เมืองลพบุรี": [
      "ทะเลชุบศร",
      "ท่าหิน",
      "กกโก",
      "โก่งธนู",
      "เขาพระงาม",
      "เขาสามยอด",
      "โคกกะเทียม",
      "โคกลำพาน",
      "โคกตูม",
      "งิ้วราย",
      "ดอนโพธิ์",
      "ตะลุง",
      "ท่าแค",
      "ท่าศาลา",
      "นิคมสร้างตนเอง",
      "บางขันหมาก",
      "บ้านข่อย",
      "ท้ายตลาด",
      "ป่าตาล",
      "พรหมมาสตร์",
      "โพธิ์เก้าต้น",
      "โพธิ์ตรุ",
      "สี่คลอง",
      "ถนนใหญ่"
    ],
    "พัฒนานิคม": [
      "พัฒนานิคม",
      "ช่องสาริกา",
      "มะนาวหวาน",
      "ดีลัง",
      "โคกสลุง",
      "ชอนน้อย",
      "หนองบัว",
      "ห้วยขุนราม",
      "น้ำสุด"
    ],
    "โคกสำโรง": [
      "โคกสำโรง",
      "เกาะแก้ว",
      "ถลุงเหล็ก",
      "หลุมข้าว",
      "ห้วยโป่ง",
      "คลองเกตุ",
      "สะแกราบ",
      "เพนียด",
      "วังเพลิง",
      "ดงมะรุม",
      "วังขอนขว้าง",
      "วังจั่น",
      "หนองแขม"
    ],
    "ชัยบาดาล": [
      "ลำนารายณ์",
      "ชัยนารายณ์",
      "ศิลาทิพย์",
      "ห้วยหิน",
      "ม่วงค่อม",
      "บัวชุม",
      "ท่าดินดำ",
      "มะกอกหวาน",
      "ซับตะเคียน",
      "นาโสม",
      "หนองยายโต๊ะ",
      "เกาะรัง",
      "ท่ามะนาว",
      "นิคมลำนารายณ์",
      "ชัยบาดาล",
      "บ้านใหม่สามัคคี",
      "เขาแหลม"
    ],
    "ท่าวุ้ง": [
      "ท่าวุ้ง",
      "บางคู้",
      "โพตลาดแก้ว",
      "บางลี่",
      "บางงา",
      "โคกสลุด",
      "เขาสมอคอน",
      "หัวสำโรง",
      "ลาดสาลี่",
      "บ้านเบิก",
      "มุจลินท์"
    ],
    "บ้านหมี่": [
      "ไผ่ใหญ่",
      "บ้านทราย",
      "บ้านกล้วย",
      "ดงพลับ",
      "บ้านชี",
      "พุคา",
      "หินปัก",
      "บางพึ่ง",
      "หนองทรายขาว",
      "บางกะพี้",
      "หนองเต่า",
      "โพนทอง",
      "บางขาม",
      "ดอนดึง",
      "ชอนม่วง",
      "หนองกระเบียน",
      "สายห้วยแก้ว",
      "มหาสอน",
      "บ้านหมี่",
      "เชียงงา",
      "หนองเมือง",
      "สนามแจง"
    ],
    "ท่าหลวง": [
      "ท่าหลวง",
      "แก่งผักกูด",
      "ซับจำปา",
      "หนองผักแว่น",
      "ทะเลวังวัด",
      "หัวลำ"
    ],
    "สระโบสถ์": [
      "สระโบสถ์",
      "มหาโพธิ",
      "ทุ่งท่าช้าง",
      "ห้วยใหญ่",
      "นิยมชัย"
    ],
    "โคกเจริญ": [
      "โคกเจริญ",
      "ยางราก",
      "หนองมะค่า",
      "วังทอง",
      "โคกแสมสาร"
    ],
    "ลำสนธิ": [
      "ลำสนธิ",
      "ซับสมบูรณ์",
      "หนองรี",
      "กุดตาเพชร",
      "เขารวก",
      "เขาน้อย"
    ],
    "หนองม่วง": [
      "หนองม่วง",
      "บ่อทอง",
      "ดงดินแดง",
      "ชอนสมบูรณ์",
      "ยางโทน",
      "ชอนสารเดช"
    ]
  },
  "สิงห์บุรี": {
    "เมืองสิงห์บุรี": [
      "บางพุทรา",
      "บางมัญ",
      "โพกรวม",
      "ม่วงหมู่",
      "หัวไผ่",
      "ต้นโพธิ์",
      "จักรสีห์",
      "บางกระบือ"
    ],
    "บางระจัน": [
      "สิงห์",
      "ไม้ดัด",
      "เชิงกลัด",
      "โพชนไก่",
      "แม่ลา",
      "บ้านจ่า",
      "พักทัน",
      "สระแจง"
    ],
    "ค่ายบางระจัน": [
      "โพทะเล",
      "บางระจัน",
      "โพสังโฆ",
      "ท่าข้าม",
      "คอทราย",
      "หนองกระทุ่ม"
    ],
    "พรหมบุรี": [
      "พระงาม",
      "พรหมบุรี",
      "บางน้ำเชี่ยว",
      "บ้านหม้อ",
      "บ้านแป้ง",
      "หัวป่า",
      "โรงช้าง"
    ],
    "ท่าช้าง": [
      "ถอนสมอ",
      "โพประจักษ์",
      "วิหารขาว",
      "พิกุลทอง"
    ],
    "อินทร์บุรี": [
      "อินทร์บุรี",
      "ประศุก",
      "ทับยา",
      "งิ้วราย",
      "ชีน้ำร้าย",
      "ท่างาม",
      "น้ำตาล",
      "ทองเอน",
      "ห้วยชัน",
      "โพธิ์ชัย"
    ]
  },
  "ชัยนาท": {
    "เมืองชัยนาท": [
      "ในเมือง",
      "บ้านกล้วย",
      "ท่าชัย",
      "ชัยนาท",
      "เขาท่าพระ",
      "หาดท่าเสา",
      "ธรรมามูล",
      "เสือโฮก",
      "นางลือ"
    ],
    "มโนรมย์": [
      "คุ้งสำเภา",
      "วัดโคก",
      "ศิลาดาน",
      "ท่าฉนวน",
      "หางน้ำสาคร",
      "ไร่พัฒนา",
      "อู่ตะเภา"
    ],
    "วัดสิงห์": [
      "วัดสิงห์",
      "มะขามเฒ่า",
      "หนองน้อย",
      "หนองบัว",
      "หนองขุ่น",
      "บ่อแร่",
      "วังหมัน"
    ],
    "สรรพยา": [
      "สรรพยา",
      "ตลุก",
      "เขาแก้ว",
      "โพนางดำตก",
      "โพนางดำออก",
      "บางหลวง",
      "หาดอาษา"
    ],
    "สรรคบุรี": [
      "แพรกศรีราชา",
      "เที่ยงแท้",
      "ห้วยกรด",
      "โพงาม",
      "บางขุด",
      "ดงคอน",
      "ดอนกำ",
      "ห้วยกรดพัฒนา"
    ],
    "หันคา": [
      "หันคา",
      "บ้านเชี่ยน",
      "ไพรนกยูง",
      "หนองแซง",
      "ห้วยงู",
      "วังไก่เถื่อน",
      "เด่นใหญ่",
      "สามง่ามท่าโบสถ์"
    ],
    "หนองมะโมง": [
      "หนองมะโมง",
      "วังตะเคียน",
      "สะพานหิน",
      "กุดจอก"
    ],
    "เนินขาม": [
      "เนินขาม",
      "กะบกเตี้ย",
      "สุขเดือนห้า"
    ]
  },
  "สระบุรี": {
    "เมืองสระบุรี": [
      "ปากเพรียว",
      "ดาวเรือง",
      "นาโฉง",
      "โคกสว่าง",
      "หนองโน",
      "หนองยาว",
      "ปากข้าวสาร",
      "หนองปลาไหล",
      "กุดนกเปล้า",
      "ตลิ่งชัน",
      "ตะกุด"
    ],
    "แก่งคอย": [
      "แก่งคอย",
      "ทับกวาง",
      "ตาลเดี่ยว",
      "ห้วยแห้ง",
      "ท่าคล้อ",
      "หินซ้อน",
      "บ้านธาตุ",
      "บ้านป่า",
      "ท่าตูม",
      "ชะอม",
      "สองคอน",
      "เตาปูน",
      "ชำผักแพว",
      "ท่ามะปราง"
    ],
    "หนองแค": [
      "หนองแค",
      "กุ่มหัก",
      "คชสิทธิ์",
      "โคกตูม",
      "โคกแย้",
      "บัวลอย",
      "ไผ่ต่ำ",
      "โพนทอง",
      "ห้วยขมิ้น",
      "ห้วยทราย",
      "หนองไข่น้ำ",
      "หนองแขม",
      "หนองจิก",
      "หนองจรเข้",
      "หนองนาก",
      "หนองปลาหมอ",
      "หนองปลิง",
      "หนองโรง"
    ],
    "วิหารแดง": [
      "หนองหมู",
      "บ้านลำ",
      "คลองเรือ",
      "วิหารแดง",
      "หนองสรวง",
      "เจริญธรรม"
    ],
    "หนองแซง": [
      "หนองแซง",
      "หนองควายโซ",
      "หนองหัวโพ",
      "หนองสีดา",
      "หนองกบ",
      "ไก่เส่า",
      "โคกสะอาด",
      "ม่วงหวาน",
      "เขาดิน"
    ],
    "บ้านหมอ": [
      "บ้านหมอ",
      "บางโขมด",
      "สร่างโศก",
      "ตลาดน้อย",
      "หรเทพ",
      "โคกใหญ่",
      "ไผ่ขวาง",
      "บ้านครัว",
      "หนองบัว"
    ],
    "ดอนพุด": [
      "ดอนพุด",
      "ไผ่หลิ่ว",
      "บ้านหลวง",
      "ดงตะงาว"
    ],
    "หนองโดน": [
      "หนองโดน",
      "บ้านกลับ",
      "ดอนทอง",
      "บ้านโปร่ง"
    ],
    "พระพุทธบาท": [
      "พระพุทธบาท",
      "ขุนโขลน",
      "ธารเกษม",
      "นายาว",
      "พุคำจาน",
      "เขาวง",
      "ห้วยป่าหวาย",
      "พุกร่าง",
      "หนองแก"
    ],
    "เสาไห้": [
      "เสาไห้",
      "บ้านยาง",
      "หัวปลวก",
      "งิ้วงาม",
      "ศาลารีไทย",
      "ต้นตาล",
      "ท่าช้าง",
      "พระยาทด",
      "ม่วงงาม",
      "เริงราง",
      "เมืองเก่า",
      "สวนดอกไม้"
    ],
    "มวกเหล็ก": [
      "มวกเหล็ก",
      "มิตรภาพ",
      "หนองย่างเสือ",
      "ลำสมพุง",
      "ลำพญากลาง",
      "ซับสนุ่น"
    ],
    "วังม่วง": [
      "แสลงพัน",
      "คำพราน",
      "วังม่วง"
    ],
    "เฉลิมพระเกียรติ": [
      "เขาดินพัฒนา",
      "บ้านแก้ง",
      "ผึ้งรวง",
      "พุแค",
      "ห้วยบง",
      "หน้าพระลาน"
    ]
  },
  "ชลบุรี": {
    "เมืองชลบุรี": [
      "บางปลาสร้อย",
      "มะขามหย่ง",
      "บ้านโขด",
      "แสนสุข",
      "บ้านสวน",
      "หนองรี",
      "นาป่า",
      "หนองข้างคอก",
      "ดอนหัวฬ่อ",
      "หนองไม้แดง",
      "บางทราย",
      "คลองตำหรุ",
      "เหมือง",
      "บ้านปึก",
      "ห้วยกะปิ",
      "เสม็ด",
      "อ่างศิลา",
      "สำนักบก"
    ],
    "บ้านบึง": [
      "บ้านบึง",
      "คลองกิ่ว",
      "มาบไผ่",
      "หนองซ้ำซาก",
      "หนองบอนแดง",
      "หนองชาก",
      "หนองอิรุณ",
      "หนองไผ่แก้ว"
    ],
    "หนองใหญ่": [
      "หนองใหญ่",
      "คลองพลู",
      "หนองเสือช้าง",
      "ห้างสูง",
      "เขาซก"
    ],
    "บางละมุง": [
      "บางละมุง",
      "หนองปรือ",
      "หนองปลาไหล",
      "โป่ง",
      "เขาไม้แก้ว",
      "ห้วยใหญ่",
      "ตะเคียนเตี้ย",
      "นาเกลือ"
    ],
    "พานทอง": [
      "พานทอง",
      "หนองตำลึง",
      "มาบโป่ง",
      "หนองกะขะ",
      "หนองหงษ์",
      "โคกขี้หนอน",
      "บ้านเก่า",
      "หน้าประดู่",
      "บางนาง",
      "เกาะลอย",
      "บางหัก"
    ],
    "พนัสนิคม": [
      "พนัสนิคม",
      "หน้าพระธาตุ",
      "วัดหลวง",
      "บ้านเซิด",
      "นาเริก",
      "หมอนนาง",
      "สระสี่เหลี่ยม",
      "วัดโบสถ์",
      "กุฎโง้ง",
      "หัวถนน",
      "ท่าข้าม",
      "หนองปรือ",
      "หนองขยาด",
      "ทุ่งขวาง",
      "หนองเหียง",
      "นาวังหิน",
      "บ้านช้าง",
      "โคกเพลาะ",
      "ไร่หลักทอง",
      "นามะตูม"
    ],
    "ศรีราชา": [
      "ศรีราชา",
      "สุรศักดิ์",
      "ทุ่งสุขลา",
      "บึง",
      "หนองขาม",
      "เขาคันทรง",
      "บางพระ",
      "บ่อวิน"
    ],
    "เกาะสีชัง": [
      "ท่าเทววงษ์"
    ],
    "สัตหีบ": [
      "สัตหีบ",
      "นาจอมเทียน",
      "พลูตาหลวง",
      "บางเสร่",
      "แสมสาร"
    ],
    "บ่อทอง": [
      "บ่อทอง",
      "วัดสุวรรณ",
      "บ่อกวางทอง",
      "ธาตุทอง",
      "เกษตรสุวรรณ",
      "พลวงทอง"
    ],
    "เกาะจันทร์": [
      "เกาะจันทร์",
      "ท่าบุญมี"
    ]
  },
  "ระยอง": {
    "เมืองระยอง": [
      "ท่าประดู่",
      "เชิงเนิน",
      "ตะพง",
      "ปากน้ำ",
      "เพ",
      "แกลง",
      "บ้านแลง",
      "นาตาขวัญ",
      "เนินพระ",
      "กะเฉด",
      "ทับมา",
      "น้ำคอก",
      "ห้วยโป่ง",
      "มาบตาพุด",
      "สำนักทอง"
    ],
    "บ้านฉาง": [
      "สำนักท้อน",
      "พลา",
      "บ้านฉาง"
    ],
    "แกลง": [
      "ทางเกวียน",
      "วังหว้า",
      "ชากโดน",
      "เนินฆ้อ",
      "กร่ำ",
      "ชากพง",
      "กระแสบน",
      "บ้านนา",
      "ทุ่งควายกิน",
      "กองดิน",
      "คลองปูน",
      "พังราด",
      "ปากน้ำกระแส",
      "ห้วยยาง",
      "สองสลึง"
    ],
    "วังจันทร์": [
      "วังจันทร์",
      "ชุมแสง",
      "ป่ายุบใน",
      "พลงตาเอี่ยม"
    ],
    "บ้านค่าย": [
      "บ้านค่าย",
      "หนองละลอก",
      "หนองตะพาน",
      "ตาขัน",
      "บางบุตร",
      "หนองบัว",
      "ชากบก"
    ],
    "ปลวกแดง": [
      "ปลวกแดง",
      "ตาสิทธิ์",
      "ละหาร",
      "แม่น้ำคู้",
      "มาบยางพร",
      "หนองไร่"
    ],
    "เขาชะเมา": [
      "น้ำเป็น",
      "ห้วยทับมอญ",
      "ชำฆ้อ",
      "เขาน้อย"
    ],
    "นิคมพัฒนา": [
      "นิคมพัฒนา",
      "มาบข่า",
      "พนานิคม",
      "มะขามคู่"
    ]
  },
  "จันทบุรี": {
    "เมืองจันทบุรี": [
      "ตลาด",
      "วัดใหม่",
      "คลองนารายณ์",
      "เกาะขวาง",
      "คมบาง",
      "ท่าช้าง",
      "จันทนิมิต",
      "บางกะจะ",
      "แสลง",
      "หนองบัว",
      "พลับพลา"
    ],
    "ขลุง": [
      "ขลุง",
      "บ่อ",
      "เกวียนหัก",
      "ตะปอน",
      "บางชัน",
      "วันยาว",
      "ซึ้ง",
      "มาบไพ",
      "วังสรรพรส",
      "ตรอกนอง",
      "ตกพรม",
      "บ่อเวฬุ"
    ],
    "ท่าใหม่": [
      "ท่าใหม่",
      "ยายร้า",
      "สีพยา",
      "บ่อพุ",
      "พลอยแหวน",
      "เขาวัว",
      "เขาบายศรี",
      "สองพี่น้อง",
      "ทุ่งเบญจา",
      "รำพัน",
      "โขมง",
      "ตะกาดเง้า",
      "คลองขุด",
      "เขาแก้ว"
    ],
    "โป่งน้ำร้อน": [
      "ทับไทร",
      "โป่งน้ำร้อน",
      "หนองตาคง",
      "เทพนิมิต",
      "คลองใหญ่"
    ],
    "มะขาม": [
      "มะขาม",
      "ท่าหลวง",
      "ปัถวี",
      "วังแซ้ม",
      "ฉมัน",
      "อ่างคีรี"
    ],
    "แหลมสิงห์": [
      "ปากน้ำแหลมสิงห์",
      "เกาะเปริด",
      "หนองชิ่ม",
      "พลิ้ว",
      "คลองน้ำเค็ม",
      "บางสระเก้า",
      "บางกะไชย"
    ],
    "สอยดาว": [
      "ปะตง",
      "ทุ่งขนาน",
      "ทับช้าง",
      "ทรายขาว",
      "สะตอน"
    ],
    "แก่งหางแมว": [
      "แก่งหางแมว",
      "ขุนซ่อง",
      "สามพี่น้อง",
      "พวา",
      "เขาวงกต"
    ],
    "นายายอาม": [
      "นายายอาม",
      "วังโตนด",
      "กระแจะ",
      "สนามไชย",
      "ช้างข้าม",
      "วังใหม่"
    ],
    "เขาคิชฌกูฏ": [
      "ชากไทย",
      "พลวง",
      "ตะเคียนทอง",
      "คลองพลู",
      "จันทเขลม"
    ]
  },
  "ตราด": {
    "เมืองตราด": [
      "บางพระ",
      "หนองเสม็ด",
      "หนองโสน",
      "หนองคันทรง",
      "ห้วงน้ำขาว",
      "อ่าวใหญ่",
      "วังกระแจะ",
      "ห้วยแร้ง",
      "เนินทราย",
      "ท่าพริก",
      "ท่ากุ่ม",
      "ตะกาง",
      "ชำราก",
      "แหลมกลัด"
    ],
    "คลองใหญ่": [
      "คลองใหญ่",
      "ไม้รูด",
      "หาดเล็ก"
    ],
    "เขาสมิง": [
      "เขาสมิง",
      "แสนตุ้ง",
      "วังตะเคียน",
      "ท่าโสม",
      "สะตอ",
      "ประณีต",
      "เทพนิมิต",
      "ทุ่งนนทรี"
    ],
    "บ่อไร่": [
      "บ่อพลอย",
      "ช้างทูน",
      "ด่านชุมพล",
      "หนองบอน",
      "นนทรีย์"
    ],
    "แหลมงอบ": [
      "แหลมงอบ",
      "น้ำเชี่ยว",
      "บางปิด",
      "คลองใหญ่"
    ],
    "เกาะกูด": [
      "เกาะหมาก",
      "เกาะกูด"
    ],
    "เกาะช้าง": [
      "เกาะช้าง",
      "เกาะช้างใต้"
    ]
  },
  "ฉะเชิงเทรา": {
    "เมืองฉะเชิงเทรา": [
      "หน้าเมือง",
      "ท่าไข่",
      "บ้านใหม่",
      "คลองนา",
      "บางตีนเป็ด",
      "บางไผ่",
      "คลองจุกกระเฌอ",
      "บางแก้ว",
      "บางขวัญ",
      "คลองนครเนื่องเขต",
      "วังตะเคียน",
      "โสธร",
      "บางพระ",
      "บางกะไห",
      "หนามแดง",
      "คลองเปรง",
      "คลองอุดมชลจร",
      "คลองหลวงแพ่ง",
      "บางเตย"
    ],
    "บางคล้า": [
      "บางคล้า",
      "บางสวน",
      "บางกระเจ็ด",
      "ปากน้ำ",
      "ท่าทองหลาง",
      "สาวชะโงก",
      "เสม็ดเหนือ",
      "เสม็ดใต้",
      "หัวไทร"
    ],
    "บางน้ำเปรี้ยว": [
      "บางน้ำเปรี้ยว",
      "บางขนาก",
      "สิงโตทอง",
      "หมอนทอง",
      "บึงน้ำรักษ์",
      "ดอนเกาะกา",
      "โยธะกา",
      "ดอนฉิมพลี",
      "ศาลาแดง",
      "โพรงอากาศ"
    ],
    "บางปะกง": [
      "บางปะกง",
      "ท่าสะอ้าน",
      "บางวัว",
      "บางสมัคร",
      "บางผึ้ง",
      "บางเกลือ",
      "สองคลอง",
      "หนองจอก",
      "พิมพา",
      "ท่าข้าม",
      "หอมศีล",
      "เขาดิน"
    ],
    "บ้านโพธิ์": [
      "บ้านโพธิ์",
      "เกาะไร่",
      "คลองขุด",
      "คลองบ้านโพธิ์",
      "คลองประเวศ",
      "ดอนทราย",
      "เทพราช",
      "ท่าพลับ",
      "หนองตีนนก",
      "หนองบัว",
      "บางซ่อน",
      "บางกรูด",
      "แหลมประดู่",
      "ลาดขวาง",
      "สนามจันทร์",
      "แสนภูดาษ",
      "สิบเอ็ดศอก"
    ],
    "พนมสารคาม": [
      "เกาะขนุน",
      "บ้านซ่อง",
      "พนมสารคาม",
      "เมืองเก่า",
      "หนองยาว",
      "ท่าถ่าน",
      "หนองแหน",
      "เขาหินซ้อน"
    ],
    "ราชสาส์น": [
      "บางคา",
      "เมืองใหม่",
      "ดงน้อย"
    ],
    "สนามชัยเขต": [
      "คู้ยายหมี",
      "ท่ากระดาน",
      "ทุ่งพระยา",
      "ลาดกระทิง"
    ],
    "แปลงยาว": [
      "แปลงยาว",
      "วังเย็น",
      "หัวสำโรง",
      "หนองไม้แก่น"
    ],
    "ท่าตะเกียบ": [
      "ท่าตะเกียบ",
      "คลองตะเกรา"
    ],
    "คลองเขื่อน": [
      "ก้อนแก้ว",
      "คลองเขื่อน",
      "บางเล่า",
      "บางโรง",
      "บางตลาด"
    ]
  },
  "ปราจีนบุรี": {
    "เมืองปราจีนบุรี": [
      "หน้าเมือง",
      "รอบเมือง",
      "วัดโบสถ์",
      "บางเดชะ",
      "ท่างาม",
      "บางบริบูรณ์",
      "ดงพระราม",
      "บ้านพระ",
      "โคกไม้ลาย",
      "ไม้เค็ด",
      "ดงขี้เหล็ก",
      "เนินหอม",
      "โนนห้อม"
    ],
    "กบินทร์บุรี": [
      "กบินทร์",
      "เมืองเก่า",
      "วังดาล",
      "นนทรี",
      "ย่านรี",
      "วังตะเคียน",
      "หาดนางแก้ว",
      "ลาดตะเคียน",
      "บ้านนา",
      "บ่อทอง",
      "หนองกี่",
      "นาแขม",
      "เขาไม้แก้ว",
      "วังท่าช้าง"
    ],
    "นาดี": [
      "นาดี",
      "สำพันตา",
      "สะพานหิน",
      "ทุ่งโพธิ์",
      "แก่งดินสอ",
      "บุพราหมณ์"
    ],
    "บ้านสร้าง": [
      "บ้านสร้าง",
      "บางกระเบา",
      "บางเตย",
      "บางยาง",
      "บางแตน",
      "บางพลวง",
      "บางปลาร้า",
      "บางขาม",
      "กระทุ่มแพ้ว"
    ],
    "ประจันตคาม": [
      "ประจันตคาม",
      "เกาะลอย",
      "บ้านหอย",
      "หนองแสง",
      "ดงบัง",
      "คำโตนด",
      "บุฝ้าย",
      "หนองแก้ว",
      "โพธิ์งาม"
    ],
    "ศรีมหาโพธิ": [
      "ศรีมหาโพธิ",
      "สัมพันธ์",
      "บ้านทาม",
      "ท่าตูม",
      "บางกุ้ง",
      "ดงกระทงยาม",
      "หนองโพรง",
      "หัวหว้า",
      "หาดยาง",
      "กรอกสมบูรณ์"
    ],
    "ศรีมโหสถ": [
      "โคกปีบ",
      "โคกไทย",
      "คู้ลำพัน",
      "ไผ่ชะเลือด"
    ]
  },
  "นครนายก": {
    "เมืองนครนายก": [
      "นครนายก",
      "ท่าช้าง",
      "บ้านใหญ่",
      "วังกระโจม",
      "ท่าทราย",
      "ดอนยอ",
      "ศรีจุฬา",
      "ดงละคร",
      "ศรีนาวา",
      "สาริกา",
      "หินตั้ง",
      "เขาพระ",
      "พรหมณี"
    ],
    "ปากพลี": [
      "เกาะหวาย",
      "เกาะโพธิ์",
      "ปากพลี",
      "โคกกรวด",
      "ท่าเรือ",
      "หนองแสง",
      "นาหินลาด"
    ],
    "บ้านนา": [
      "บ้านนา",
      "บ้านพร้าว",
      "บ้านพริก",
      "อาษา",
      "ทองหลาง",
      "บางอ้อ",
      "พิกุลออก",
      "ป่าขะ",
      "เขาเพิ่ม",
      "ศรีกะอาง"
    ],
    "องครักษ์": [
      "พระอาจารย์",
      "บึงศาล",
      "ศีรษะกระบือ",
      "โพธิ์แทน",
      "บางสมบูรณ์",
      "ทรายมูล",
      "บางปลากด",
      "บางลูกเสือ",
      "องครักษ์",
      "ชุมพล",
      "คลองใหญ่"
    ]
  },
  "สระแก้ว": {
    "เมืองสระแก้ว": [
      "สระแก้ว",
      "บ้านแก้ง",
      "ศาลาลำดวน",
      "โคกปี่ฆ้อง",
      "ท่าแยก",
      "ท่าเกษม",
      "สระขวัญ",
      "หนองบอน"
    ],
    "คลองหาด": [
      "คลองหาด",
      "ไทยอุดม",
      "ซับมะกรูด",
      "ไทรเดี่ยว",
      "คลองไก่เถื่อน",
      "เบญจขร",
      "ไทรทอง"
    ],
    "ตาพระยา": [
      "ตาพระยา",
      "ทัพเสด็จ",
      "ทัพราช",
      "ทัพไทย",
      "โคคลาน"
    ],
    "วังน้ำเย็น": [
      "วังน้ำเย็น",
      "ตาหลังใน",
      "คลองหินปูน",
      "ทุ่งมหาเจริญ"
    ],
    "วัฒนานคร": [
      "วัฒนานคร",
      "ท่าเกวียน",
      "ผักขะ",
      "โนนหมากเค็ง",
      "หนองน้ำใส",
      "ช่องกุ่ม",
      "หนองแวง",
      "แซร์ออ",
      "หนองหมากฝ้าย",
      "หนองตะเคียนบอน",
      "ห้วยโจด"
    ],
    "อรัญประเทศ": [
      "อรัญประเทศ",
      "เมืองไผ่",
      "หันทราย",
      "คลองน้ำใส",
      "ท่าข้าม",
      "ป่าไร่",
      "ทับพริก",
      "บ้านใหม่หนองไทร",
      "ผ่านศึก",
      "หนองสังข์",
      "คลองทับจันทร์",
      "ฟากห้วย",
      "บ้านด่าน"
    ],
    "เขาฉกรรจ์": [
      "เขาฉกรรจ์",
      "หนองหว้า",
      "พระเพลิง",
      "เขาสามสิบ"
    ],
    "โคกสูง": [
      "โคกสูง",
      "หนองม่วง",
      "หนองแวง",
      "โนนหมากมุ่น"
    ],
    "วังสมบูรณ์": [
      "วังสมบูรณ์",
      "วังใหม่",
      "วังทอง"
    ]
  },
  "นครราชสีมา": {
    "เมืองนครราชสีมา": [
      "ในเมือง",
      "โพธิ์กลาง",
      "หนองจะบก",
      "โคกสูง",
      "มะเริง",
      "หนองระเวียง",
      "ปรุใหญ่",
      "หมื่นไวย",
      "พลกรัง",
      "หนองไผ่ล้อม",
      "หัวทะเล",
      "บ้านเกาะ",
      "บ้านใหม่",
      "พุดซา",
      "บ้านโพธิ์",
      "จอหอ",
      "โคกกรวด",
      "ไชยมงคล",
      "หนองบัวศาลา",
      "สุรนารี",
      "สีมุม",
      "ตลาด",
      "พะเนา",
      "หนองกระทุ่ม",
      "หนองไข่น้ำ"
    ],
    "ครบุรี": [
      "แชะ",
      "เฉลียง",
      "ครบุรี",
      "โคกกระชาย",
      "จระเข้หิน",
      "มาบตะโกเอน",
      "อรพิมพ์",
      "บ้านใหม่",
      "ลำเพียก",
      "ครบุรีใต้",
      "ตะแบกบาน",
      "สระว่านพระยา"
    ],
    "เสิงสาง": [
      "เสิงสาง",
      "สระตะเคียน",
      "โนนสมบูรณ์",
      "กุดโบสถ์",
      "สุขไพบูลย์",
      "บ้านราษฎร์"
    ],
    "คง": [
      "เมืองคง",
      "คูขาด",
      "เทพาลัย",
      "ตาจั่น",
      "บ้านปรางค์",
      "หนองมะนาว",
      "หนองบัว",
      "โนนเต็ง",
      "ดอนใหญ่",
      "ขามสมบูรณ์"
    ],
    "บ้านเหลื่อม": [
      "บ้านเหลื่อม",
      "วังโพธิ์",
      "โคกกระเบื้อง",
      "ช่อระกา"
    ],
    "จักราช": [
      "จักราช",
      "ทองหลาง",
      "สีสุก",
      "หนองขาม",
      "หนองพลวง",
      "ศรีละกอ",
      "คลองเมือง",
      "หินโคน"
    ],
    "โชคชัย": [
      "กระโทก",
      "พลับพลา",
      "ท่าอ่าง",
      "ทุ่งอรุณ",
      "ท่าลาดขาว",
      "ท่าจะหลุง",
      "ท่าเยี่ยม",
      "โชคชัย",
      "ละลมใหม่พัฒนา",
      "ด่านเกวียน"
    ],
    "ด่านขุนทด": [
      "กุดพิมาน",
      "ด่านขุนทด",
      "ด่านนอก",
      "ด่านใน",
      "ตะเคียน",
      "บ้านเก่า",
      "บ้านแปรง",
      "พันชนะ",
      "สระจรเข้",
      "หนองกราด",
      "หนองบัวตะเกียด",
      "หนองบัวละคร",
      "หินดาด",
      "ห้วยบง",
      "โนนเมืองพัฒนา",
      "หนองไทร"
    ],
    "โนนไทย": [
      "โนนไทย",
      "ด่านจาก",
      "กำปัง",
      "สำโรง",
      "ค้างพลู",
      "บ้านวัง",
      "บัลลังก์",
      "สายออ",
      "ถนนโพธิ์",
      "มะค่า"
    ],
    "โนนสูง": [
      "โนนสูง",
      "ใหม่",
      "โตนด",
      "บิง",
      "ดอนชมพู",
      "ธารปราสาท",
      "หลุมข้าว",
      "มะค่า",
      "พลสงคราม",
      "จันอัด",
      "ขามเฒ่า",
      "ด่านคล้า",
      "ลำคอหงษ์",
      "เมืองปราสาท",
      "ดอนหวาย",
      "ลำมูล"
    ],
    "ขามสะแกแสง": [
      "ขามสะแกแสง",
      "โนนเมือง",
      "เมืองนาท",
      "ชีวึก",
      "พะงาด",
      "หนองหัวฟาน",
      "เมืองเกษตร"
    ],
    "บัวใหญ่": [
      "บัวใหญ่",
      "ห้วยยาง",
      "เสมาใหญ่",
      "ดอนตะหนิน",
      "หนองบัวสะอาด",
      "โนนทองหลาง",
      "กุดจอก",
      "ด่านช้าง",
      "ขุนทอง",
      "หนองแจ้งใหญ่"
    ],
    "ประทาย": [
      "ประทาย",
      "กระทุ่มราย",
      "วังไม้แดง",
      "ตลาดไทร",
      "หนองพลวง",
      "หนองค่าย",
      "หันห้วยทราย",
      "ดอนมัน",
      "นางรำ",
      "โนนเพ็ด",
      "ทุ่งสว่าง",
      "โคกกลาง",
      "เมืองโดน"
    ],
    "ปักธงชัย": [
      "เมืองปัก",
      "ตะคุ",
      "โคกไทย",
      "สำโรง",
      "ตะขบ",
      "นกออก",
      "ดอน",
      "ตูม",
      "งิ้ว",
      "สะแกราช",
      "ลำนางแก้ว",
      "ภูหลวง",
      "ธงชัยเหนือ",
      "สุขเกษม",
      "เกษมทรัพย์",
      "บ่อปลาทอง"
    ],
    "พิมาย": [
      "ในเมือง",
      "สัมฤทธิ์",
      "โบสถ์",
      "กระเบื้องใหญ่",
      "ท่าหลวง",
      "รังกาใหญ่",
      "ชีวาน",
      "นิคมสร้างตนเอง",
      "กระชอน",
      "ดงใหญ่",
      "ธารละหลอด",
      "หนองระเวียง"
    ],
    "ห้วยแถลง": [
      "ห้วยแถลง",
      "ทับสวาย",
      "เมืองพลับพลา",
      "หลุ่งตะเคียน",
      "หินดาด",
      "งิ้ว",
      "กงรถ",
      "หลุ่งประดู่",
      "ตะโก",
      "ห้วยแคน"
    ],
    "ชุมพวง": [
      "ชุมพวง",
      "ประสุข",
      "ท่าลาด",
      "สาหร่าย",
      "ตลาดไทร",
      "โนนรัง",
      "หนองหลัก",
      "โนนตูม",
      "โนนยอ"
    ],
    "สูงเนิน": [
      "สูงเนิน",
      "เสมา",
      "โคราช",
      "บุ่งขี้เหล็ก",
      "โนนค่า",
      "โค้งยาง",
      "มะเกลือเก่า",
      "มะเกลือใหม่",
      "นากลาง",
      "หนองตะไก้",
      "กุดจิก"
    ],
    "ขามทะเลสอ": [
      "ขามทะเลสอ",
      "โป่งแดง",
      "พันดุง",
      "หนองสรวง",
      "บึงอ้อ"
    ],
    "สีคิ้ว": [
      "สีคิ้ว",
      "บ้านหัน",
      "กฤษณา",
      "ลาดบัวขาว",
      "หนองหญ้าขาว",
      "กุดน้อย",
      "หนองน้ำใส",
      "วังโรงใหญ่",
      "มิตรภาพ",
      "คลองไผ่",
      "ดอนเมือง",
      "หนองบัวน้อย"
    ],
    "ปากช่อง": [
      "ปากช่อง",
      "กลางดง",
      "จันทึก",
      "วังกะทะ",
      "หมูสี",
      "หนองสาหร่าย",
      "ขนงพระ",
      "โป่งตาลอง",
      "คลองม่วง",
      "หนองน้ำแดง",
      "วังไทร",
      "พญาเย็น"
    ],
    "หนองบุญมาก": [
      "หนองบุนนาก",
      "สารภี",
      "ไทยเจริญ",
      "หนองหัวแรต",
      "แหลมทอง",
      "หนองตะไก้",
      "ลุงเขว้า",
      "หนองไม้ไผ่",
      "บ้านใหม่"
    ],
    "แก้งสนามนาง": [
      "แก้งสนามนาง",
      "โนนสำราญ",
      "บึงพะไล",
      "สีสุก",
      "บึงสำโรง"
    ],
    "โนนแดง": [
      "โนนแดง",
      "โนนตาเถร",
      "สำพะเนียง",
      "วังหิน",
      "ดอนยาวใหญ่"
    ],
    "วังน้ำเขียว": [
      "วังน้ำเขียว",
      "วังหมี",
      "ระเริง",
      "อุดมทรัพย์",
      "ไทยสามัคคี"
    ],
    "เทพารักษ์": [
      "สำนักตะคร้อ",
      "หนองแวง",
      "บึงปรือ",
      "วังยายทอง"
    ],
    "เมืองยาง": [
      "เมืองยาง",
      "กระเบื้องนอก",
      "ละหานปลาค้าว",
      "โนนอุดม"
    ],
    "พระทองคำ": [
      "สระพระ",
      "มาบกราด",
      "พังเทียม",
      "ทัพรั้ง",
      "หนองหอย"
    ],
    "ลำทะเมนชัย": [
      "ขุย",
      "บ้านยาง",
      "ช่องแมว",
      "ไพล"
    ],
    "บัวลาย": [
      "เมืองพะไล",
      "โนนจาน",
      "บัวลาย",
      "หนองหว้า"
    ],
    "สีดา": [
      "สีดา",
      "โพนทอง",
      "โนนประดู่",
      "สามเมือง",
      "หนองตาดใหญ่"
    ],
    "เฉลิมพระเกียรติ": [
      "ช้างทอง",
      "ท่าช้าง",
      "พระพุทธ",
      "หนองงูเหลือม",
      "หนองยาง"
    ]
  },
  "บุรีรัมย์": {
    "เมืองบุรีรัมย์": [
      "ในเมือง",
      "อิสาณ",
      "เสม็ด",
      "บ้านบัว",
      "สะแกโพรง",
      "สวายจีก",
      "บ้านยาง",
      "พระครู",
      "ถลุงเหล็ก",
      "หนองตาด",
      "ลุมปุ๊ก",
      "สองห้อง",
      "บัวทอง",
      "ชุมเห็ด",
      "หลักเขต",
      "สะแกซำ",
      "กลันทา",
      "กระสัง",
      "เมืองฝาง"
    ],
    "คูเมือง": [
      "คูเมือง",
      "ปะเคียบ",
      "บ้านแพ",
      "พรสำราญ",
      "หินเหล็กไฟ",
      "ตูมใหญ่",
      "หนองขมาร"
    ],
    "กระสัง": [
      "กระสัง",
      "ลำดวน",
      "สองชั้น",
      "สูงเนิน",
      "หนองเต็ง",
      "เมืองไผ่",
      "ชุมแสง",
      "บ้านปรือ",
      "ห้วยสำราญ",
      "กันทรารมย์",
      "ศรีภูมิ"
    ],
    "นางรอง": [
      "นางรอง",
      "สะเดา",
      "ชุมแสง",
      "หนองโบสถ์",
      "หนองกง",
      "ถนนหัก",
      "หนองไทร",
      "ก้านเหลือง",
      "บ้านสิงห์",
      "ลำไทรโยง",
      "ทรัพย์พระยา",
      "หนองยายพิมพ์",
      "หัวถนน",
      "ทุ่งแสงทอง",
      "หนองโสน"
    ],
    "หนองกี่": [
      "หนองกี่",
      "เย้ยปราสาท",
      "เมืองไผ่",
      "ดอนอะราง",
      "โคกสว่าง",
      "ทุ่งกระตาดพัฒนา",
      "ทุ่งกระเต็น",
      "ท่าโพธิ์ชัย",
      "โคกสูง",
      "บุกระสัง"
    ],
    "ละหานทราย": [
      "ละหานทราย",
      "ตาจง",
      "สำโรงใหม่",
      "หนองแวง",
      "หนองตะครอง",
      "โคกว่าน"
    ],
    "ประโคนชัย": [
      "ประโคนชัย",
      "แสลงโทน",
      "บ้านไทร",
      "ละเวี้ย",
      "จรเข้มาก",
      "ปังกู",
      "โคกย่าง",
      "โคกม้า",
      "ไพศาล",
      "ตะโกตาพิ",
      "เขาคอก",
      "หนองบอน",
      "โคกมะขาม",
      "โคกตูม",
      "ประทัดบุ",
      "สี่เหลี่ยม"
    ],
    "บ้านกรวด": [
      "บ้านกรวด",
      "โนนเจริญ",
      "หนองไม้งาม",
      "ปราสาท",
      "สายตะกู",
      "หินลาด",
      "บึงเจริญ",
      "จันทบเพชร",
      "เขาดินเหนือ"
    ],
    "พุทไธสง": [
      "พุทไธสง",
      "มะเฟือง",
      "บ้านจาน",
      "บ้านเป้า",
      "บ้านแวง",
      "บ้านยาง",
      "หายโศก"
    ],
    "ลำปลายมาศ": [
      "ลำปลายมาศ",
      "หนองคู",
      "แสลงพัน",
      "ทะเมนชัย",
      "ตลาดโพธิ์",
      "หนองกะทิง",
      "โคกกลาง",
      "โคกสะอาด",
      "เมืองแฝก",
      "บ้านยาง",
      "ผไทรินทร์",
      "โคกล่าม",
      "หินโคน",
      "หนองบัวโคก",
      "บุโพธิ์",
      "หนองโดน"
    ],
    "สตึก": [
      "สตึก",
      "นิคม",
      "ทุ่งวัง",
      "เมืองแก",
      "หนองใหญ่",
      "ร่อนทอง",
      "ดอนมนต์",
      "ชุมแสง",
      "ท่าม่วง",
      "สะแก",
      "สนามชัย",
      "กระสัง"
    ],
    "ปะคำ": [
      "ปะคำ",
      "ไทยเจริญ",
      "หนองบัว",
      "โคกมะม่วง",
      "หูทำนบ"
    ],
    "นาโพธิ์": [
      "นาโพธิ์",
      "บ้านคู",
      "บ้านดู่",
      "ดอนกอก",
      "ศรีสว่าง"
    ],
    "หนองหงส์": [
      "สระแก้ว",
      "ห้วยหิน",
      "ไทยสามัคคี",
      "หนองชัยศรี",
      "เสาเดียว",
      "เมืองฝ้าย",
      "สระทอง"
    ],
    "พลับพลาชัย": [
      "จันดุม",
      "โคกขมิ้น",
      "ป่าชัน",
      "สะเดา",
      "สำโรง"
    ],
    "ห้วยราช": [
      "ห้วยราช",
      "สามแวง",
      "ตาเสา",
      "บ้านตะโก",
      "สนวน",
      "โคกเหล็ก",
      "เมืองโพธิ์",
      "ห้วยราชา"
    ],
    "โนนสุวรรณ": [
      "โนนสุวรรณ",
      "ทุ่งจังหัน",
      "โกรกแก้ว",
      "ดงอีจาน"
    ],
    "ชำนิ": [
      "ชำนิ",
      "หนองปล่อง",
      "เมืองยาง",
      "ช่อผกา",
      "ละลวด",
      "โคกสนวน"
    ],
    "บ้านใหม่ไชยพจน์": [
      "หนองแวง",
      "ทองหลาง",
      "แดงใหญ่",
      "กู่สวนแตง",
      "หนองเยือง"
    ],
    "โนนดินแดง": [
      "โนนดินแดง",
      "ส้มป่อย",
      "ลำนางรอง"
    ],
    "บ้านด่าน": [
      "บ้านด่าน",
      "ปราสาท",
      "วังเหนือ",
      "โนนขวาง"
    ],
    "แคนดง": [
      "แคนดง",
      "ดงพลอง",
      "สระบัว",
      "หัวฝาย"
    ],
    "เฉลิมพระเกียรติ": [
      "เจริญสุข",
      "ตาเป๊ก",
      "อีสานเขต",
      "ถาวร",
      "ยายแย้มวัฒนา"
    ]
  },
  "สุรินทร์": {
    "เมืองสุรินทร์": [
      "ในเมือง",
      "ตั้งใจ",
      "เพี้ยราม",
      "นาดี",
      "ท่าสว่าง",
      "สลักได",
      "ตาอ็อง",
      "สำโรง",
      "แกใหญ่",
      "นอกเมือง",
      "คอโค",
      "สวาย",
      "เฉนียง",
      "เทนมีย์",
      "นาบัว",
      "เมืองที",
      "ราม",
      "บุฤาษี",
      "ตระแสง",
      "แสลงพันธ์",
      "กาเกาะ"
    ],
    "ชุมพลบุรี": [
      "ชุมพลบุรี",
      "นาหนองไผ่",
      "ไพรขลา",
      "ศรีณรงค์",
      "ยะวึก",
      "เมืองบัว",
      "สระขุด",
      "กระเบื้อง",
      "หนองเรือ"
    ],
    "ท่าตูม": [
      "ท่าตูม",
      "กระโพ",
      "พรมเทพ",
      "โพนครก",
      "เมืองแก",
      "บะ",
      "หนองบัว",
      "บัวโคก",
      "หนองเมธี",
      "ทุ่งกุลา"
    ],
    "จอมพระ": [
      "จอมพระ",
      "เมืองลีง",
      "กระหาด",
      "บุแกรง",
      "หนองสนิท",
      "บ้านผือ",
      "ลุ่มระวี",
      "ชุมแสง",
      "เป็นสุข"
    ],
    "ปราสาท": [
      "กังแอน",
      "ทมอ",
      "ไพล",
      "ปรือ",
      "ทุ่งมน",
      "ตาเบา",
      "หนองใหญ่",
      "โคกยาง",
      "โคกสะอาด",
      "บ้านไทร",
      "โชคนาสาม",
      "เชื้อเพลิง",
      "ปราสาททนง",
      "ตานี",
      "บ้านพลวง",
      "กันตวจระมวล",
      "สมุด",
      "ประทัดบุ"
    ],
    "กาบเชิง": [
      "กาบเชิง",
      "คูตัน",
      "ด่าน",
      "แนงมุด",
      "โคกตะเคียน",
      "ตะเคียน"
    ],
    "รัตนบุรี": [
      "รัตนบุรี",
      "ธาตุ",
      "แก",
      "ดอนแรด",
      "หนองบัวทอง",
      "หนองบัวบาน",
      "ไผ่",
      "เบิด",
      "น้ำเขียว",
      "กุดขาคีม",
      "ยางสว่าง",
      "ทับใหญ่"
    ],
    "สนม": [
      "สนม",
      "โพนโก",
      "หนองระฆัง",
      "นานวน",
      "แคน",
      "หัวงัว",
      "หนองอียอ"
    ],
    "ศีขรภูมิ": [
      "ระแงง",
      "ตรึม",
      "จารพัต",
      "ยาง",
      "แตล",
      "หนองบัว",
      "คาละแมะ",
      "หนองเหล็ก",
      "หนองขวาว",
      "ช่างปี่",
      "กุดหวาย",
      "ขวาวใหญ่",
      "นารุ่ง",
      "ตรมไพร",
      "ผักไหม"
    ],
    "สังขะ": [
      "สังขะ",
      "ขอนแตก",
      "ดม",
      "พระแก้ว",
      "บ้านจารย์",
      "กระเทียม",
      "สะกาด",
      "ตาตุม",
      "ทับทัน",
      "ตาคง",
      "บ้านชบ",
      "เทพรักษา"
    ],
    "ลำดวน": [
      "ลำดวน",
      "โชคเหนือ",
      "อู่โลก",
      "ตรำดม",
      "ตระเปียงเตีย"
    ],
    "สำโรงทาบ": [
      "สำโรงทาบ",
      "หนองไผ่ล้อม",
      "กระออม",
      "หนองฮะ",
      "ศรีสุข",
      "เกาะแก้ว",
      "หมื่นศรี",
      "เสม็จ",
      "สะโน",
      "ประดู่"
    ],
    "บัวเชด": [
      "บัวเชด",
      "สะเดา",
      "จรัส",
      "ตาวัง",
      "อาโพน",
      "สำเภาลูน"
    ],
    "พนมดงรัก": [
      "บักได",
      "โคกกลาง",
      "จีกแดก",
      "ตาเมียง"
    ],
    "ศรีณรงค์": [
      "ณรงค์",
      "แจนแวน",
      "ตรวจ",
      "หนองแวง",
      "ศรีสุข"
    ],
    "เขวาสินรินทร์": [
      "เขวาสินรินทร์",
      "บึง",
      "ตากูก",
      "ปราสาททอง",
      "บ้านแร่"
    ],
    "โนนนารายณ์": [
      "หนองหลวง",
      "คำผง",
      "โนน",
      "ระเวียง",
      "หนองเทพ"
    ]
  },
  "ศรีสะเกษ": {
    "เมืองศรีสะเกษ": [
      "เมืองเหนือ",
      "เมืองใต้",
      "คูซอด",
      "ซำ",
      "จาน",
      "ตะดอบ",
      "หนองครก",
      "โพนข่า",
      "โพนค้อ",
      "โพนเขวา",
      "หญ้าปล้อง",
      "ทุ่ม",
      "หนองไฮ",
      "หนองแก้ว",
      "น้ำคำ",
      "โพธิ์",
      "หมากเขียบ",
      "หนองไผ่"
    ],
    "ยางชุมน้อย": [
      "ยางชุมน้อย",
      "ลิ้นฟ้า",
      "คอนกาม",
      "โนนคูณ",
      "กุดเมืองฮาม",
      "บึงบอน",
      "ยางชุมใหญ่"
    ],
    "กันทรารมย์": [
      "ดูน",
      "โนนสัง",
      "หนองหัวช้าง",
      "ยาง",
      "หนองแวง",
      "หนองแก้ว",
      "ทาม",
      "ละทาย",
      "เมืองน้อย",
      "อีปาด",
      "บัวน้อย",
      "หนองบัว",
      "ดู่",
      "ผักแพว",
      "จาน",
      "คำเนียม"
    ],
    "กันทรลักษ์": [
      "บึงมะลู",
      "กุดเสลา",
      "เมือง",
      "สังเม็ก",
      "น้ำอ้อม",
      "ละลาย",
      "รุง",
      "ตระกาจ",
      "จานใหญ่",
      "ภูเงิน",
      "ชำ",
      "กระแชง",
      "โนนสำราญ",
      "หนองหญ้าลาด",
      "เสาธงชัย",
      "ขนุน",
      "สวนกล้วย",
      "เวียงเหนือ",
      "ทุ่งใหญ่",
      "ภูผาหมอก"
    ],
    "ขุขันธ์": [
      "กันทรารมย์",
      "จะกง",
      "ใจดี",
      "ดองกำเม็ด",
      "โสน",
      "ปรือใหญ่",
      "สะเดาใหญ่",
      "ตาอุด",
      "ห้วยเหนือ",
      "ห้วยใต้",
      "หัวเสือ",
      "ตะเคียน",
      "นิคมพัฒนา",
      "โคกเพชร",
      "ปราสาท",
      "สำโรงตาเจ็น",
      "ห้วยสำราญ",
      "กฤษณา",
      "ลมศักดิ์",
      "หนองฉลอง",
      "ศรีตระกูล",
      "ศรีสะอาด"
    ],
    "ไพรบึง": [
      "ไพรบึง",
      "ดินแดง",
      "ปราสาทเยอ",
      "สำโรงพลัน",
      "สุขสวัสดิ์",
      "โนนปูน"
    ],
    "ปรางค์กู่": [
      "พิมาย",
      "กู่",
      "หนองเชียงทูน",
      "ตูม",
      "สมอ",
      "โพธิ์ศรี",
      "สำโรงปราสาท",
      "ดู่",
      "สวาย",
      "พิมายเหนือ"
    ],
    "ขุนหาญ": [
      "สิ",
      "บักดอง",
      "พราน",
      "โพธิ์วงศ์",
      "ไพร",
      "กระหวัน",
      "ขุนหาญ",
      "โนนสูง",
      "กันทรอม",
      "ภูฝ้าย",
      "โพธิ์กระสังข์",
      "ห้วยจันทร์"
    ],
    "ราษีไศล": [
      "เมืองคง",
      "เมืองแคน",
      "หนองแค",
      "จิกสังข์ทอง",
      "ด่าน",
      "ดู่",
      "หนองอึ่ง",
      "บัวหุ่ง",
      "ไผ่",
      "ส้มป่อย",
      "หนองหมี",
      "หว้านคำ",
      "สร้างปี่"
    ],
    "อุทุมพรพิสัย": [
      "กำแพง",
      "อี่หล่ำ",
      "ก้านเหลือง",
      "ทุ่งไชย",
      "สำโรง",
      "แขม",
      "หนองไฮ",
      "ขะยูง",
      "ตาเกษ",
      "หัวช้าง",
      "รังแร้ง",
      "แต้",
      "แข้",
      "โพธิ์ชัย",
      "ปะอาว",
      "หนองห้าง",
      "สระกำแพงใหญ่",
      "โคกหล่าม",
      "โคกจาน"
    ],
    "บึงบูรพ์": [
      "เป๊าะ",
      "บึงบูรพ์"
    ],
    "ห้วยทับทัน": [
      "ห้วยทับทัน",
      "เมืองหลวง",
      "กล้วยกว้าง",
      "ผักไหม",
      "จานแสนไชย",
      "ปราสาท"
    ],
    "โนนคูณ": [
      "โนนค้อ",
      "บก",
      "โพธิ์",
      "หนองกุง",
      "เหล่ากวาง"
    ],
    "ศรีรัตนะ": [
      "ศรีแก้ว",
      "พิงพวย",
      "สระเยาว์",
      "ตูม",
      "เสื่องข้าว",
      "ศรีโนนงาม",
      "สะพุง"
    ],
    "น้ำเกลี้ยง": [
      "น้ำเกลี้ยง",
      "ละเอาะ",
      "ตองปิด",
      "เขิน",
      "รุ่งระวี",
      "คูบ"
    ],
    "วังหิน": [
      "บุสูง",
      "ธาตุ",
      "ดวนใหญ่",
      "บ่อแก้ว",
      "ศรีสำราญ",
      "ทุ่งสว่าง",
      "วังหิน",
      "โพนยาง"
    ],
    "ภูสิงห์": [
      "โคกตาล",
      "ห้วยตามอญ",
      "ห้วยตึ๊กชู",
      "ละลม",
      "ตะเคียนราม",
      "ดงรัก",
      "ไพรพัฒนา"
    ],
    "เมืองจันทร์": [
      "เมืองจันทร์",
      "ตาโกน",
      "หนองใหญ่"
    ],
    "เบญจลักษ์": [
      "เสียว",
      "หนองหว้า",
      "หนองงูเหลือม",
      "หนองฮาง",
      "ท่าคล้อ"
    ],
    "พยุห์": [
      "พยุห์",
      "พรหมสวัสดิ์",
      "ตำแย",
      "โนนเพ็ก",
      "หนองค้า"
    ],
    "โพธิ์ศรีสุวรรณ": [
      "โดด",
      "เสียว",
      "หนองม้า",
      "ผือใหญ่",
      "อีเซ"
    ],
    "ศิลาลาด": [
      "กุง",
      "คลีกลิ้ง",
      "หนองบัวดง",
      "โจดม่วง"
    ]
  },
  "อุบลราชธานี": {
    "เมืองอุบลราชธานี": [
      "ในเมือง",
      "หัวเรือ",
      "หนองขอน",
      "ปทุม",
      "ขามใหญ่",
      "แจระแม",
      "หนองบ่อ",
      "ไร่น้อย",
      "กระโสบ",
      "กุดลาด",
      "ขี้เหล็ก",
      "ปะอาว"
    ],
    "ศรีเมืองใหม่": [
      "นาคำ",
      "แก้งกอก",
      "เอือดใหญ่",
      "วาริน",
      "ลาดควาย",
      "สงยาง",
      "ตะบ่าย",
      "คำไหล",
      "หนามแท่ง",
      "นาเลิน",
      "ดอนใหญ่"
    ],
    "โขงเจียม": [
      "โขงเจียม",
      "ห้วยยาง",
      "นาโพธิ์กลาง",
      "หนองแสงใหญ่",
      "ห้วยไผ่"
    ],
    "เขื่องใน": [
      "เขื่องใน",
      "สร้างถ่อ",
      "ค้อทอง",
      "ก่อเอ้",
      "หัวดอน",
      "ชีทวน",
      "ท่าไห",
      "นาคำใหญ่",
      "แดงหม้อ",
      "ธาตุน้อย",
      "บ้านไทย",
      "บ้านกอก",
      "กลางใหญ่",
      "โนนรัง",
      "ยางขี้นก",
      "ศรีสุข",
      "สหธาตุ",
      "หนองเหล่า"
    ],
    "เขมราฐ": [
      "เขมราฐ",
      "ขามป้อม",
      "เจียด",
      "หนองผือ",
      "นาแวง",
      "แก้งเหนือ",
      "หนองนกทา",
      "หนองสิม",
      "หัวนา"
    ],
    "เดชอุดม": [
      "เมืองเดช",
      "นาส่วง",
      "นาเจริญ",
      "ทุ่งเทิง",
      "สมสะอาด",
      "กุดประทาย",
      "ตบหู",
      "กลาง",
      "แก้ง",
      "ท่าโพธิ์ศรี",
      "บัวงาม",
      "คำครั่ง",
      "นากระแซง",
      "โพนงาม",
      "ป่าโมง",
      "โนนสมบูรณ์"
    ],
    "นาจะหลวย": [
      "นาจะหลวย",
      "โนนสมบูรณ์",
      "พรสวรรค์",
      "บ้านตูม",
      "โสกแสง",
      "โนนสวรรค์"
    ],
    "น้ำยืน": [
      "โซง",
      "ยาง",
      "โดมประดิษฐ์",
      "บุเปือย",
      "สีวิเชียร",
      "ยางใหญ่",
      "เก่าขาม"
    ],
    "บุณฑริก": [
      "โพนงาม",
      "ห้วยข่า",
      "คอแลน",
      "นาโพธิ์",
      "หนองสะโน",
      "โนนค้อ",
      "บัวงาม",
      "บ้านแมด"
    ],
    "ตระการพืชผล": [
      "ขุหลุ",
      "กระเดียน",
      "เกษม",
      "กุศกร",
      "ขามเปี้ย",
      "คอนสาย",
      "โคกจาน",
      "นาพิน",
      "นาสะไม",
      "โนนกุง",
      "ตระการ",
      "ตากแดด",
      "ไหล่ทุ่ง",
      "เป้า",
      "เซเป็ด",
      "สะพือ",
      "หนองเต่า",
      "ถ้ำแข้",
      "ท่าหลวง",
      "ห้วยฝ้ายพัฒนา",
      "กุดยาลวน",
      "บ้านแดง",
      "คำเจริญ"
    ],
    "กุดข้าวปุ้น": [
      "ข้าวปุ้น",
      "โนนสวาง",
      "แก่งเค็ง",
      "กาบิน",
      "หนองทันน้ำ"
    ],
    "ม่วงสามสิบ": [
      "ม่วงสามสิบ",
      "เหล่าบก",
      "ดุมใหญ่",
      "หนองช้างใหญ่",
      "หนองเมือง",
      "เตย",
      "ยางสักกระโพหลุ่ม",
      "หนองไข่นก",
      "หนองเหล่า",
      "หนองฮาง",
      "ยางโยภาพ",
      "ไผ่ใหญ่",
      "นาเลิง",
      "โพนแพง"
    ],
    "วารินชำราบ": [
      "วารินชำราบ",
      "ธาตุ",
      "ท่าลาด",
      "โนนโหนน",
      "คูเมือง",
      "สระสมิง",
      "คำน้ำแซบ",
      "บุ่งหวาย",
      "คำขวาง",
      "โพธิ์ใหญ่",
      "แสนสุข",
      "หนองกินเพล",
      "โนนผึ้ง",
      "เมืองศรีไค",
      "ห้วยขะยุง",
      "บุ่งไหม"
    ],
    "พิบูลมังสาหาร": [
      "พิบูล",
      "กุดชมภู",
      "ดอนจิก",
      "ทรายมูล",
      "นาโพธิ์",
      "โนนกลาง",
      "โพธิ์ไทร",
      "โพธิ์ศรี",
      "ระเว",
      "ไร่ใต้",
      "หนองบัวฮี",
      "อ่างศิลา",
      "โนนกาหลง",
      "บ้านแขม"
    ],
    "ตาลสุม": [
      "ตาลสุม",
      "สำโรง",
      "จิกเทิง",
      "หนองกุง",
      "นาคาย",
      "คำหว้า"
    ],
    "โพธิ์ไทร": [
      "โพธิ์ไทร",
      "ม่วงใหญ่",
      "สำโรง",
      "สองคอน",
      "สารภี",
      "เหล่างาม"
    ],
    "สำโรง": [
      "สำโรง",
      "โคกก่อง",
      "หนองไฮ",
      "ค้อน้อย",
      "โนนกาเล็น",
      "โคกสว่าง",
      "โนนกลาง",
      "บอน",
      "ขามป้อม"
    ],
    "ดอนมดแดง": [
      "ดอนมดแดง",
      "เหล่าแดง",
      "ท่าเมือง",
      "คำไฮใหญ่"
    ],
    "สิรินธร": [
      "คันไร่",
      "ช่องเม็ก",
      "โนนก่อ",
      "นิคมสร้างตนเองลำโดมน้อย",
      "ฝางคำ",
      "คำเขื่อนแก้ว"
    ],
    "ทุ่งศรีอุดม": [
      "หนองอ้ม",
      "นาเกษม",
      "กุดเรือ",
      "โคกชำแระ",
      "นาห่อม"
    ],
    "นาเยีย": [
      "นาเยีย",
      "นาดี",
      "นาเรือง"
    ],
    "นาตาล": [
      "นาตาล",
      "พะลาน",
      "กองโพน",
      "พังเคน"
    ],
    "เหล่าเสือโก้ก": [
      "เหล่าเสือโก้ก",
      "โพนเมือง",
      "แพงใหญ่",
      "หนองบก"
    ],
    "สว่างวีระวงศ์": [
      "แก่งโดม",
      "ท่าช้าง",
      "บุ่งมะแลง",
      "สว่าง"
    ],
    "น้ำขุ่น": [
      "ตาเกา",
      "ไพบูลย์",
      "ขี้เหล็ก",
      "โคกสะอาด"
    ]
  },
  "ยโสธร": {
    "เมืองยโสธร": [
      "ในเมือง",
      "น้ำคำใหญ่",
      "ตาดทอง",
      "สำราญ",
      "ค้อเหนือ",
      "ดู่ทุ่ง",
      "เดิด",
      "ขั้นไดใหญ่",
      "ทุ่งแต้",
      "สิงห์",
      "นาสะไมย์",
      "เขื่องคำ",
      "หนองหิน",
      "หนองคู",
      "ขุมเงิน",
      "ทุ่งนางโอก",
      "หนองเรือ",
      "หนองเป็ด"
    ],
    "ทรายมูล": [
      "ทรายมูล",
      "ดู่ลาด",
      "ดงมะไฟ",
      "นาเวียง",
      "ไผ่"
    ],
    "กุดชุม": [
      "กุดชุม",
      "โนนเปือย",
      "กำแมด",
      "นาโส่",
      "ห้วยแก้ง",
      "หนองหมี",
      "โพนงาม",
      "คำน้ำสร้าง",
      "หนองแหน"
    ],
    "คำเขื่อนแก้ว": [
      "ลุมพุก",
      "ย่อ",
      "สงเปือย",
      "โพนทัน",
      "ทุ่งมน",
      "นาคำ",
      "ดงแคนใหญ่",
      "กู่จาน",
      "นาแก",
      "กุดกุง",
      "เหล่าไฮ",
      "แคนน้อย",
      "ดงเจริญ"
    ],
    "ป่าติ้ว": [
      "โพธิ์ไทร",
      "กระจาย",
      "โคกนาโก",
      "เชียงเพ็ง",
      "ศรีฐาน"
    ],
    "มหาชนะชัย": [
      "ฟ้าหยาด",
      "หัวเมือง",
      "คูเมือง",
      "ผือฮี",
      "บากเรือ",
      "ม่วง",
      "โนนทราย",
      "บึงแก",
      "พระเสาร์",
      "สงยาง"
    ],
    "ค้อวัง": [
      "ฟ้าห่วน",
      "กุดน้ำใส",
      "น้ำอ้อม",
      "ค้อวัง"
    ],
    "เลิงนกทา": [
      "บุ่งค้า",
      "สวาท",
      "ห้องแซง",
      "สามัคคี",
      "กุดเชียงหมี",
      "สามแยก",
      "กุดแห่",
      "โคกสำราญ",
      "สร้างมิ่ง",
      "ศรีแก้ว"
    ],
    "ไทยเจริญ": [
      "ไทยเจริญ",
      "น้ำคำ",
      "ส้มผ่อ",
      "คำเตย",
      "คำไผ่"
    ]
  },
  "ชัยภูมิ": {
    "เมืองชัยภูมิ": [
      "ในเมือง",
      "รอบเมือง",
      "โพนทอง",
      "นาฝาย",
      "บ้านค่าย",
      "กุดตุ้ม",
      "ชีลอง",
      "บ้านเล่า",
      "นาเสียว",
      "หนองนาแซง",
      "ลาดใหญ่",
      "หนองไผ่",
      "ท่าหินโงม",
      "ห้วยต้อน",
      "ห้วยบง",
      "โนนสำราญ",
      "โคกสูง",
      "บุ่งคล้า",
      "ซับสีทอง"
    ],
    "บ้านเขว้า": [
      "บ้านเขว้า",
      "ตลาดแร้ง",
      "ลุ่มลำชี",
      "ชีบน",
      "ภูแลนคา",
      "โนนแดง"
    ],
    "คอนสวรรค์": [
      "คอนสวรรค์",
      "ยางหวาย",
      "ช่องสามหมอ",
      "โนนสะอาด",
      "ห้วยไร่",
      "บ้านโสก",
      "โคกมั่งงอย",
      "หนองขาม",
      "ศรีสำราญ"
    ],
    "เกษตรสมบูรณ์": [
      "บ้านยาง",
      "บ้านหัน",
      "บ้านเดื่อ",
      "บ้านเป้า",
      "กุดเลาะ",
      "โนนกอก",
      "สระโพนทอง",
      "หนองข่า",
      "หนองโพนงาม",
      "บ้านบัว",
      "โนนทอง"
    ],
    "หนองบัวแดง": [
      "หนองบัวแดง",
      "กุดชุมแสง",
      "ถ้ำวัวแดง",
      "นางแดด",
      "หนองแวง",
      "คูเมือง",
      "ท่าใหญ่",
      "วังชมภู"
    ],
    "จัตุรัส": [
      "บ้านกอก",
      "หนองบัวบาน",
      "บ้านขาม",
      "กุดน้ำใส",
      "หนองโดน",
      "ละหาน",
      "หนองบัวใหญ่",
      "หนองบัวโคก",
      "ส้มป่อย"
    ],
    "บำเหน็จณรงค์": [
      "บ้านชวน",
      "บ้านเพชร",
      "บ้านตาล",
      "หัวทะเล",
      "โคกเริงรมย์",
      "เกาะมะนาว",
      "โคกเพชรพัฒนา"
    ],
    "หนองบัวระเหว": [
      "หนองบัวระเหว",
      "วังตะเฆ่",
      "ห้วยแย้",
      "โคกสะอาด",
      "โสกปลาดุก"
    ],
    "เทพสถิต": [
      "วะตะแบก",
      "ห้วยยายจิ๋ว",
      "นายางกลัก",
      "บ้านไร่",
      "โป่งนก"
    ],
    "ภูเขียว": [
      "ผักปัง",
      "กวางโจน",
      "หนองคอนไทย",
      "บ้านแก้ง",
      "กุดยม",
      "บ้านเพชร",
      "โคกสะอาด",
      "หนองตูม",
      "โอโล",
      "ธาตุทอง",
      "บ้านดอน"
    ],
    "บ้านแท่น": [
      "บ้านแท่น",
      "สามสวน",
      "สระพัง",
      "บ้านเต่า",
      "หนองคู"
    ],
    "แก้งคร้อ": [
      "ช่องสามหมอ",
      "หนองขาม",
      "นาหนองทุ่ม",
      "บ้านแก้ง",
      "หนองสังข์",
      "หลุบคา",
      "โคกกุง",
      "เก่าย่าดี",
      "ท่ามะไฟหวาน",
      "หนองไผ่"
    ],
    "คอนสาร": [
      "คอนสาร",
      "ทุ่งพระ",
      "โนนคูณ",
      "ห้วยยาง",
      "ทุ่งลุยลาย",
      "ดงบัง",
      "ทุ่งนาเลา",
      "ดงกลาง"
    ],
    "ภักดีชุมพล": [
      "บ้านเจียง",
      "เจาทอง",
      "วังทอง",
      "แหลมทอง"
    ],
    "เนินสง่า": [
      "หนองฉิม",
      "ตาเนิน",
      "กะฮาด",
      "รังงาม"
    ],
    "ซับใหญ่": [
      "ซับใหญ่",
      "ท่ากูบ",
      "ตะโกทอง"
    ]
  },
  "อำนาจเจริญ": {
    "เมืองอำนาจเจริญ": [
      "บุ่ง",
      "ไก่คำ",
      "นาจิก",
      "ปลาค้าว",
      "เหล่าพรวน",
      "สร้างนกทา",
      "คึมใหญ่",
      "นาผือ",
      "น้ำปลีก",
      "นาวัง",
      "นาหมอม้า",
      "โนนโพธิ์",
      "โนนหนามแท่ง",
      "ห้วยไร่",
      "หนองมะแซว",
      "กุดปลาดุก",
      "ดอนเมย",
      "นายม",
      "นาแต้"
    ],
    "ชานุมาน": [
      "ชานุมาน",
      "โคกสาร",
      "คำเขื่อนแก้ว",
      "โคกก่ง",
      "ป่าก่อ"
    ],
    "ปทุมราชวงศา": [
      "หนองข่า",
      "คำโพน",
      "นาหว้า",
      "ลือ",
      "ห้วย",
      "โนนงาม",
      "นาป่าแซง"
    ],
    "พนา": [
      "พนา",
      "จานลาน",
      "ไม้กลอน",
      "พระเหลา"
    ],
    "เสนางคนิคม": [
      "เสนางคนิคม",
      "โพนทอง",
      "ไร่สีสุก",
      "นาเวียง",
      "หนองไฮ",
      "หนองสามสี"
    ],
    "หัวตะพาน": [
      "หัวตะพาน",
      "คำพระ",
      "เค็งใหญ่",
      "หนองแก้ว",
      "โพนเมืองน้อย",
      "สร้างถ่อน้อย",
      "จิกดู่",
      "รัตนวารี"
    ],
    "ลืออำนาจ": [
      "อำนาจ",
      "ดงมะยาง",
      "เปือย",
      "ดงบัง",
      "ไร่ขี",
      "แมด",
      "โคกกลาง"
    ]
  },
  "หนองบัวลำภู": {
    "เมืองหนองบัวลำภู": [
      "หนองบัว",
      "หนองภัยศูนย์",
      "โพธิ์ชัย",
      "หนองสวรรค์",
      "หัวนา",
      "บ้านขาม",
      "นามะเฟือง",
      "บ้านพร้าว",
      "โนนขมิ้น",
      "ลำภู",
      "กุดจิก",
      "โนนทัน",
      "นาคำไฮ",
      "ป่าไม้งาม",
      "หนองหว้า"
    ],
    "นากลาง": [
      "นากลาง",
      "ด่านช้าง",
      "กุดดินจี่",
      "ฝั่งแดง",
      "เก่ากลอย",
      "โนนเมือง",
      "อุทัยสวรรค์",
      "ดงสวรรค์",
      "กุดแห่"
    ],
    "โนนสัง": [
      "โนนสัง",
      "บ้านถิ่น",
      "หนองเรือ",
      "กุดดู่",
      "บ้านค้อ",
      "โนนเมือง",
      "โคกใหญ่",
      "โคกม่วง",
      "นิคมพัฒนา",
      "ปางกู่"
    ],
    "ศรีบุญเรือง": [
      "เมืองใหม่",
      "ศรีบุญเรือง",
      "หนองบัวใต้",
      "กุดสะเทียน",
      "นากอก",
      "โนนสะอาด",
      "ยางหล่อ",
      "โนนม่วง",
      "หนองกุงแก้ว",
      "หนองแก",
      "ทรายทอง",
      "หันนางาม"
    ],
    "สุวรรณคูหา": [
      "นาสี",
      "บ้านโคก",
      "นาดี",
      "นาด่าน",
      "ดงมะไฟ",
      "สุวรรณคูหา",
      "บุญทัน",
      "กุดผึ้ง"
    ],
    "นาวัง": [
      "นาเหล่า",
      "นาแก",
      "วังทอง",
      "วังปลาป้อม",
      "เทพคีรี"
    ]
  },
  "ขอนแก่น": {
    "เมืองขอนแก่น": [
      "ในเมือง",
      "สำราญ",
      "โคกสี",
      "ท่าพระ",
      "บ้านทุ่ม",
      "เมืองเก่า",
      "พระลับ",
      "สาวะถี",
      "บ้านหว้า",
      "บ้านค้อ",
      "แดงใหญ่",
      "ดอนช้าง",
      "ดอนหัน",
      "ศิลา",
      "บ้านเป็ด",
      "หนองตูม",
      "บึงเนียม",
      "โนนท่อน"
    ],
    "บ้านฝาง": [
      "หนองบัว",
      "ป่าหวายนั่ง",
      "โนนฆ้อง",
      "บ้านเหล่า",
      "ป่ามะนาว",
      "บ้านฝาง",
      "โคกงาม"
    ],
    "พระยืน": [
      "พระยืน",
      "พระบุ",
      "บ้านโต้น",
      "หนองแวง",
      "ขามป้อม"
    ],
    "หนองเรือ": [
      "หนองเรือ",
      "บ้านเม็ง",
      "บ้านกง",
      "ยางคำ",
      "จระเข้",
      "โนนทอง",
      "กุดกว้าง",
      "โนนทัน",
      "โนนสะอาด",
      "บ้านผือ"
    ],
    "ชุมแพ": [
      "ชุมแพ",
      "โนนหัน",
      "นาหนองทุ่ม",
      "โนนอุดม",
      "ขัวเรียง",
      "หนองไผ่",
      "ไชยสอ",
      "วังหินลาด",
      "นาเพียง",
      "หนองเขียด",
      "หนองเสาเล้า",
      "โนนสะอาด"
    ],
    "สีชมพู": [
      "สีชมพู",
      "ศรีสุข",
      "นาจาน",
      "วังเพิ่ม",
      "ซำยาง",
      "หนองแดง",
      "ดงลาน",
      "บริบูรณ์",
      "บ้านใหม่",
      "ภูห่าน"
    ],
    "น้ำพอง": [
      "น้ำพอง",
      "วังชัย",
      "หนองกุง",
      "บัวใหญ่",
      "สะอาด",
      "ม่วงหวาน",
      "บ้านขาม",
      "บัวเงิน",
      "ทรายมูล",
      "ท่ากระเสริม",
      "พังทุย",
      "กุดน้ำใส"
    ],
    "อุบลรัตน์": [
      "โคกสูง",
      "บ้านดง",
      "เขื่อนอุบลรัตน์",
      "นาคำ",
      "ศรีสุขสำราญ",
      "ทุ่งโป่ง"
    ],
    "กระนวน": [
      "หนองโก",
      "หนองกุงใหญ่",
      "ห้วยโจด",
      "ห้วยยาง",
      "บ้านฝาง",
      "ดูนสาด",
      "หนองโน",
      "น้ำอ้อม",
      "หัวนาคำ"
    ],
    "บ้านไผ่": [
      "บ้านไผ่",
      "ในเมือง",
      "เมืองเพีย",
      "บ้านลาน",
      "แคนเหนือ",
      "ภูเหล็ก",
      "ป่าปอ",
      "หินตั้ง",
      "หนองน้ำใส",
      "หัวหนอง"
    ],
    "เปือยน้อย": [
      "เปือยน้อย",
      "วังม่วง",
      "ขามป้อม",
      "สระแก้ว"
    ],
    "พล": [
      "เมืองพล",
      "โจดหนองแก",
      "เก่างิ้ว",
      "หนองมะเขือ",
      "หนองแวงโสกพระ",
      "เพ็กใหญ่",
      "โคกสง่า",
      "หนองแวงนางเบ้า",
      "ลอมคอม",
      "โนนข่า",
      "โสกนกเต็น",
      "หัวทุ่ง"
    ],
    "แวงใหญ่": [
      "คอนฉิม",
      "ใหม่นาเพียง",
      "โนนทอง",
      "แวงใหญ่",
      "โนนสะอาด"
    ],
    "แวงน้อย": [
      "แวงน้อย",
      "ก้านเหลือง",
      "ท่านางแนว",
      "ละหานนา",
      "ท่าวัด",
      "ทางขวาง"
    ],
    "หนองสองห้อง": [
      "หนองสองห้อง",
      "คึมชาด",
      "โนนธาตุ",
      "ตะกั่วป่า",
      "สำโรง",
      "หนองเม็ก",
      "ดอนดู่",
      "ดงเค็ง",
      "หันโจด",
      "ดอนดั่ง",
      "วังหิน",
      "หนองไผ่ล้อม"
    ],
    "ภูเวียง": [
      "บ้านเรือ",
      "หว้าทอง",
      "กุดขอนแก่น",
      "นาชุมแสง",
      "นาหว้า",
      "หนองกุงธนสาร",
      "หนองกุงเซิน",
      "สงเปือย",
      "ทุ่งชมพู",
      "ดินดำ",
      "ภูเวียง"
    ],
    "มัญจาคีรี": [
      "กุดเค้า",
      "สวนหม่อน",
      "หนองแปน",
      "โพนเพ็ก",
      "คำแคน",
      "นาข่า",
      "นางาม",
      "ท่าศาลา"
    ],
    "ชนบท": [
      "ชนบท",
      "กุดเพียขอม",
      "วังแสง",
      "ห้วยแก",
      "บ้านแท่น",
      "ศรีบุญเรือง",
      "โนนพะยอม",
      "ปอแดง"
    ],
    "เขาสวนกวาง": [
      "เขาสวนกวาง",
      "ดงเมืองแอม",
      "นางิ้ว",
      "โนนสมบูรณ์",
      "คำม่วง"
    ],
    "ภูผาม่าน": [
      "โนนคอม",
      "นาฝาย",
      "ภูผาม่าน",
      "วังสวาบ",
      "ห้วยม่วง"
    ],
    "ซำสูง": [
      "กระนวน",
      "คำแมด",
      "บ้านโนน",
      "คูคำ",
      "ห้วยเตย"
    ],
    "โคกโพธิ์ไชย": [
      "บ้านโคก",
      "โพธิ์ไชย",
      "ซับสมบูรณ์",
      "นาแพง"
    ],
    "หนองนาคำ": [
      "กุดธาตุ",
      "บ้านโคก",
      "ขนวน"
    ],
    "บ้านแฮด": [
      "บ้านแฮด",
      "โคกสำราญ",
      "โนนสมบูรณ์",
      "หนองแซง"
    ],
    "โนนศิลา": [
      "โนนศิลา",
      "หนองปลาหมอ",
      "บ้านหัน",
      "เปือยใหญ่",
      "โนนแดง"
    ],
    "เวียงเก่า": [
      "ในเมือง",
      "เมืองเก่าพัฒนา",
      "เขาน้อย"
    ]
  },
  "อุดรธานี": {
    "เมืองอุดรธานี": [
      "หมากแข้ง",
      "นิคมสงเคราะห์",
      "บ้านขาว",
      "หนองบัว",
      "บ้านตาด",
      "โนนสูง",
      "หมูม่น",
      "เชียงยืน",
      "หนองนาคำ",
      "กุดสระ",
      "นาดี",
      "บ้านเลื่อม",
      "เชียงพิณ",
      "สามพร้าว",
      "หนองไฮ",
      "นาข่า",
      "บ้านจั่น",
      "หนองขอนกว้าง",
      "โคกสะอาด",
      "นากว้าง",
      "หนองไผ่"
    ],
    "กุดจับ": [
      "กุดจับ",
      "ปะโค",
      "ขอนยูง",
      "เชียงเพ็ง",
      "สร้างก่อ",
      "เมืองเพีย",
      "ตาลเลียน"
    ],
    "หนองวัวซอ": [
      "หมากหญ้า",
      "หนองอ้อ",
      "อูบมุง",
      "กุดหมากไฟ",
      "น้ำพ่น",
      "หนองบัวบาน",
      "โนนหวาย",
      "หนองวัวซอ"
    ],
    "กุมภวาปี": [
      "ตูมใต้",
      "พันดอน",
      "เวียงคำ",
      "แชแล",
      "เชียงแหว",
      "ห้วยเกิ้ง",
      "เสอเพลอ",
      "สีออ",
      "ปะโค",
      "ผาสุก",
      "ท่าลี่",
      "กุมภวาปี",
      "หนองหว้า"
    ],
    "โนนสะอาด": [
      "โนนสะอาด",
      "บุ่งแก้ว",
      "โพธิ์ศรีสำราญ",
      "ทมนางาม",
      "หนองกุงศรี",
      "โคกกลาง"
    ],
    "หนองหาน": [
      "หนองหาน",
      "หนองเม็ก",
      "พังงู",
      "สะแบง",
      "สร้อยพร้าว",
      "บ้านเชียง",
      "บ้านยา",
      "โพนงาม",
      "ผักตบ",
      "หนองไผ่",
      "ดอนหายโศก",
      "หนองสระปลา"
    ],
    "ทุ่งฝน": [
      "ทุ่งฝน",
      "ทุ่งใหญ่",
      "นาชุมแสง",
      "นาทม"
    ],
    "ไชยวาน": [
      "ไชยวาน",
      "หนองหลัก",
      "คำเลาะ",
      "โพนสูง"
    ],
    "ศรีธาตุ": [
      "ศรีธาตุ",
      "จำปี",
      "บ้านโปร่ง",
      "หัวนาคำ",
      "หนองนกเขียน",
      "นายูง",
      "ตาดทอง"
    ],
    "วังสามหมอ": [
      "หนองกุงทับม้า",
      "หนองหญ้าไซ",
      "บะยาว",
      "ผาสุก",
      "คำโคกสูง",
      "วังสามหมอ"
    ],
    "บ้านดุง": [
      "ศรีสุทโธ",
      "บ้านดุง",
      "ดงเย็น",
      "โพนสูง",
      "อ้อมกอ",
      "บ้านจันทน์",
      "บ้านชัย",
      "นาไหม",
      "ถ่อนนาลับ",
      "วังทอง",
      "บ้านม่วง",
      "บ้านตาด",
      "นาคำ"
    ],
    "บ้านผือ": [
      "บ้านผือ",
      "หายโศก",
      "เขือน้ำ",
      "คำบง",
      "โนนทอง",
      "ข้าวสาร",
      "จำปาโมง",
      "กลางใหญ่",
      "เมืองพาน",
      "คำด้วง",
      "หนองหัวคู",
      "บ้านค้อ",
      "หนองแวง"
    ],
    "น้ำโสม": [
      "นางัว",
      "น้ำโสม",
      "หนองแวง",
      "บ้านหยวก",
      "โสมเยี่ยม",
      "ศรีสำราญ",
      "สามัคคี"
    ],
    "เพ็ญ": [
      "เพ็ญ",
      "บ้านธาตุ",
      "นาพู่",
      "เชียงหวาง",
      "สุมเส้า",
      "นาบัว",
      "บ้านเหล่า",
      "จอมศรี",
      "เตาไห",
      "โคกกลาง",
      "สร้างแป้น"
    ],
    "สร้างคอม": [
      "สร้างคอม",
      "เชียงดา",
      "บ้านยวด",
      "บ้านโคก",
      "นาสะอาด",
      "บ้านหินโงม"
    ],
    "หนองแสง": [
      "หนองแสง",
      "แสงสว่าง",
      "นาดี",
      "ทับกุง"
    ],
    "นายูง": [
      "นายูง",
      "บ้านก้อง",
      "นาแค",
      "โนนทอง"
    ],
    "พิบูลย์รักษ์": [
      "บ้านแดง",
      "นาทราย",
      "ดอนกลอย"
    ],
    "กู่แก้ว": [
      "บ้านจีต",
      "โนนทองอินทร์",
      "ค้อใหญ่",
      "คอนสาย"
    ],
    "ประจักษ์ศิลปาคม": [
      "นาม่วง",
      "ห้วยสามพาด",
      "อุ่มจาน"
    ]
  },
  "เลย": {
    "เมืองเลย": [
      "กุดป่อง",
      "เมือง",
      "นาอ้อ",
      "กกดู่",
      "น้ำหมาน",
      "เสี้ยว",
      "นาอาน",
      "นาโป่ง",
      "นาดินดำ",
      "น้ำสวย",
      "ชัยพฤกษ์",
      "นาแขม",
      "ศรีสองรัก",
      "กกทอง"
    ],
    "นาด้วง": [
      "นาด้วง",
      "นาดอกคำ",
      "ท่าสะอาด",
      "ท่าสวรรค์"
    ],
    "เชียงคาน": [
      "เชียงคาน",
      "ธาตุ",
      "นาซ่าว",
      "เขาแก้ว",
      "ปากตม",
      "บุฮม",
      "จอมศรี",
      "หาดทรายขาว"
    ],
    "ปากชม": [
      "ปากชม",
      "เชียงกลม",
      "หาดคัมภีร์",
      "ห้วยบ่อซืน",
      "ห้วยพิชัย",
      "ชมเจริญ"
    ],
    "ด่านซ้าย": [
      "ด่านซ้าย",
      "ปากหมัน",
      "นาดี",
      "โคกงาม",
      "โพนสูง",
      "อิปุ่ม",
      "กกสะทอน",
      "โป่ง",
      "วังยาว",
      "นาหอ"
    ],
    "นาแห้ว": [
      "นาแห้ว",
      "แสงภา",
      "นาพึง",
      "นามาลา",
      "เหล่ากอหก"
    ],
    "ภูเรือ": [
      "หนองบัว",
      "ท่าศาลา",
      "ร่องจิก",
      "ปลาบ่า",
      "ลาดค่าง",
      "สานตม"
    ],
    "ท่าลี่": [
      "ท่าลี่",
      "หนองผือ",
      "อาฮี",
      "น้ำแคม",
      "โคกใหญ่",
      "น้ำทูน"
    ],
    "วังสะพุง": [
      "วังสะพุง",
      "ทรายขาว",
      "หนองหญ้าปล้อง",
      "หนองงิ้ว",
      "ปากปวน",
      "ผาน้อย",
      "ผาบิ้ง",
      "เขาหลวง",
      "โคกขมิ้น",
      "ศรีสงคราม"
    ],
    "ภูกระดึง": [
      "ศรีฐาน",
      "ผานกเค้า",
      "ภูกระดึง",
      "ห้วยส้ม"
    ],
    "ภูหลวง": [
      "ภูหอ",
      "หนองคัน",
      "ห้วยสีเสียด",
      "เลยวังไสย์",
      "แก่งศรีภูมิ"
    ],
    "ผาขาว": [
      "ผาขาว",
      "ท่าช้างคล้อง",
      "โนนปอแดง",
      "โนนป่าซาง",
      "บ้านเพิ่ม"
    ],
    "เอราวัณ": [
      "เอราวัณ",
      "ผาอินทร์แปลง",
      "ผาสามยอด",
      "ทรัพย์ไพวัลย์"
    ],
    "หนองหิน": [
      "หนองหิน",
      "ตาดข่า",
      "ปวนพุ"
    ]
  },
  "หนองคาย": {
    "เมืองหนองคาย": [
      "ในเมือง",
      "มีชัย",
      "โพธิ์ชัย",
      "กวนวัน",
      "เวียงคุก",
      "วัดธาตุ",
      "หาดคำ",
      "หินโงม",
      "บ้านเดื่อ",
      "ค่ายบกหวาน",
      "โพนสว่าง",
      "พระธาตุบังพวน",
      "หนองกอมเกาะ",
      "ปะโค",
      "เมืองหมี",
      "สีกาย"
    ],
    "ท่าบ่อ": [
      "ท่าบ่อ",
      "น้ำโมง",
      "กองนาง",
      "โคกคอน",
      "บ้านเดื่อ",
      "บ้านถ่อน",
      "บ้านว่าน",
      "นาข่า",
      "โพนสา",
      "หนองนาง"
    ],
    "โพนพิสัย": [
      "จุมพล",
      "วัดหลวง",
      "กุดบง",
      "ชุมช้าง",
      "ทุ่งหลวง",
      "เหล่าต่างคำ",
      "นาหนัง",
      "เซิม",
      "บ้านโพธิ์",
      "บ้านผือ",
      "สร้างนางขาว"
    ],
    "ศรีเชียงใหม่": [
      "พานพร้าว",
      "บ้านหม้อ",
      "พระพุทธบาท",
      "หนองปลาปาก"
    ],
    "สังคม": [
      "แก้งไก่",
      "ผาตั้ง",
      "บ้านม่วง",
      "นางิ้ว",
      "สังคม"
    ],
    "สระใคร": [
      "สระใคร",
      "คอกช้าง",
      "บ้านฝาง"
    ],
    "เฝ้าไร่": [
      "เฝ้าไร่",
      "นาดี",
      "หนองหลวง",
      "วังหลวง",
      "อุดมพร"
    ],
    "รัตนวาปี": [
      "รัตนวาปี",
      "นาทับไฮ",
      "บ้านต้อน",
      "พระบาทนาสิงห์",
      "โพนแพง"
    ],
    "โพธิ์ตาก": [
      "โพธิ์ตาก",
      "โพนทอง",
      "ด่านศรีสุข"
    ]
  },
  "มหาสารคาม": {
    "เมืองมหาสารคาม": [
      "ตลาด",
      "เขวา",
      "ท่าตูม",
      "แวงน่าง",
      "โคกก่อ",
      "ดอนหว่าน",
      "เกิ้ง",
      "แก่งเลิงจาน",
      "ท่าสองคอน",
      "ลาดพัฒนา",
      "หนองปลิง",
      "ห้วยแอ่ง",
      "หนองโน",
      "บัวค้อ"
    ],
    "แกดำ": [
      "แกดำ",
      "วังแสง",
      "มิตรภาพ",
      "หนองกุง",
      "โนนภิบาล"
    ],
    "โกสุมพิสัย": [
      "หัวขวาง",
      "ยางน้อย",
      "วังยาว",
      "เขวาไร่",
      "แพง",
      "แก้งแก",
      "หนองเหล็ก",
      "หนองบัว",
      "เหล่า",
      "เขื่อน",
      "หนองบอน",
      "โพนงาม",
      "ยางท่าแจ้ง",
      "แห่ใต้",
      "หนองกุงสวรรค์",
      "เลิงใต้",
      "ดอนกลาง"
    ],
    "กันทรวิชัย": [
      "โคกพระ",
      "คันธารราษฎร์",
      "มะค่า",
      "ท่าขอนยาง",
      "นาสีนวน",
      "ขามเรียง",
      "เขวาใหญ่",
      "ศรีสุข",
      "กุดใส้จ่อ",
      "ขามเฒ่าพัฒนา"
    ],
    "เชียงยืน": [
      "เชียงยืน",
      "หนองซอน",
      "ดอนเงิน",
      "กู่ทอง",
      "นาทอง",
      "เสือเฒ่า",
      "โพนทอง",
      "เหล่าบัวบาน"
    ],
    "บรบือ": [
      "บรบือ",
      "บ่อใหญ่",
      "วังไชย",
      "หนองม่วง",
      "กำพี้",
      "โนนราษี",
      "โนนแดง",
      "หนองจิก",
      "บัวมาศ",
      "หนองคูขาด",
      "วังใหม่",
      "ยาง",
      "หนองสิม",
      "หนองโก",
      "ดอนงัว"
    ],
    "นาเชือก": [
      "นาเชือก",
      "สำโรง",
      "หนองแดง",
      "เขวาไร่",
      "หนองโพธิ์",
      "ปอพาน",
      "หนองเม็ก",
      "หนองเรือ",
      "หนองกุง",
      "สันป่าตอง"
    ],
    "พยัคฆภูมิพิสัย": [
      "ปะหลาน",
      "ก้ามปู",
      "เวียงสะอาด",
      "เม็กดำ",
      "นาสีนวล",
      "ราษฎร์เจริญ",
      "หนองบัวแก้ว",
      "เมืองเตา",
      "ลานสะแก",
      "เวียงชัย",
      "หนองบัว",
      "ราษฎร์พัฒนา",
      "เมืองเสือ",
      "ภารแอ่น"
    ],
    "วาปีปทุม": [
      "หนองแสง",
      "ขามป้อม",
      "เสือโก้ก",
      "ดงใหญ่",
      "โพธิ์ชัย",
      "หัวเรือ",
      "แคน",
      "งัวบา",
      "นาข่า",
      "บ้านหวาย",
      "หนองไฮ",
      "ประชาพัฒนา",
      "หนองทุ่ม",
      "หนองแสน",
      "โคกสีทองหลาง"
    ],
    "นาดูน": [
      "นาดูน",
      "หนองไผ่",
      "หนองคู",
      "ดงบัง",
      "ดงดวน",
      "หัวดง",
      "ดงยาง",
      "กู่สันตรัตน์",
      "พระธาตุ"
    ],
    "ยางสีสุราช": [
      "ยางสีสุราช",
      "นาภู",
      "แวงดง",
      "บ้านกู่",
      "ดงเมือง",
      "สร้างแซ่ง",
      "หนองบัวสันตุ"
    ],
    "กุดรัง": [
      "กุดรัง",
      "นาโพธิ์",
      "เลิงแฝก",
      "หนองแวง",
      "ห้วยเตย"
    ],
    "ชื่นชม": [
      "ชื่นชม",
      "กุดปลาดุก",
      "เหล่าดอกไม้",
      "หนองกุง"
    ]
  },
  "ร้อยเอ็ด": {
    "เมืองร้อยเอ็ด": [
      "ในเมือง",
      "รอบเมือง",
      "เหนือเมือง",
      "ขอนแก่น",
      "นาโพธิ์",
      "สะอาดสมบูรณ์",
      "สีแก้ว",
      "ปอภาร",
      "โนนรัง",
      "หนองแก้ว",
      "หนองแวง",
      "ดงลาน",
      "แคนใหญ่",
      "โนนตาล",
      "เมืองทอง"
    ],
    "เกษตรวิสัย": [
      "เกษตรวิสัย",
      "เมืองบัว",
      "เหล่าหลวง",
      "สิงห์โคก",
      "ดงครั่งใหญ่",
      "บ้านฝาง",
      "หนองแวง",
      "กำแพง",
      "กู่กาสิงห์",
      "น้ำอ้อม",
      "โนนสว่าง",
      "ทุ่งทอง",
      "ดงครั่งน้อย"
    ],
    "ปทุมรัตต์": [
      "บัวแดง",
      "ดอกล้ำ",
      "หนองแคน",
      "โพนสูง",
      "โนนสวรรค์",
      "สระบัว",
      "โนนสง่า",
      "ขี้เหล็ก"
    ],
    "จตุรพักตรพิมาน": [
      "หัวช้าง",
      "หนองผือ",
      "เมืองหงส์",
      "โคกล่าม",
      "น้ำใส",
      "ดงแดง",
      "ดงกลาง",
      "ป่าสังข์",
      "อีง่อง",
      "ลิ้นฟ้า",
      "ดู่น้อย",
      "ศรีโคตร"
    ],
    "ธวัชบุรี": [
      "นิเวศน์",
      "ธงธานี",
      "หนองไผ่",
      "ธวัชบุรี",
      "อุ่มเม้า",
      "มะอึ",
      "เขวาทุ่ง",
      "ไพศาล",
      "เมืองน้อย",
      "บึงนคร",
      "ราชธานี",
      "หนองพอก"
    ],
    "พนมไพร": [
      "พนมไพร",
      "แสนสุข",
      "กุดน้ำใส",
      "หนองทัพไทย",
      "โพธิ์ใหญ่",
      "วารีสวัสดิ์",
      "โคกสว่าง",
      "โพธิ์ชัย",
      "นานวล",
      "คำไฮ",
      "สระแก้ว",
      "ค้อใหญ่",
      "ชานุวรรณ"
    ],
    "โพนทอง": [
      "แวง",
      "โคกกกม่วง",
      "นาอุดม",
      "สว่าง",
      "หนองใหญ่",
      "โพธิ์ทอง",
      "โนนชัยศรี",
      "โพธิ์ศรีสว่าง",
      "อุ่มเม่า",
      "คำนาดี",
      "พรมสวรรค์",
      "สระนกแก้ว",
      "วังสามัคคี",
      "โคกสูง"
    ],
    "โพธิ์ชัย": [
      "ขามเปี้ย",
      "เชียงใหม่",
      "บัวคำ",
      "อัคคะคำ",
      "สะอาด",
      "คำพอุง",
      "หนองตาไก้",
      "ดอนโอง",
      "โพธิ์ศรี"
    ],
    "หนองพอก": [
      "หนองพอก",
      "บึงงาม",
      "ภูเขาทอง",
      "กกโพธิ์",
      "โคกสว่าง",
      "หนองขุ่นใหญ่",
      "รอบเมือง",
      "ผาน้ำย้อย",
      "ท่าสีดา"
    ],
    "เสลภูมิ": [
      "กลาง",
      "นางาม",
      "เมืองไพร",
      "นาแซง",
      "นาเมือง",
      "วังหลวง",
      "ท่าม่วง",
      "ขวาว",
      "โพธิ์ทอง",
      "ภูเงิน",
      "เกาะแก้ว",
      "นาเลิง",
      "เหล่าน้อย",
      "ศรีวิลัย",
      "หนองหลวง",
      "พรสวรรค์",
      "ขวัญเมือง",
      "บึงเกลือ"
    ],
    "สุวรรณภูมิ": [
      "สระคู",
      "ดอกไม้",
      "นาใหญ่",
      "หินกอง",
      "เมืองทุ่ง",
      "หัวโทน",
      "บ่อพันขัน",
      "ทุ่งหลวง",
      "หัวช้าง",
      "น้ำคำ",
      "ห้วยหินลาด",
      "ช้างเผือก",
      "ทุ่งกุลา",
      "ทุ่งศรีเมือง",
      "จำปาขัน"
    ],
    "เมืองสรวง": [
      "หนองผือ",
      "หนองหิน",
      "คูเมือง",
      "กกกุง",
      "เมืองสรวง"
    ],
    "โพนทราย": [
      "โพนทราย",
      "สามขา",
      "ศรีสว่าง",
      "ยางคำ",
      "ท่าหาดยาว"
    ],
    "อาจสามารถ": [
      "อาจสามารถ",
      "โพนเมือง",
      "บ้านแจ้ง",
      "หน่อม",
      "หนองหมื่นถ่าน",
      "หนองขาม",
      "โหรา",
      "หนองบัว",
      "ขี้เหล็ก",
      "บ้านดู่"
    ],
    "เมยวดี": [
      "เมยวดี",
      "ชุมพร",
      "บุ่งเลิศ",
      "ชมสะอาด"
    ],
    "ศรีสมเด็จ": [
      "โพธิ์ทอง",
      "ศรีสมเด็จ",
      "เมืองเปลือย",
      "หนองใหญ่",
      "สวนจิก",
      "โพธิ์สัย",
      "หนองแวงควง",
      "บ้านบาก"
    ],
    "จังหาร": [
      "ดินดำ",
      "ปาฝา",
      "ม่วงลาด",
      "จังหาร",
      "ดงสิงห์",
      "ยางใหญ่",
      "ผักแว่น",
      "แสนชาติ"
    ],
    "เชียงขวัญ": [
      "เชียงขวัญ",
      "พลับพลา",
      "พระธาตุ",
      "พระเจ้า",
      "หมูม้น",
      "บ้านเขือง"
    ],
    "หนองฮี": [
      "หนองฮี",
      "สาวแห",
      "ดูกอึ่ง",
      "เด่นราษฎร์"
    ],
    "ทุ่งเขาหลวง": [
      "ทุ่งเขาหลวง",
      "เทอดไทย",
      "บึงงาม",
      "มะบ้า",
      "เหล่า"
    ]
  },
  "กาฬสินธุ์": {
    "เมืองกาฬสินธุ์": [
      "กาฬสินธุ์",
      "เหนือ",
      "หลุบ",
      "ไผ่",
      "ลำปาว",
      "ลำพาน",
      "เชียงเครือ",
      "บึงวิชัย",
      "ห้วยโพธิ์",
      "ภูปอ",
      "ภูดิน",
      "หนองกุง",
      "กลางหมื่น",
      "ขมิ้น",
      "โพนทอง",
      "นาจารย์",
      "ลำคลอง"
    ],
    "นามน": [
      "นามน",
      "ยอดแกง",
      "สงเปลือย",
      "หลักเหลี่ยม",
      "หนองบัว"
    ],
    "กมลาไสย": [
      "กมลาไสย",
      "หลักเมือง",
      "โพนงาม",
      "ดงลิง",
      "ธัญญา",
      "หนองแปน",
      "เจ้าท่า",
      "โคกสมบูรณ์"
    ],
    "ร่องคำ": [
      "ร่องคำ",
      "สามัคคี",
      "เหล่าอ้อย"
    ],
    "กุฉินารายณ์": [
      "บัวขาว",
      "แจนแลน",
      "เหล่าใหญ่",
      "จุมจัง",
      "เหล่าไฮงาม",
      "กุดหว้า",
      "สามขา",
      "นาขาม",
      "หนองห้าง",
      "นาโก",
      "สมสะอาด",
      "กุดค้าว"
    ],
    "เขาวง": [
      "คุ้มเก่า",
      "สงเปลือย",
      "หนองผือ",
      "กุดสิมคุ้มใหม่",
      "สระพังทอง",
      "กุดปลาค้าว"
    ],
    "ยางตลาด": [
      "ยางตลาด",
      "หัวงัว",
      "อุ่มเม่า",
      "บัวบาน",
      "เว่อ",
      "อิตื้อ",
      "หัวนาคำ",
      "หนองอิเฒ่า",
      "ดอนสมบูรณ์",
      "นาเชือก",
      "คลองขาม",
      "เขาพระนอน",
      "นาดี",
      "โนนสูง",
      "หนองตอกแป้น"
    ],
    "ห้วยเม็ก": [
      "ห้วยเม็ก",
      "คำใหญ่",
      "กุดโดน",
      "บึงนาเรียง",
      "หัวหิน",
      "พิมูล",
      "คำเหมือดแก้ว",
      "โนนสะอาด",
      "ทรายทอง"
    ],
    "สหัสขันธ์": [
      "ภูสิงห์",
      "สหัสขันธ์",
      "นามะเขือ",
      "โนนศิลา",
      "นิคม",
      "โนนแหลมทอง",
      "โนนบุรี",
      "โนนน้ำเกลี้ยง"
    ],
    "คำม่วง": [
      "ทุ่งคลอง",
      "โพน",
      "ดินจี่",
      "นาบอน",
      "นาทัน",
      "เนินยาง"
    ],
    "ท่าคันโท": [
      "ท่าคันโท",
      "กุงเก่า",
      "ยางอู้ม",
      "กุดจิก",
      "นาตาล",
      "ดงสมบูรณ์"
    ],
    "หนองกุงศรี": [
      "หนองกุงศรี",
      "หนองบัว",
      "โคกเครือ",
      "หนองสรวง",
      "เสาเล้า",
      "หนองใหญ่",
      "ดงมูล",
      "ลำหนองแสน",
      "หนองหิน"
    ],
    "สมเด็จ": [
      "สมเด็จ",
      "หนองแวง",
      "แซงบาดาล",
      "มหาไชย",
      "หมูม่น",
      "ผาเสวย",
      "ศรีสมเด็จ",
      "ลำห้วยหลัว"
    ],
    "ห้วยผึ้ง": [
      "คำบง",
      "ไค้นุ่น",
      "นิคมห้วยผึ้ง",
      "หนองอีบุตร"
    ],
    "สามชัย": [
      "สำราญ",
      "สำราญใต้",
      "คำสร้างเที่ยง",
      "หนองช้าง"
    ],
    "นาคู": [
      "นาคู",
      "สายนาวัง",
      "โนนนาจาน",
      "บ่อแก้ว",
      "ภูแล่นช้าง"
    ],
    "ดอนจาน": [
      "ดอนจาน",
      "สะอาดไชยศรี",
      "ดงพยุง",
      "ม่วงนา",
      "นาจำปา"
    ],
    "ฆ้องชัย": [
      "ฆ้องชัยพัฒนา",
      "เหล่ากลาง",
      "โคกสะอาด",
      "โนนศิลาเลิง",
      "ลำชี"
    ]
  },
  "สกลนคร": {
    "เมืองสกลนคร": [
      "ธาตุเชิงชุม",
      "ขมิ้น",
      "งิ้วด่อน",
      "โนนหอม",
      "เชียงเครือ",
      "ท่าแร่",
      "ม่วงลาย",
      "ดงชน",
      "ห้วยยาง",
      "พังขว้าง",
      "ดงมะไฟ",
      "ธาตุนาเวง",
      "เหล่าปอแดง",
      "หนองลาด",
      "ฮางโฮง",
      "โคกก่อง"
    ],
    "กุสุมาลย์": [
      "กุสุมาลย์",
      "นาโพธิ์",
      "นาเพียง",
      "โพธิไพศาล",
      "อุ่มจาน"
    ],
    "กุดบาก": [
      "กุดบาก",
      "นาม่อง",
      "กุดไห"
    ],
    "พรรณานิคม": [
      "พรรณา",
      "วังยาง",
      "พอกน้อย",
      "นาหัวบ่อ",
      "ไร่",
      "ช้างมิ่ง",
      "นาใน",
      "สว่าง",
      "บะฮี",
      "เชิงชุม"
    ],
    "พังโคน": [
      "พังโคน",
      "ม่วงไข่",
      "แร่",
      "ไฮหย่อง",
      "ต้นผึ้ง"
    ],
    "วาริชภูมิ": [
      "วาริชภูมิ",
      "ปลาโหล",
      "หนองลาด",
      "คำบ่อ",
      "ค้อเขียว"
    ],
    "นิคมน้ำอูน": [
      "นิคมน้ำอูน",
      "หนองปลิง",
      "หนองบัว",
      "สุวรรณคาม"
    ],
    "วานรนิวาส": [
      "วานรนิวาส",
      "เดื่อศรีคันไชย",
      "ขัวก่าย",
      "หนองสนม",
      "คูสะคาม",
      "ธาตุ",
      "หนองแวง",
      "ศรีวิชัย",
      "นาซอ",
      "อินทร์แปลง",
      "นาคำ",
      "คอนสวรรค์",
      "กุดเรือคำ",
      "หนองแวงใต้"
    ],
    "คำตากล้า": [
      "คำตากล้า",
      "หนองบัวสิม",
      "นาแต้",
      "แพด"
    ],
    "บ้านม่วง": [
      "ม่วง",
      "มาย",
      "ดงหม้อทอง",
      "ดงเหนือ",
      "ดงหม้อทองใต้",
      "ห้วยหลัว",
      "โนนสะอาด",
      "หนองกวั่ง",
      "บ่อแก้ว"
    ],
    "อากาศอำนวย": [
      "อากาศ",
      "โพนแพง",
      "วาใหญ่",
      "โพนงาม",
      "ท่าก้อน",
      "นาฮี",
      "บะหว้า",
      "สามัคคีพัฒนา"
    ],
    "สว่างแดนดิน": [
      "สว่างแดนดิน",
      "คำสะอาด",
      "บ้านต้าย",
      "บงเหนือ",
      "โพนสูง",
      "โคกสี",
      "หนองหลวง",
      "บงใต้",
      "ค้อใต้",
      "พันนา",
      "แวง",
      "ทรายมูล",
      "ตาลโกน",
      "ตาลเนิ้ง",
      "ธาตุทอง",
      "บ้านถ่อน"
    ],
    "ส่องดาว": [
      "ส่องดาว",
      "ท่าศิลา",
      "วัฒนา",
      "ปทุมวาปี"
    ],
    "เต่างอย": [
      "เต่างอย",
      "บึงทวาย",
      "นาตาล",
      "จันทร์เพ็ญ"
    ],
    "โคกศรีสุพรรณ": [
      "ตองโขบ",
      "เหล่าโพนค้อ",
      "ด่านม่วงคำ",
      "แมดนาท่ม"
    ],
    "เจริญศิลป์": [
      "บ้านเหล่า",
      "เจริญศิลป์",
      "ทุ่งแก",
      "โคกศิลา",
      "หนองแปน"
    ],
    "โพนนาแก้ว": [
      "บ้านโพน",
      "นาแก้ว",
      "นาตงวัฒนา",
      "บ้านแป้น",
      "เชียงสือ"
    ],
    "ภูพาน": [
      "สร้างค้อ",
      "หลุบเลา",
      "โคกภู",
      "กกปลาซิว"
    ]
  },
  "นครพนม": {
    "เมืองนครพนม": [
      "ในเมือง",
      "หนองแสง",
      "นาทราย",
      "นาราชควาย",
      "กุรุคุ",
      "บ้านผึ้ง",
      "อาจสามารถ",
      "ขามเฒ่า",
      "บ้านกลาง",
      "ท่าค้อ",
      "คำเตย",
      "หนองญาติ",
      "ดงขวาง",
      "วังตามัว",
      "โพธิ์ตาก"
    ],
    "ปลาปาก": [
      "ปลาปาก",
      "หนองฮี",
      "กุตาไก้",
      "โคกสว่าง",
      "โคกสูง",
      "มหาชัย",
      "นามะเขือ",
      "หนองเทาใหญ่"
    ],
    "ท่าอุเทน": [
      "ท่าอุเทน",
      "โนนตาล",
      "ท่าจำปา",
      "ไชยบุรี",
      "พนอม",
      "พะทาย",
      "เวินพระบาท",
      "รามราช",
      "หนองเทา"
    ],
    "บ้านแพง": [
      "บ้านแพง",
      "ไผ่ล้อม",
      "โพนทอง",
      "หนองแวง",
      "นางัว",
      "นาเข"
    ],
    "ธาตุพนม": [
      "ธาตุพนม",
      "ฝั่งแดง",
      "โพนแพง",
      "พระกลางทุ่ง",
      "นาถ่อน",
      "แสนพัน",
      "ดอนนางหงส์",
      "น้ำก่ำ",
      "อุ่มเหม้า",
      "นาหนาด",
      "กุดฉิม",
      "ธาตุพนมเหนือ"
    ],
    "เรณูนคร": [
      "เรณู",
      "โพนทอง",
      "ท่าลาด",
      "นางาม",
      "โคกหินแฮ่",
      "หนองย่างชิ้น",
      "เรณูใต้",
      "นาขาม"
    ],
    "นาแก": [
      "นาแก",
      "พระซอง",
      "หนองสังข์",
      "นาคู่",
      "พิมาน",
      "พุ่มแก",
      "ก้านเหลือง",
      "หนองบ่อ",
      "นาเลียง",
      "บ้านแก้ง",
      "คำพี้",
      "สีชมพู"
    ],
    "ศรีสงคราม": [
      "ศรีสงคราม",
      "นาเดื่อ",
      "บ้านเอื้อง",
      "สามผง",
      "ท่าบ่อสงคราม",
      "บ้านข่า",
      "นาคำ",
      "โพนสว่าง",
      "หาดแพง"
    ],
    "นาหว้า": [
      "นาหว้า",
      "นางัว",
      "บ้านเสียว",
      "นาคูณใหญ่",
      "เหล่าพัฒนา",
      "ท่าเรือ"
    ],
    "โพนสวรรค์": [
      "โพนสวรรค์",
      "นาหัวบ่อ",
      "นาขมิ้น",
      "โพนบก",
      "บ้านค้อ",
      "โพนจาน",
      "นาใน"
    ],
    "นาทม": [
      "นาทม",
      "หนองซน",
      "ดอนเตย"
    ],
    "วังยาง": [
      "วังยาง",
      "โคกสี",
      "ยอดชาด",
      "หนองโพธิ์"
    ]
  },
  "มุกดาหาร": {
    "เมืองมุกดาหาร": [
      "มุกดาหาร",
      "ศรีบุญเรือง",
      "บ้านโคก",
      "บางทรายใหญ่",
      "โพนทราย",
      "ผึ่งแดด",
      "นาโสก",
      "นาสีนวน",
      "คำป่าหลาย",
      "คำอาฮวน",
      "ดงเย็น",
      "ดงมอน",
      "กุดแข้"
    ],
    "นิคมคำสร้อย": [
      "นิคมคำสร้อย",
      "นากอก",
      "หนองแวง",
      "กกแดง",
      "นาอุดม",
      "โชคชัย",
      "ร่มเกล้า"
    ],
    "ดอนตาล": [
      "ดอนตาล",
      "โพธิ์ไทร",
      "ป่าไร่",
      "เหล่าหมี",
      "บ้านบาก",
      "นาสะเม็ง",
      "บ้านแก้ง"
    ],
    "ดงหลวง": [
      "ดงหลวง",
      "หนองบัว",
      "กกตูม",
      "หนองแคน",
      "ชะโนดน้อย",
      "พังแดง"
    ],
    "คำชะอี": [
      "บ้านซ่ง",
      "คำชะอี",
      "หนองเอี่ยน",
      "บ้านค้อ",
      "บ้านเหล่า",
      "โพนงาม",
      "เหล่าสร้างถ่อ",
      "คำบก",
      "น้ำเที่ยง"
    ],
    "หว้านใหญ่": [
      "หว้านใหญ่",
      "ป่งขาม",
      "บางทรายน้อย",
      "ชะโนด",
      "ดงหมู"
    ],
    "หนองสูง": [
      "หนองสูง",
      "โนนยาง",
      "ภูวง",
      "บ้านเป้า",
      "หนองสูงใต้",
      "หนองสูงเหนือ"
    ]
  },
  "เชียงใหม่": {
    "เมืองเชียงใหม่": [
      "ศรีภูมิ",
      "พระสิงห์",
      "หายยา",
      "ช้างม่อย",
      "ช้างคลาน",
      "วัดเกต",
      "ช้างเผือก",
      "สุเทพ",
      "แม่เหียะ",
      "ป่าแดด",
      "หนองหอย",
      "ท่าศาลา",
      "หนองป่าครั่ง",
      "ฟ้าฮ่าม",
      "ป่าตัน",
      "สันผีเสื้อ"
    ],
    "จอมทอง": [
      "บ้านหลวง",
      "ข่วงเปา",
      "สบเตี๊ยะ",
      "บ้านแปะ",
      "ดอยแก้ว",
      "แม่สอย"
    ],
    "แม่แจ่ม": [
      "ช่างเคิ่ง",
      "ท่าผา",
      "บ้านทับ",
      "แม่ศึก",
      "แม่นาจร",
      "ปางหินฝน",
      "กองแขก"
    ],
    "เชียงดาว": [
      "เชียงดาว",
      "เมืองนะ",
      "เมืองงาย",
      "แม่นะ",
      "เมืองคอง",
      "ปิงโค้ง",
      "ทุ่งข้าวพวง"
    ],
    "ดอยสะเก็ด": [
      "เชิงดอย",
      "สันปูเลย",
      "ลวงเหนือ",
      "ป่าป้อง",
      "สง่าบ้าน",
      "ป่าลาน",
      "ตลาดขวัญ",
      "สำราญราษฎร์",
      "แม่คือ",
      "ตลาดใหญ่",
      "แม่ฮ้อยเงิน",
      "แม่โป่ง",
      "ป่าเมี่ยง",
      "เทพเสด็จ"
    ],
    "แม่แตง": [
      "สันมหาพน",
      "แม่แตง",
      "ขี้เหล็ก",
      "ช่อแล",
      "แม่หอพระ",
      "สบเปิง",
      "บ้านเป้า",
      "สันป่ายาง",
      "ป่าแป๋",
      "เมืองก๋าย",
      "บ้านช้าง",
      "กื้ดช้าง",
      "อินทขิล"
    ],
    "แม่ริม": [
      "ริมใต้",
      "ริมเหนือ",
      "สันโป่ง",
      "ขี้เหล็ก",
      "สะลวง",
      "ห้วยทราย",
      "แม่แรม",
      "โป่งแยง",
      "แม่สา",
      "ดอนแก้ว",
      "เหมืองแก้ว"
    ],
    "สะเมิง": [
      "สะเมิงใต้",
      "สะเมิงเหนือ",
      "แม่สาบ",
      "บ่อแก้ว",
      "ยั้งเมิน"
    ],
    "ฝาง": [
      "เวียง",
      "ม่อนปิ่น",
      "แม่งอน",
      "แม่สูน",
      "สันทราย",
      "แม่คะ",
      "แม่ข่า",
      "โป่งน้ำร้อน"
    ],
    "แม่อาย": [
      "แม่อาย",
      "แม่สาว",
      "สันต้นหมื้อ",
      "แม่นาวาง",
      "ท่าตอน",
      "บ้านหลวง",
      "มะลิกา"
    ],
    "พร้าว": [
      "เวียง",
      "ทุ่งหลวง",
      "ป่าตุ้ม",
      "ป่าไหน่",
      "สันทราย",
      "บ้านโป่ง",
      "น้ำแพร่",
      "เขื่อนผาก",
      "แม่แวน",
      "แม่ปั๋ง",
      "โหล่งขอด"
    ],
    "สันป่าตอง": [
      "ยุหว่า",
      "สันกลาง",
      "ท่าวังพร้าว",
      "มะขามหลวง",
      "แม่ก๊า",
      "บ้านแม",
      "บ้านกลาง",
      "ทุ่งสะโตก",
      "ทุ่งต้อม",
      "น้ำบ่อหลวง",
      "มะขุนหวาน"
    ],
    "สันกำแพง": [
      "สันกำแพง",
      "ทรายมูล",
      "ร้องวัวแดง",
      "บวกค้าง",
      "แช่ช้าง",
      "ออนใต้",
      "แม่ปูคา",
      "ห้วยทราย",
      "ต้นเปา",
      "สันกลาง"
    ],
    "สันทราย": [
      "สันทรายหลวง",
      "สันทรายน้อย",
      "สันพระเนตร",
      "สันนาเม็ง",
      "สันป่าเปา",
      "หนองแหย่ง",
      "หนองจ๊อม",
      "หนองหาร",
      "แม่แฝก",
      "แม่แฝกใหม่",
      "เมืองเล็น",
      "ป่าไผ่"
    ],
    "หางดง": [
      "หางดง",
      "หนองแก๋ว",
      "หารแก้ว",
      "หนองตอง",
      "ขุนคง",
      "สบแม่ข่า",
      "บ้านแหวน",
      "สันผักหวาน",
      "หนองควาย",
      "บ้านปง",
      "น้ำแพร่"
    ],
    "ฮอด": [
      "หางดง",
      "ฮอด",
      "บ้านตาล",
      "บ่อหลวง",
      "บ่อสลี",
      "นาคอเรือ"
    ],
    "ดอยเต่า": [
      "ดอยเต่า",
      "ท่าเดื่อ",
      "มืดกา",
      "บ้านแอ่น",
      "บงตัน",
      "โปงทุ่ง"
    ],
    "อมก๋อย": [
      "อมก๋อย",
      "ยางเปียง",
      "แม่ตื่น",
      "ม่อนจอง",
      "สบโขง",
      "นาเกียน"
    ],
    "สารภี": [
      "ยางเนิ้ง",
      "สารภี",
      "ชมภู",
      "ไชยสถาน",
      "ขัวมุง",
      "หนองแฝก",
      "หนองผึ้ง",
      "ท่ากว้าง",
      "ดอนแก้ว",
      "ท่าวังตาล",
      "สันทราย",
      "ป่าบง"
    ],
    "เวียงแหง": [
      "เมืองแหง",
      "เปียงหลวง",
      "แสนไห"
    ],
    "ไชยปราการ": [
      "ปงตำ",
      "ศรีดงเย็น",
      "แม่ทะลบ",
      "หนองบัว"
    ],
    "แม่วาง": [
      "บ้านกาด",
      "ทุ่งปี้",
      "ทุ่งรวงทอง",
      "แม่วิน",
      "ดอนเปา"
    ],
    "แม่ออน": [
      "ออนเหนือ",
      "ออนกลาง",
      "บ้านสหกรณ์",
      "ห้วยแก้ว",
      "แม่ทา",
      "ทาเหนือ"
    ],
    "ดอยหล่อ": [
      "ดอยหล่อ",
      "สองแคว",
      "ยางคราม",
      "สันติสุข"
    ],
    "กัลยาณิวัฒนา": [
      "บ้านจันทร์",
      "แม่แดด",
      "แจ่มหลวง"
    ]
  },
  "ลำพูน": {
    "เมืองลำพูน": [
      "ในเมือง",
      "เหมืองง่า",
      "อุโมงค์",
      "หนองช้างคืน",
      "ประตูป่า",
      "ริมปิง",
      "ต้นธง",
      "บ้านแป้น",
      "เหมืองจี้",
      "ป่าสัก",
      "เวียงยอง",
      "บ้านกลาง",
      "มะเขือแจ้",
      "ศรีบัวบาน",
      "หนองหนาม"
    ],
    "แม่ทา": [
      "ทาปลาดุก",
      "ทาสบเส้า",
      "ทากาศ",
      "ทาขุมเงิน",
      "ทาทุ่งหลวง",
      "ทาแม่ลอบ"
    ],
    "บ้านโฮ่ง": [
      "บ้านโฮ่ง",
      "ป่าพลู",
      "เหล่ายาว",
      "ศรีเตี้ย",
      "หนองปลาสะวาย"
    ],
    "ลี้": [
      "ลี้",
      "แม่ตืน",
      "นาทราย",
      "ดงดำ",
      "ก้อ",
      "แม่ลาน",
      "ป่าไผ่",
      "ศรีวิชัย"
    ],
    "ทุ่งหัวช้าง": [
      "ทุ่งหัวช้าง",
      "บ้านปวง",
      "ตะเคียนปม"
    ],
    "ป่าซาง": [
      "ปากบ่อง",
      "ป่าซาง",
      "แม่แรง",
      "ม่วงน้อย",
      "บ้านเรือน",
      "มะกอก",
      "ท่าตุ้ม",
      "น้ำดิบ",
      "นครเจดีย์"
    ],
    "บ้านธิ": [
      "บ้านธิ",
      "ห้วยยาบ"
    ],
    "เวียงหนองล่อง": [
      "หนองล่อง",
      "หนองยวง",
      "วังผาง"
    ]
  },
  "ลำปาง": {
    "เมืองลำปาง": [
      "เวียงเหนือ",
      "หัวเวียง",
      "สวนดอก",
      "สบตุ๋ย",
      "พระบาท",
      "ชมพู",
      "กล้วยแพะ",
      "ปงแสนทอง",
      "บ้านแลง",
      "บ้านเสด็จ",
      "พิชัย",
      "ทุ่งฝาย",
      "บ้านเอื้อม",
      "บ้านเป้า",
      "บ้านค่า",
      "บ่อแฮ้ว",
      "ต้นธงชัย",
      "นิคมพัฒนา",
      "บุญนาคพัฒนา"
    ],
    "แม่เมาะ": [
      "บ้านดง",
      "นาสัก",
      "จางเหนือ",
      "แม่เมาะ",
      "สบป้าด"
    ],
    "เกาะคา": [
      "ลำปางหลวง",
      "นาแก้ว",
      "ไหล่หิน",
      "วังพร้าว",
      "ศาลา",
      "เกาะคา",
      "นาแส่ง",
      "ท่าผา",
      "ใหม่พัฒนา"
    ],
    "เสริมงาม": [
      "ทุ่งงาม",
      "เสริมขวา",
      "เสริมซ้าย",
      "เสริมกลาง"
    ],
    "งาว": [
      "หลวงเหนือ",
      "หลวงใต้",
      "บ้านโป่ง",
      "บ้านร้อง",
      "ปงเตา",
      "นาแก",
      "บ้านอ้อน",
      "บ้านแหง",
      "บ้านหวด",
      "แม่ตีบ"
    ],
    "แจ้ห่ม": [
      "แจ้ห่ม",
      "บ้านสา",
      "ปงดอน",
      "แม่สุก",
      "เมืองมาย",
      "ทุ่งผึ้ง",
      "วิเชตนคร"
    ],
    "วังเหนือ": [
      "ทุ่งฮั้ว",
      "วังเหนือ",
      "วังใต้",
      "ร่องเคาะ",
      "วังทอง",
      "วังซ้าย",
      "วังแก้ว",
      "วังทรายคำ"
    ],
    "เถิน": [
      "ล้อมแรด",
      "แม่วะ",
      "แม่ปะ",
      "แม่มอก",
      "เวียงมอก",
      "นาโป่ง",
      "แม่ถอด",
      "เถินบุรี"
    ],
    "แม่พริก": [
      "แม่พริก",
      "ผาปัง",
      "แม่ปุ",
      "พระบาทวังตวง"
    ],
    "แม่ทะ": [
      "แม่ทะ",
      "นาครัว",
      "ป่าตัน",
      "บ้านกิ่ว",
      "บ้านบอม",
      "น้ำโจ้",
      "ดอนไฟ",
      "หัวเสือ",
      "วังเงิน",
      "สันดอนแก้ว"
    ],
    "สบปราบ": [
      "สบปราบ",
      "สมัย",
      "แม่กัวะ",
      "นายาง"
    ],
    "ห้างฉัตร": [
      "ห้างฉัตร",
      "หนองหล่ม",
      "เมืองยาว",
      "ปงยางคก",
      "เวียงตาล",
      "แม่สัน",
      "วอแก้ว"
    ],
    "เมืองปาน": [
      "เมืองปาน",
      "บ้านขอ",
      "ทุ่งกว๋าว",
      "แจ้ซ้อน",
      "หัวเมือง"
    ]
  },
  "อุตรดิตถ์": {
    "เมืองอุตรดิตถ์": [
      "ท่าอิฐ",
      "ท่าเสา",
      "บ้านเกาะ",
      "ป่าเซ่า",
      "คุ้งตะเภา",
      "วังกะพี้",
      "หาดกรวด",
      "น้ำริด",
      "งิ้วงาม",
      "บ้านด่านนาขาม",
      "บ้านด่าน",
      "ผาจุก",
      "วังดิน",
      "แสนตอ",
      "หาดงิ้ว",
      "ขุนฝาง",
      "ถ้ำฉลอง"
    ],
    "ตรอน": [
      "วังแดง",
      "บ้านแก่ง",
      "หาดสองแคว",
      "น้ำอ่าง",
      "ข่อยสูง"
    ],
    "ท่าปลา": [
      "ท่าปลา",
      "หาดล้า",
      "ผาเลือด",
      "จริม",
      "น้ำหมัน",
      "นางพญา",
      "ร่วมจิต"
    ],
    "น้ำปาด": [
      "แสนตอ",
      "บ้านฝาย",
      "เด่นเหล็ก",
      "น้ำไคร้",
      "น้ำไผ่",
      "ห้วยมุ่น",
      "ท่าแฝก"
    ],
    "ฟากท่า": [
      "ฟากท่า",
      "สองคอน",
      "บ้านเสี้ยว",
      "สองห้อง"
    ],
    "บ้านโคก": [
      "ม่วงเจ็ดต้น",
      "บ้านโคก",
      "นาขุม",
      "บ่อเบี้ย"
    ],
    "พิชัย": [
      "ในเมือง",
      "บ้านดารา",
      "ไร่อ้อย",
      "ท่าสัก",
      "คอรุม",
      "บ้านหม้อ",
      "ท่ามะเฟือง",
      "บ้านโคน",
      "พญาแมน",
      "นาอิน",
      "นายาง"
    ],
    "ลับแล": [
      "ศรีพนมมาศ",
      "แม่พูล",
      "นานกกก",
      "ฝายหลวง",
      "ชัยจุมพล",
      "ไผ่ล้อม",
      "ทุ่งยั้ง",
      "ด่านแม่คำมัน"
    ],
    "ทองแสนขัน": [
      "ผักขวง",
      "บ่อทอง",
      "ป่าคาย",
      "น้ำพี้"
    ]
  },
  "แพร่": {
    "เมืองแพร่": [
      "ในเวียง",
      "นาจักร",
      "น้ำชำ",
      "ป่าแดง",
      "ทุ่งโฮ้ง",
      "เหมืองหม้อ",
      "วังธง",
      "แม่หล่าย",
      "ห้วยม้า",
      "ป่าแมต",
      "บ้านถิ่น",
      "สวนเขื่อน",
      "วังหงส์",
      "แม่คำมี",
      "ทุ่งกวาว",
      "ท่าข้าม",
      "แม่ยม",
      "ช่อแฮ",
      "ร่องฟอง",
      "กาญจนา"
    ],
    "ร้องกวาง": [
      "ร้องกวาง",
      "ร้องเข็ม",
      "น้ำเลา",
      "บ้านเวียง",
      "ทุ่งศรี",
      "แม่ยางตาล",
      "แม่ยางฮ่อ",
      "ไผ่โทน",
      "ห้วยโรง",
      "แม่ทราย",
      "แม่ยางร้อง"
    ],
    "ลอง": [
      "ห้วยอ้อ",
      "บ้านปิน",
      "ต้าผามอก",
      "เวียงต้า",
      "ปากกาง",
      "หัวทุ่ง",
      "ทุ่งแล้ง",
      "บ่อเหล็กลอง",
      "แม่ปาน"
    ],
    "สูงเม่น": [
      "สูงเม่น",
      "น้ำชำ",
      "หัวฝาย",
      "ดอนมูล",
      "บ้านเหล่า",
      "บ้านกวาง",
      "บ้านปง",
      "บ้านกาศ",
      "ร่องกาศ",
      "สบสาย",
      "เวียงทอง",
      "พระหลวง"
    ],
    "เด่นชัย": [
      "เด่นชัย",
      "แม่จั๊วะ",
      "ไทรย้อย",
      "ห้วยไร่",
      "ปงป่าหวาย"
    ],
    "สอง": [
      "บ้านหนุน",
      "บ้านกลาง",
      "ห้วยหม้าย",
      "เตาปูน",
      "หัวเมือง",
      "สะเอียบ",
      "แดนชุมพล",
      "ทุ่งน้าว"
    ],
    "วังชิ้น": [
      "วังชิ้น",
      "สรอย",
      "แม่ป้าก",
      "นาพูน",
      "แม่พุง",
      "ป่าสัก",
      "แม่เกิ๋ง"
    ],
    "หนองม่วงไข่": [
      "แม่คำมี",
      "หนองม่วงไข่",
      "น้ำรัด",
      "วังหลวง",
      "ตำหนักธรรม",
      "ทุ่งแค้ว"
    ]
  },
  "น่าน": {
    "เมืองน่าน": [
      "ในเวียง",
      "บ่อ",
      "ผาสิงห์",
      "ไชยสถาน",
      "ถืมตอง",
      "เรือง",
      "นาซาว",
      "ดู่ใต้",
      "กองควาย",
      "บ่อสวก",
      "สะเนียน"
    ],
    "แม่จริม": [
      "หนองแดง",
      "หมอเมือง",
      "น้ำพาง",
      "น้ำปาย",
      "แม่จริม"
    ],
    "บ้านหลวง": [
      "บ้านฟ้า",
      "ป่าคาหลวง",
      "สวด",
      "บ้านพี้"
    ],
    "นาน้อย": [
      "นาน้อย",
      "เชียงของ",
      "ศรีษะเกษ",
      "สถาน",
      "สันทะ",
      "บัวใหญ่",
      "น้ำตก"
    ],
    "ปัว": [
      "ปัว",
      "แงง",
      "สถาน",
      "ศิลาแลง",
      "ศิลาเพชร",
      "อวน",
      "ไชยวัฒนา",
      "เจดีย์ชัย",
      "ภูคา",
      "สกาด",
      "ป่ากลาง",
      "วรนคร"
    ],
    "ท่าวังผา": [
      "ริม",
      "ป่าคา",
      "ผาตอ",
      "ยม",
      "ตาลชุม",
      "ศรีภูมิ",
      "จอมพระ",
      "แสนทอง",
      "ท่าวังผา",
      "ผาทอง"
    ],
    "เวียงสา": [
      "กลางเวียง",
      "ขึ่ง",
      "ไหล่น่าน",
      "ตาลชุม",
      "นาเหลือง",
      "ส้าน",
      "น้ำมวบ",
      "น้ำปั้ว",
      "ยาบหัวนา",
      "ปงสนุก",
      "อ่ายนาไลย",
      "ส้านนาหนองใหม่",
      "แม่ขะนิง",
      "แม่สาคร",
      "จอมจันทร์",
      "แม่สา",
      "ทุ่งศรีทอง"
    ],
    "ทุ่งช้าง": [
      "ปอน",
      "งอบ",
      "และ",
      "ทุ่งช้าง"
    ],
    "เชียงกลาง": [
      "เชียงกลาง",
      "เปือ",
      "เชียงคาน",
      "พระธาตุ",
      "พญาแก้ว",
      "พระพุทธบาท"
    ],
    "นาหมื่น": [
      "นาทะนุง",
      "บ่อแก้ว",
      "เมืองลี",
      "ปิงหลวง"
    ],
    "สันติสุข": [
      "ดู่พงษ์",
      "ป่าแลวหลวง",
      "พงษ์"
    ],
    "บ่อเกลือ": [
      "บ่อเกลือเหนือ",
      "บ่อเกลือใต้",
      "ภูฟ้า",
      "ดงพญา"
    ],
    "สองแคว": [
      "นาไร่หลวง",
      "ชนแดน",
      "ยอด"
    ],
    "ภูเพียง": [
      "ม่วงตึ๊ด",
      "นาปัง",
      "น้ำแก่น",
      "น้ำเกี๋ยน",
      "เมืองจัง",
      "ท่าน้าว",
      "ฝายแก้ว"
    ],
    "เฉลิมพระเกียรติ": [
      "ห้วยโก๋น",
      "ขุนน่าน"
    ]
  },
  "พะเยา": {
    "เมืองพะเยา": [
      "เวียง",
      "แม่ต๋ำ",
      "แม่นาเรือ",
      "บ้านตุ่น",
      "บ้านต๊ำ",
      "บ้านต๋อม",
      "แม่ปืม",
      "แม่กา",
      "บ้านใหม่",
      "จำป่าหวาย",
      "ท่าวังทอง",
      "แม่ใส",
      "บ้านสาง",
      "ท่าจำปี",
      "สันป่าม่วง"
    ],
    "จุน": [
      "ห้วยข้าวก่ำ",
      "จุน",
      "ลอ",
      "หงส์หิน",
      "ทุ่งรวงทอง",
      "ห้วยยางขาม",
      "พระธาตุขิงแกง"
    ],
    "เชียงคำ": [
      "หย่วน",
      "น้ำแวน",
      "เวียง",
      "ฝายกวาง",
      "เจดีย์คำ",
      "ร่มเย็น",
      "เชียงบาน",
      "แม่ลาว",
      "อ่างทอง",
      "ทุ่งผาสุข"
    ],
    "เชียงม่วน": [
      "เชียงม่วน",
      "บ้านมาง",
      "สระ"
    ],
    "ดอกคำใต้": [
      "ดอกคำใต้",
      "ดอนศรีชุม",
      "บ้านถ้ำ",
      "บ้านปิน",
      "ห้วยลาน",
      "สันโค้ง",
      "ป่าซาง",
      "หนองหล่ม",
      "ดงสุวรรณ",
      "บุญเกิด",
      "สว่างอารมณ์",
      "คือเวียง"
    ],
    "ปง": [
      "ปง",
      "ควร",
      "ออย",
      "งิม",
      "ผาช้างน้อย",
      "นาปรัง",
      "ขุนควร"
    ],
    "แม่ใจ": [
      "แม่ใจ",
      "ศรีถ้อย",
      "แม่สุก",
      "ป่าแฝก",
      "บ้านเหล่า",
      "เจริญราษฎร์"
    ],
    "ภูซาง": [
      "ภูซาง",
      "ป่าสัก",
      "ทุ่งกล้วย",
      "เชียงแรง",
      "สบบง"
    ],
    "ภูกามยาว": [
      "ห้วยแก้ว",
      "ดงเจน",
      "แม่อิง"
    ]
  },
  "เชียงราย": {
    "เมืองเชียงราย": [
      "เวียง",
      "รอบเวียง",
      "บ้านดู่",
      "นางแล",
      "แม่ข้าวต้ม",
      "แม่ยาว",
      "สันทราย",
      "แม่กรณ์",
      "ห้วยชมภู",
      "ห้วยสัก",
      "ริมกก",
      "ดอยลาน",
      "ป่าอ้อดอนชัย",
      "ท่าสาย",
      "ดอยฮาง",
      "ท่าสุด"
    ],
    "เวียงชัย": [
      "เวียงชัย",
      "ผางาม",
      "เวียงเหนือ",
      "ดอนศิลา",
      "เมืองชุม"
    ],
    "เชียงของ": [
      "เวียง",
      "สถาน",
      "ครึ่ง",
      "บุญเรือง",
      "ห้วยซ้อ",
      "ศรีดอนชัย",
      "ริมโขง"
    ],
    "เทิง": [
      "เวียง",
      "งิ้ว",
      "ปล้อง",
      "แม่ลอย",
      "เชียงเคี่ยน",
      "ตับเต่า",
      "หงาว",
      "สันทรายงาม",
      "ศรีดอนไชย",
      "หนองแรด"
    ],
    "พาน": [
      "สันมะเค็ด",
      "แม่อ้อ",
      "ธารทอง",
      "สันติสุข",
      "ดอยงาม",
      "หัวง้ม",
      "เจริญเมือง",
      "ป่าหุ่ง",
      "ม่วงคำ",
      "ทรายขาว",
      "สันกลาง",
      "แม่เย็น",
      "เมืองพาน",
      "ทานตะวัน",
      "เวียงห้าว"
    ],
    "ป่าแดด": [
      "ป่าแดด",
      "ป่าแงะ",
      "สันมะค่า",
      "โรงช้าง",
      "ศรีโพธิ์เงิน"
    ],
    "แม่จัน": [
      "แม่จัน",
      "จันจว้า",
      "แม่คำ",
      "ป่าซาง",
      "สันทราย",
      "ท่าข้าวเปลือก",
      "ป่าตึง",
      "แม่ไร่",
      "ศรีค้ำ",
      "จันจว้าใต้",
      "จอมสวรรค์"
    ],
    "เชียงแสน": [
      "เวียง",
      "ป่าสัก",
      "บ้านแซว",
      "ศรีดอนมูล",
      "แม่เงิน",
      "โยนก"
    ],
    "แม่สาย": [
      "แม่สาย",
      "ห้วยไคร้",
      "เกาะช้าง",
      "โป่งผา",
      "ศรีเมืองชุม",
      "เวียงพางคำ",
      "บ้านด้าย",
      "โป่งงาม"
    ],
    "แม่สรวย": [
      "แม่สรวย",
      "ป่าแดด",
      "แม่พริก",
      "ศรีถ้อย",
      "ท่าก๊อ",
      "วาวี",
      "เจดีย์หลวง"
    ],
    "เวียงป่าเป้า": [
      "สันสลี",
      "เวียง",
      "บ้านโป่ง",
      "ป่างิ้ว",
      "เวียงกาหลง",
      "แม่เจดีย์",
      "แม่เจดีย์ใหม่"
    ],
    "พญาเม็งราย": [
      "แม่เปา",
      "แม่ต๋ำ",
      "ไม้ยา",
      "เม็งราย",
      "ตาดควัน"
    ],
    "เวียงแก่น": [
      "ม่วงยาย",
      "ปอ",
      "หล่ายงาว",
      "ท่าข้าม"
    ],
    "ขุนตาล": [
      "ต้า",
      "ป่าตาล",
      "ยางฮอม"
    ],
    "แม่ฟ้าหลวง": [
      "เทอดไทย",
      "แม่สลองใน",
      "แม่สลองนอก",
      "แม่ฟ้าหลวง"
    ],
    "แม่ลาว": [
      "ดงมะดะ",
      "จอมหมอกแก้ว",
      "บัวสลี",
      "ป่าก่อดำ",
      "โป่งแพร่"
    ],
    "เวียงเชียงรุ้ง": [
      "ทุ่งก่อ",
      "ดงมหาวัน",
      "ป่าซาง"
    ],
    "ดอยหลวง": [
      "ปงน้อย",
      "โชคชัย",
      "หนองป่าก่อ"
    ]
  },
  "แม่ฮ่องสอน": {
    "เมืองแม่ฮ่องสอน": [
      "จองคำ",
      "ห้วยโป่ง",
      "ผาบ่อง",
      "ปางหมู",
      "หมอกจำแป่",
      "ห้วยผา",
      "ห้วยปูลิง"
    ],
    "ขุนยวม": [
      "ขุนยวม",
      "แม่เงา",
      "เมืองปอน",
      "แม่ยวมน้อย",
      "แม่กิ๊",
      "แม่อูคอ"
    ],
    "ปาย": [
      "เวียงใต้",
      "เวียงเหนือ",
      "แม่นาเติง",
      "แม่ฮี้",
      "ทุ่งยาว",
      "เมืองแปง",
      "โป่งสา"
    ],
    "แม่สะเรียง": [
      "บ้านกาศ",
      "แม่สะเรียง",
      "แม่คง",
      "แม่เหาะ",
      "แม่ยวม",
      "เสาหิน",
      "ป่าแป๋"
    ],
    "แม่ลาน้อย": [
      "แม่ลาน้อย",
      "แม่ลาหลวง",
      "ท่าผาปุ้ม",
      "แม่โถ",
      "ห้วยห้อม",
      "แม่นาจาง",
      "สันติคีรี",
      "ขุนแม่ลาน้อย"
    ],
    "สบเมย": [
      "สบเมย",
      "แม่คะตวน",
      "กองก๋อย",
      "แม่สวด",
      "ป่าโปง",
      "แม่สามแลบ"
    ],
    "ปางมะผ้า": [
      "สบป่อง",
      "ปางมะผ้า",
      "ถ้ำลอด",
      "นาปู่ป้อม"
    ]
  },
  "นครสวรรค์": {
    "เมืองนครสวรรค์": [
      "ปากน้ำโพ",
      "กลางแดด",
      "เกรียงไกร",
      "แควใหญ่",
      "ตะเคียนเลื่อน",
      "นครสวรรค์ตก",
      "นครสวรรค์ออก",
      "บางพระหลวง",
      "บางม่วง",
      "บ้านมะเกลือ",
      "บ้านแก่ง",
      "พระนอน",
      "วัดไทร",
      "หนองกรด",
      "หนองกระโดน",
      "หนองปลิง",
      "บึงเสนาท"
    ],
    "โกรกพระ": [
      "โกรกพระ",
      "ยางตาล",
      "บางมะฝ่อ",
      "บางประมุง",
      "นากลาง",
      "ศาลาแดง",
      "เนินกว้าว",
      "เนินศาลา",
      "หาดสูง"
    ],
    "ชุมแสง": [
      "ชุมแสง",
      "ทับกฤช",
      "พิกุล",
      "เกยไชย",
      "ท่าไม้",
      "บางเคียน",
      "หนองกระเจา",
      "พันลาน",
      "โคกหม้อ",
      "ไผ่สิงห์",
      "ฆะมัง",
      "ทับกฤชใต้"
    ],
    "หนองบัว": [
      "หนองบัว",
      "หนองกลับ",
      "ธารทหาร",
      "ห้วยร่วม",
      "ห้วยถั่วใต้",
      "ห้วยถั่วเหนือ",
      "ห้วยใหญ่",
      "ทุ่งทอง",
      "วังบ่อ"
    ],
    "บรรพตพิสัย": [
      "ท่างิ้ว",
      "บางตาหงาย",
      "หูกวาง",
      "อ่างทอง",
      "บ้านแดน",
      "บางแก้ว",
      "ตาขีด",
      "ตาสัง",
      "ด่านช้าง",
      "หนองกรด",
      "หนองตางู",
      "บึงปลาทู",
      "เจริญผล"
    ],
    "เก้าเลี้ยว": [
      "มหาโพธิ",
      "เก้าเลี้ยว",
      "หนองเต่า",
      "เขาดิน",
      "หัวดง"
    ],
    "ตาคลี": [
      "ตาคลี",
      "ช่องแค",
      "จันเสน",
      "ห้วยหอม",
      "หัวหวาย",
      "หนองโพ",
      "หนองหม้อ",
      "สร้อยทอง",
      "ลาดทิพรส",
      "พรหมนิมิต"
    ],
    "ท่าตะโก": [
      "ท่าตะโก",
      "พนมรอก",
      "หัวถนน",
      "สายลำโพง",
      "วังมหากร",
      "ดอนคา",
      "ทำนบ",
      "วังใหญ่",
      "พนมเศษ",
      "หนองหลวง"
    ],
    "ไพศาลี": [
      "โคกเดื่อ",
      "สำโรงชัย",
      "วังน้ำลัด",
      "ตะคร้อ",
      "โพธิ์ประสาท",
      "วังข่อย",
      "นาขอม",
      "ไพศาลี"
    ],
    "พยุหะคีรี": [
      "พยุหะ",
      "เนินมะกอก",
      "นิคมเขาบ่อแก้ว",
      "ม่วงหัก",
      "ยางขาว",
      "ย่านมัทรี",
      "เขาทอง",
      "ท่าน้ำอ้อย",
      "น้ำทรง",
      "เขากะลา",
      "สระทะเล"
    ],
    "ลาดยาว": [
      "ลาดยาว",
      "ห้วยน้ำหอม",
      "วังม้า",
      "วังเมือง",
      "สร้อยละคร",
      "มาบแก",
      "หนองยาว",
      "หนองนมวัว",
      "บ้านไร่",
      "เนินขี้เหล็ก",
      "ศาลเจ้าไก่ต่อ",
      "สระแก้ว"
    ],
    "ตากฟ้า": [
      "ตากฟ้า",
      "ลำพยนต์",
      "สุขสำราญ",
      "หนองพิกุล",
      "พุนกยูง",
      "อุดมธัญญา",
      "เขาชายธง"
    ],
    "แม่วงก์": [
      "แม่วงก์",
      "แม่เล่ย์",
      "วังซ่าน",
      "เขาชนกัน"
    ],
    "แม่เปิน": [
      "แม่เปิน"
    ],
    "ชุมตาบง": [
      "ชุมตาบง",
      "ปางสวรรค์"
    ]
  },
  "อุทัยธานี": {
    "เมืองอุทัยธานี": [
      "อุทัยใหม่",
      "น้ำซึม",
      "สะแกกรัง",
      "ดอนขวาง",
      "หาดทนง",
      "เกาะเทโพ",
      "ท่าซุง",
      "หนองแก",
      "โนนเหล็ก",
      "หนองเต่า",
      "หนองไผ่แบน",
      "หนองพังค่า",
      "ทุ่งใหญ่",
      "เนินแจง"
    ],
    "ทัพทัน": [
      "ทัพทัน",
      "ทุ่งนาไทย",
      "เขาขี้ฝอย",
      "หนองหญ้าปล้อง",
      "โคกหม้อ",
      "หนองยายดา",
      "หนองกลางดง",
      "หนองกระทุ่ม",
      "หนองสระ",
      "ตลุกดู่"
    ],
    "สว่างอารมณ์": [
      "สว่างอารมณ์",
      "หนองหลวง",
      "พลวงสองนาง",
      "ไผ่เขียว",
      "บ่อยาง"
    ],
    "หนองฉาง": [
      "หนองฉาง",
      "หนองยาง",
      "หนองนางนวล",
      "หนองสรวง",
      "บ้านเก่า",
      "อุทัยเก่า",
      "ทุ่งโพ",
      "ทุ่งพง",
      "เขาบางแกรก",
      "เขากวางทอง"
    ],
    "หนองขาหย่าง": [
      "หนองขาหย่าง",
      "หนองไผ่",
      "ดอนกลอย",
      "ห้วยรอบ",
      "ทุ่งพึ่ง",
      "ท่าโพ",
      "หมกแถว",
      "หลุมเข้า",
      "ดงขวาง"
    ],
    "บ้านไร่": [
      "บ้านไร่",
      "ทัพหลวง",
      "ห้วยแห้ง",
      "คอกควาย",
      "วังหิน",
      "เมืองการุ้ง",
      "แก่นมะกรูด",
      "หนองจอก",
      "หูช้าง",
      "บ้านบึง",
      "บ้านใหม่คลองเคียน",
      "หนองบ่มกล้วย",
      "เจ้าวัด"
    ],
    "ลานสัก": [
      "ลานสัก",
      "ประดู่ยืน",
      "ป่าอ้อ",
      "ระบำ",
      "น้ำรอบ",
      "ทุ่งนางาม"
    ],
    "ห้วยคต": [
      "สุขฤทัย",
      "ทองหลาง",
      "ห้วยคต"
    ]
  },
  "กำแพงเพชร": {
    "เมืองกำแพงเพชร": [
      "ในเมือง",
      "ไตรตรึงษ์",
      "อ่างทอง",
      "นาบ่อคำ",
      "นครชุม",
      "ทรงธรรม",
      "ลานดอกไม้",
      "หนองปลิง",
      "คณฑี",
      "นิคมทุ่งโพธิ์ทะเล",
      "เทพนคร",
      "วังทอง",
      "ท่าขุนราม",
      "คลองแม่ลาย",
      "ธำมรงค์",
      "สระแก้ว"
    ],
    "ไทรงาม": [
      "ไทรงาม",
      "หนองคล้า",
      "หนองทอง",
      "หนองไม้กอง",
      "มหาชัย",
      "พานทอง",
      "หนองแม่แตง"
    ],
    "คลองลาน": [
      "คลองน้ำไหล",
      "โป่งน้ำร้อน",
      "คลองลานพัฒนา",
      "สักงาม"
    ],
    "ขาณุวรลักษบุรี": [
      "ยางสูง",
      "ป่าพุทรา",
      "แสนตอ",
      "สลกบาตร",
      "บ่อถ้ำ",
      "ดอนแตง",
      "วังชะพลู",
      "โค้งไผ่",
      "ปางมะค่า",
      "วังหามแห",
      "เกาะตาล"
    ],
    "คลองขลุง": [
      "คลองขลุง",
      "ท่ามะเขือ",
      "ท่าพุทรา",
      "แม่ลาด",
      "วังยาง",
      "วังแขม",
      "หัวถนน",
      "วังไทร",
      "วังบัว",
      "คลองสมบูรณ์"
    ],
    "พรานกระต่าย": [
      "พรานกระต่าย",
      "หนองหัววัว",
      "ท่าไม้",
      "วังควง",
      "วังตะแบก",
      "เขาคีริส",
      "คุยบ้านโอง",
      "คลองพิไกร",
      "ถ้ำกระต่ายทอง",
      "ห้วยยั้ง"
    ],
    "ลานกระบือ": [
      "ลานกระบือ",
      "ช่องลม",
      "หนองหลวง",
      "โนนพลวง",
      "ประชาสุขสันต์",
      "บึงทับแรต",
      "จันทิมา"
    ],
    "ทรายทองวัฒนา": [
      "ทุ่งทราย",
      "ทุ่งทอง",
      "ถาวรวัฒนา"
    ],
    "ปางศิลาทอง": [
      "โพธิ์ทอง",
      "หินดาต",
      "ปางตาไว"
    ],
    "บึงสามัคคี": [
      "บึงสามัคคี",
      "วังชะโอน",
      "ระหาน",
      "เทพนิมิต"
    ],
    "โกสัมพีนคร": [
      "โกสัมพี",
      "เพชรชมภู",
      "ลานดอกไม้ตก"
    ]
  },
  "ตาก": {
    "เมืองตาก": [
      "ระแหง",
      "หนองหลวง",
      "เชียงเงิน",
      "หัวเดียด",
      "หนองบัวเหนือ",
      "ไม้งาม",
      "โป่งแดง",
      "น้ำรึม",
      "วังหิน",
      "แม่ท้อ",
      "ป่ามะม่วง",
      "หนองบัวใต้",
      "วังประจบ",
      "ตลุกกลางทุ่ง"
    ],
    "บ้านตาก": [
      "ตากออก",
      "สมอโคน",
      "แม่สลิด",
      "ตากตก",
      "เกาะตะเภา",
      "ทุ่งกระเชาะ",
      "ท้องฟ้า"
    ],
    "สามเงา": [
      "สามเงา",
      "วังหมัน",
      "ยกกระบัตร",
      "ย่านรี",
      "บ้านนา",
      "วังจันทร์"
    ],
    "แม่ระมาด": [
      "แม่ระมาด",
      "แม่จะเรา",
      "ขะเนจื้อ",
      "แม่ตื่น",
      "สามหมื่น",
      "พระธาตุ"
    ],
    "ท่าสองยาง": [
      "ท่าสองยาง",
      "แม่ต้าน",
      "แม่สอง",
      "แม่หละ",
      "แม่วะหลวง",
      "แม่อุสุ"
    ],
    "แม่สอด": [
      "แม่สอด",
      "แม่กุ",
      "พะวอ",
      "แม่ตาว",
      "แม่กาษา",
      "ท่าสายลวด",
      "แม่ปะ",
      "มหาวัน",
      "ด่านแม่ละเมา",
      "พระธาตุผาแดง"
    ],
    "พบพระ": [
      "พบพระ",
      "ช่องแคบ",
      "คีรีราษฎร์",
      "วาเล่ย์",
      "รวมไทยพัฒนา"
    ],
    "อุ้มผาง": [
      "อุ้มผาง",
      "หนองหลวง",
      "โมโกร",
      "แม่จัน",
      "แม่ละมุ้ง",
      "แม่กลอง"
    ],
    "วังเจ้า": [
      "เชียงทอง",
      "นาโบสถ์",
      "ประดาง"
    ]
  },
  "สุโขทัย": {
    "เมืองสุโขทัย": [
      "ธานี",
      "บ้านสวน",
      "เมืองเก่า",
      "ปากแคว",
      "ยางซ้าย",
      "บ้านกล้วย",
      "บ้านหลุม",
      "ตาลเตี้ย",
      "ปากพระ",
      "วังทองแดง"
    ],
    "บ้านด่านลานหอย": [
      "ลานหอย",
      "บ้านด่าน",
      "วังตะคร้อ",
      "วังน้ำขาว",
      "ตลิ่งชัน",
      "หนองหญ้าปล้อง",
      "วังลึก"
    ],
    "คีรีมาศ": [
      "โตนด",
      "ทุ่งหลวง",
      "บ้านป้อม",
      "สามพวง",
      "ศรีคีรีมาศ",
      "หนองจิก",
      "นาเชิงคีรี",
      "หนองกระดิ่ง",
      "บ้านน้ำพุ",
      "ทุ่งยางเมือง"
    ],
    "กงไกรลาศ": [
      "กง",
      "บ้านกร่าง",
      "ไกรนอก",
      "ไกรกลาง",
      "ไกรใน",
      "ดงเดือย",
      "ป่าแฝก",
      "กกแรต",
      "ท่าฉนวน",
      "หนองตูม",
      "บ้านใหม่สุขเกษม"
    ],
    "ศรีสัชนาลัย": [
      "หาดเสี้ยว",
      "ป่างิ้ว",
      "แม่สำ",
      "แม่สิน",
      "บ้านตึก",
      "หนองอ้อ",
      "ท่าชัย",
      "ศรีสัชนาลัย",
      "ดงคู่",
      "บ้านแก่ง",
      "สารจิตร"
    ],
    "ศรีสำโรง": [
      "คลองตาล",
      "วังลึก",
      "สามเรือน",
      "บ้านนา",
      "วังทอง",
      "นาขุนไกร",
      "เกาะตาเลี้ยง",
      "วัดเกาะ",
      "บ้านไร่",
      "ทับผึ้ง",
      "บ้านซ่าน",
      "วังใหญ่",
      "ราวต้นจันทร์"
    ],
    "สวรรคโลก": [
      "เมืองสวรรคโลก",
      "ในเมือง",
      "คลองกระจง",
      "วังพิณพาทย์",
      "วังไม้ขอน",
      "ย่านยาว",
      "นาทุ่ง",
      "คลองยาง",
      "เมืองบางยม",
      "ท่าทอง",
      "ปากน้ำ",
      "ป่ากุมเกาะ",
      "เมืองบางขลัง",
      "หนองกลับ"
    ],
    "ศรีนคร": [
      "ศรีนคร",
      "นครเดิฐ",
      "น้ำขุม",
      "คลองมะพลับ",
      "หนองบัว"
    ],
    "ทุ่งเสลี่ยม": [
      "บ้านใหม่ไชยมงคล",
      "ไทยชนะศึก",
      "ทุ่งเสลี่ยม",
      "กลางดง",
      "เขาแก้วศรีสมบูรณ์"
    ]
  },
  "พิษณุโลก": {
    "เมืองพิษณุโลก": [
      "ในเมือง",
      "วังน้ำคู้",
      "วัดจันทร์",
      "วัดพริก",
      "ท่าทอง",
      "ท่าโพธิ์",
      "สมอแข",
      "ดอนทอง",
      "บ้านป่า",
      "ปากโทก",
      "หัวรอ",
      "จอมทอง",
      "บ้านกร่าง",
      "บ้านคลอง",
      "พลายชุมพล",
      "มะขามสูง",
      "อรัญญิก",
      "บึงพระ",
      "ไผ่ขอดอน",
      "งิ้วงาม"
    ],
    "นครไทย": [
      "นครไทย",
      "หนองกะท้าว",
      "บ้านแยง",
      "เนินเพิ่ม",
      "นาบัว",
      "นครชุม",
      "น้ำกุ่ม",
      "ยางโกลน",
      "บ่อโพธิ์",
      "บ้านพร้าว",
      "ห้วยเฮี้ย"
    ],
    "ชาติตระการ": [
      "ป่าแดง",
      "ชาติตระการ",
      "สวนเมี่ยง",
      "บ้านดง",
      "บ่อภาค",
      "ท่าสะแก"
    ],
    "บางระกำ": [
      "บางระกำ",
      "ปลักแรด",
      "พันเสา",
      "วังอิทก",
      "บึงกอก",
      "หนองกุลา",
      "ชุมแสงสงคราม",
      "นิคมพัฒนา",
      "บ่อทอง",
      "ท่านางงาม",
      "คุยม่วง"
    ],
    "บางกระทุ่ม": [
      "บางกระทุ่ม",
      "บ้านไร่",
      "โคกสลุด",
      "สนามคลี",
      "ท่าตาล",
      "ไผ่ล้อม",
      "นครป่าหมาก",
      "เนินกุ่ม",
      "วัดตายม"
    ],
    "พรหมพิราม": [
      "พรหมพิราม",
      "ท่าช้าง",
      "วงฆ้อง",
      "มะตูม",
      "หอกลอง",
      "ศรีภิรมย์",
      "ตลุกเทียม",
      "วังวน",
      "หนองแขม",
      "มะต้อง",
      "ทับยายเชียง",
      "ดงประคำ"
    ],
    "วัดโบสถ์": [
      "วัดโบสถ์",
      "ท่างาม",
      "ท้อแท้",
      "บ้านยาง",
      "หินลาด",
      "คันโช้ง"
    ],
    "วังทอง": [
      "วังทอง",
      "พันชาลี",
      "แม่ระกา",
      "บ้านกลาง",
      "วังพิกุล",
      "แก่งโสภา",
      "ท่าหมื่นราม",
      "วังนกแอ่น",
      "หนองพระ",
      "ชัยนาม",
      "ดินทอง"
    ],
    "เนินมะปราง": [
      "ชมพู",
      "บ้านมุง",
      "ไทรย้อย",
      "วังโพรง",
      "บ้านน้อยซุ้มขี้เหล็ก",
      "เนินมะปราง",
      "วังยาง"
    ]
  },
  "พิจิตร": {
    "เมืองพิจิตร": [
      "ในเมือง",
      "ไผ่ขวาง",
      "ย่านยาว",
      "ท่าฬ่อ",
      "ปากทาง",
      "คลองคะเชนทร์",
      "โรงช้าง",
      "เมืองเก่า",
      "ท่าหลวง",
      "บ้านบุ่ง",
      "ฆะมัง",
      "ดงป่าคำ",
      "หัวดง",
      "ป่ามะคาบ",
      "สายคำโห้",
      "ดงกลาง"
    ],
    "วังทรายพูน": [
      "วังทรายพูน",
      "หนองปลาไหล",
      "หนองพระ",
      "หนองปล้อง"
    ],
    "โพธิ์ประทับช้าง": [
      "โพธิ์ประทับช้าง",
      "ไผ่ท่าโพ",
      "วังจิก",
      "ไผ่รอบ",
      "ดงเสือเหลือง",
      "เนินสว่าง",
      "ทุ่งใหญ่"
    ],
    "ตะพานหิน": [
      "ตะพานหิน",
      "งิ้วราย",
      "ห้วยเกตุ",
      "ไทรโรงโขน",
      "หนองพยอม",
      "ทุ่งโพธิ์",
      "ดงตะขบ",
      "คลองคูณ",
      "วังสำโรง",
      "วังหว้า",
      "วังหลุม",
      "ทับหมัน",
      "ไผ่หลวง"
    ],
    "บางมูลนาก": [
      "บางมูลนาก",
      "บางไผ่",
      "หอไกร",
      "เนินมะกอก",
      "วังสำโรง",
      "ภูมิ",
      "วังกรด",
      "ห้วยเขน",
      "วังตะกู",
      "ลำประดา"
    ],
    "โพทะเล": [
      "โพทะเล",
      "ท้ายน้ำ",
      "ทะนง",
      "ท่าบัว",
      "ทุ่งน้อย",
      "ท่าขมิ้น",
      "ท่าเสา",
      "บางคลาน",
      "ท่านั่ง",
      "บ้านน้อย",
      "วัดขวาง"
    ],
    "สามง่าม": [
      "สามง่าม",
      "กำแพงดิน",
      "รังนก",
      "เนินปอ",
      "หนองโสน"
    ],
    "ทับคล้อ": [
      "ทับคล้อ",
      "เขาทราย",
      "เขาเจ็ดลูก",
      "ท้ายทุ่ง"
    ],
    "สากเหล็ก": [
      "สากเหล็ก",
      "ท่าเยี่ยม",
      "คลองทราย",
      "หนองหญ้าไทร",
      "วังทับไทร"
    ],
    "บึงนาราง": [
      "ห้วยแก้ว",
      "โพธิ์ไทรงาม",
      "แหลมรัง",
      "บางลาย",
      "บึงนาราง"
    ],
    "ดงเจริญ": [
      "วังงิ้วใต้",
      "วังงิ้ว",
      "ห้วยร่วม",
      "ห้วยพุก",
      "สำนักขุนเณร"
    ],
    "วชิรบารมี": [
      "บ้านนา",
      "บึงบัว",
      "วังโมกข์",
      "หนองหลุม"
    ]
  },
  "เพชรบูรณ์": {
    "เมืองเพชรบูรณ์": [
      "ในเมือง",
      "ตะเบาะ",
      "บ้านโตก",
      "สะเดียง",
      "ป่าเลา",
      "นางั่ว",
      "ท่าพล",
      "ดงมูลเหล็ก",
      "บ้านโคก",
      "ชอนไพร",
      "นาป่า",
      "นายม",
      "วังชมภู",
      "น้ำร้อน",
      "ห้วยสะแก",
      "ห้วยใหญ่",
      "ระวิง"
    ],
    "ชนแดน": [
      "ชนแดน",
      "ดงขุย",
      "ท่าข้าม",
      "พุทธบาท",
      "ลาดแค",
      "บ้านกล้วย",
      "ซับพุทรา",
      "ตะกุดไร",
      "ศาลาลาย"
    ],
    "หล่มสัก": [
      "หล่มสัก",
      "วัดป่า",
      "ตาลเดี่ยว",
      "ฝายนาแซง",
      "หนองสว่าง",
      "น้ำเฮี้ย",
      "สักหลง",
      "ท่าอิบุญ",
      "บ้านโสก",
      "บ้านติ้ว",
      "ห้วยไร่",
      "น้ำก้อ",
      "ปากช่อง",
      "น้ำชุน",
      "หนองไขว่",
      "ลานบ่า",
      "บุ่งคล้า",
      "บุ่งน้ำเต้า",
      "บ้านกลาง",
      "ช้างตะลูด",
      "บ้านไร่",
      "ปากดุก",
      "บ้านหวาย"
    ],
    "หล่มเก่า": [
      "หล่มเก่า",
      "นาซำ",
      "หินฮาว",
      "บ้านเนิน",
      "ศิลา",
      "นาแซง",
      "วังบาล",
      "นาเกาะ",
      "ตาดกลอย"
    ],
    "วิเชียรบุรี": [
      "ท่าโรง",
      "สระประดู่",
      "สามแยก",
      "โคกปรง",
      "น้ำร้อน",
      "บ่อรัง",
      "พุเตย",
      "พุขาม",
      "ภูน้ำหยด",
      "ซับสมบูรณ์",
      "บึงกระจับ",
      "วังใหญ่",
      "ยางสาว",
      "ซับน้อย"
    ],
    "ศรีเทพ": [
      "ศรีเทพ",
      "สระกรวด",
      "คลองกระจัง",
      "นาสนุ่น",
      "โคกสะอาด",
      "หนองย่างทอย",
      "ประดู่งาม"
    ],
    "หนองไผ่": [
      "กองทูล",
      "นาเฉลียง",
      "บ้านโภชน์",
      "ท่าแดง",
      "เพชรละคร",
      "บ่อไทย",
      "ห้วยโป่ง",
      "วังท่าดี",
      "บัววัฒนา",
      "หนองไผ่",
      "วังโบสถ์",
      "ยางงาม",
      "ท่าด้วง"
    ],
    "บึงสามพัน": [
      "ซับสมอทอด",
      "ซับไม้แดง",
      "หนองแจง",
      "กันจุ",
      "วังพิกุล",
      "พญาวัง",
      "ศรีมงคล",
      "สระแก้ว",
      "บึงสามพัน"
    ],
    "น้ำหนาว": [
      "น้ำหนาว",
      "หลักด่าน",
      "วังกวาง",
      "โคกมน"
    ],
    "วังโป่ง": [
      "วังโป่ง",
      "ท้ายดง",
      "ซับเปิบ",
      "วังหิน",
      "วังศาล"
    ],
    "เขาค้อ": [
      "ทุ่งสมอ",
      "แคมป์สน",
      "เขาค้อ",
      "ริมสีม่วง",
      "สะเดาะพง",
      "หนองแม่นา",
      "เข็กน้อย"
    ]
  },
  "ราชบุรี": {
    "เมืองราชบุรี": [
      "หน้าเมือง",
      "เจดีย์หัก",
      "ดอนตะโก",
      "หนองกลางนา",
      "ห้วยไผ่",
      "คุ้งน้ำวน",
      "คุ้งกระถิน",
      "อ่างทอง",
      "โคกหม้อ",
      "สามเรือน",
      "พิกุลทอง",
      "น้ำพุ",
      "ดอนแร่",
      "หินกอง",
      "เขาแร้ง",
      "เกาะพลับพลา",
      "หลุมดิน",
      "บางป่า",
      "พงสวาย",
      "คูบัว",
      "ท่าราบ",
      "บ้านไร่"
    ],
    "จอมบึง": [
      "จอมบึง",
      "ปากช่อง",
      "เบิกไพร",
      "ด่านทับตะโก",
      "แก้มอ้น",
      "รางบัว"
    ],
    "สวนผึ้ง": [
      "สวนผึ้ง",
      "ป่าหวาย",
      "ท่าเคย",
      "ตะนาวศรี"
    ],
    "ดำเนินสะดวก": [
      "ดำเนินสะดวก",
      "ประสาทสิทธิ์",
      "ศรีสุราษฎร์",
      "ตาหลวง",
      "ดอนกรวย",
      "ดอนคลัง",
      "บัวงาม",
      "บ้านไร่",
      "แพงพวย",
      "สี่หมื่น",
      "ท่านัด",
      "ขุนพิทักษ์",
      "ดอนไผ่"
    ],
    "บ้านโป่ง": [
      "บ้านโป่ง",
      "ท่าผา",
      "กรับใหญ่",
      "ปากแรต",
      "หนองกบ",
      "หนองอ้อ",
      "ดอนกระเบื้อง",
      "สวนกล้วย",
      "นครชุมน์",
      "บ้านม่วง",
      "คุ้งพยอม",
      "หนองปลาหมอ",
      "เขาขลุง",
      "เบิกไพร",
      "ลาดบัวขาว"
    ],
    "บางแพ": [
      "บางแพ",
      "วังเย็น",
      "หัวโพ",
      "วัดแก้ว",
      "ดอนใหญ่",
      "ดอนคา",
      "โพหัก"
    ],
    "โพธาราม": [
      "โพธาราม",
      "ดอนกระเบื้อง",
      "หนองโพ",
      "บ้านเลือก",
      "คลองตาคต",
      "บ้านฆ้อง",
      "บ้านสิงห์",
      "ดอนทราย",
      "เจ็ดเสมียน",
      "คลองข่อย",
      "ชำแระ",
      "สร้อยฟ้า",
      "ท่าชุมพล",
      "บางโตนด",
      "เตาปูน",
      "นางแก้ว",
      "ธรรมเสน",
      "เขาชะงุ้ม",
      "หนองกวาง"
    ],
    "ปากท่อ": [
      "ทุ่งหลวง",
      "วังมะนาว",
      "ดอนทราย",
      "หนองกระทุ่ม",
      "ปากท่อ",
      "ป่าไก่",
      "วัดยางงาม",
      "อ่างหิน",
      "บ่อกระดาน",
      "ยางหัก",
      "วันดาว",
      "ห้วยยางโทน"
    ],
    "วัดเพลง": [
      "เกาะศาลพระ",
      "จอมประทัด",
      "วัดเพลง"
    ],
    "บ้านคา": [
      "บ้านคา",
      "บ้านบึง",
      "หนองพันจันทร์"
    ]
  },
  "กาญจนบุรี": {
    "เมืองกาญจนบุรี": [
      "บ้านเหนือ",
      "บ้านใต้",
      "ปากแพรก",
      "ท่ามะขาม",
      "แก่งเสี้ยน",
      "หนองบัว",
      "ลาดหญ้า",
      "วังด้ง",
      "ช่องสะเดา",
      "หนองหญ้า",
      "เกาะสำโรง",
      "บ้านเก่า",
      "วังเย็น"
    ],
    "ไทรโยค": [
      "ลุ่มสุ่ม",
      "ท่าเสา",
      "สิงห์",
      "ไทรโยค",
      "วังกระแจะ",
      "ศรีมงคล",
      "บ้องตี้"
    ],
    "บ่อพลอย": [
      "บ่อพลอย",
      "หนองกุ่ม",
      "หนองรี",
      "หลุมรัง",
      "ช่องด่าน",
      "หนองกร่าง"
    ],
    "ศรีสวัสดิ์": [
      "นาสวน",
      "ด่านแม่แฉลบ",
      "หนองเป็ด",
      "ท่ากระดาน",
      "เขาโจด",
      "แม่กระบุง"
    ],
    "ท่ามะกา": [
      "พงตึก",
      "ยางม่วง",
      "ดอนชะเอม",
      "ท่าไม้",
      "ตะคร้ำเอน",
      "ท่ามะกา",
      "ท่าเรือ",
      "โคกตะบอง",
      "ดอนขมิ้น",
      "อุโลกสี่หมื่น",
      "เขาสามสิบหาบ",
      "พระแท่น",
      "หวายเหนียว",
      "แสนตอ",
      "สนามแย้",
      "ท่าเสา",
      "หนองลาน"
    ],
    "ท่าม่วง": [
      "ท่าม่วง",
      "วังขนาย",
      "วังศาลา",
      "ท่าล้อ",
      "หนองขาว",
      "ทุ่งทอง",
      "เขาน้อย",
      "ม่วงชุม",
      "บ้านใหม่",
      "พังตรุ",
      "ท่าตะคร้อ",
      "รางสาลี่",
      "หนองตากยา"
    ],
    "ทองผาภูมิ": [
      "ท่าขนุน",
      "ปิล๊อก",
      "หินดาด",
      "ลิ่นถิ่น",
      "ชะแล",
      "ห้วยเขย่ง",
      "สหกรณ์นิคม"
    ],
    "สังขละบุรี": [
      "หนองลู",
      "ปรังเผล",
      "ไล่โว่"
    ],
    "พนมทวน": [
      "พนมทวน",
      "หนองโรง",
      "ทุ่งสมอ",
      "ดอนเจดีย์",
      "พังตรุ",
      "รางหวาย",
      "หนองสาหร่าย",
      "ดอนตาเพชร"
    ],
    "เลาขวัญ": [
      "เลาขวัญ",
      "หนองโสน",
      "หนองประดู่",
      "หนองปลิง",
      "หนองนกแก้ว",
      "ทุ่งกระบ่ำ",
      "หนองฝ้าย"
    ],
    "ด่านมะขามเตี้ย": [
      "ด่านมะขามเตี้ย",
      "กลอนโด",
      "จรเข้เผือก",
      "หนองไผ่"
    ],
    "หนองปรือ": [
      "หนองปรือ",
      "หนองปลาไหล",
      "สมเด็จเจริญ"
    ],
    "ห้วยกระเจา": [
      "ห้วยกระเจา",
      "วังไผ่",
      "ดอนแสลบ",
      "สระลงเรือ"
    ]
  },
  "สุพรรณบุรี": {
    "เมืองสุพรรณบุรี": [
      "ท่าพี่เลี้ยง",
      "รั้วใหญ่",
      "ทับตีเหล็ก",
      "ท่าระหัด",
      "ไผ่ขวาง",
      "โคกโคเฒ่า",
      "ดอนตาล",
      "ดอนมะสังข์",
      "พิหารแดง",
      "ดอนกำยาน",
      "ดอนโพธิ์ทอง",
      "บ้านโพธิ์",
      "สระแก้ว",
      "ตลิ่งชัน",
      "บางกุ้ง",
      "ศาลาขาว",
      "สวนแตง",
      "สนามชัย",
      "โพธิ์พระยา",
      "สนามคลี"
    ],
    "เดิมบางนางบวช": [
      "เขาพระ",
      "เดิมบาง",
      "นางบวช",
      "เขาดิน",
      "ปากน้ำ",
      "ทุ่งคลี",
      "โคกช้าง",
      "หัวเขา",
      "หัวนา",
      "บ่อกรุ",
      "วังศรีราช",
      "ป่าสะแก",
      "ยางนอน",
      "หนองกระทุ่ม"
    ],
    "ด่านช้าง": [
      "หนองมะค่าโมง",
      "ด่านช้าง",
      "ห้วยขมิ้น",
      "องค์พระ",
      "วังคัน",
      "นิคมกระเสียว",
      "วังยาว"
    ],
    "บางปลาม้า": [
      "โคกคราม",
      "บางปลาม้า",
      "ตะค่า",
      "บางใหญ่",
      "กฤษณา",
      "สาลี",
      "ไผ่กองดิน",
      "องครักษ์",
      "จรเข้ใหญ่",
      "บ้านแหลม",
      "มะขามล้ม",
      "วังน้ำเย็น",
      "วัดโบสถ์",
      "วัดดาว"
    ],
    "ศรีประจันต์": [
      "ศรีประจันต์",
      "บ้านกร่าง",
      "มดแดง",
      "บางงาม",
      "ดอนปรู",
      "ปลายนา",
      "วังหว้า",
      "วังน้ำซับ",
      "วังยาง"
    ],
    "ดอนเจดีย์": [
      "ดอนเจดีย์",
      "หนองสาหร่าย",
      "ไร่รถ",
      "สระกระโจม",
      "ทะเลบก"
    ],
    "สองพี่น้อง": [
      "สองพี่น้อง",
      "บางเลน",
      "บางตาเถร",
      "บางตะเคียน",
      "บ้านกุ่ม",
      "หัวโพธิ์",
      "บางพลับ",
      "เนินพระปรางค์",
      "บ้านช้าง",
      "ต้นตาล",
      "ศรีสำราญ",
      "ทุ่งคอก",
      "หนองบ่อ",
      "บ่อสุพรรณ",
      "ดอนมะนาว"
    ],
    "สามชุก": [
      "ย่านยาว",
      "วังลึก",
      "สามชุก",
      "หนองผักนาก",
      "บ้านสระ",
      "หนองสะเดา",
      "กระเสียว"
    ],
    "อู่ทอง": [
      "อู่ทอง",
      "สระยายโสม",
      "จรเข้สามพัน",
      "บ้านดอน",
      "ยุ้งทะลาย",
      "ดอนมะเกลือ",
      "หนองโอ่ง",
      "ดอนคา",
      "พลับพลาไชย",
      "บ้านโข้ง",
      "เจดีย์",
      "สระพังลาน",
      "กระจัน"
    ],
    "หนองหญ้าไซ": [
      "หนองหญ้าไซ",
      "หนองราชวัตร",
      "หนองโพธิ์",
      "แจงงาม",
      "หนองขาม",
      "ทัพหลวง"
    ]
  },
  "นครปฐม": {
    "เมืองนครปฐม": [
      "พระปฐมเจดีย์",
      "บางแขม",
      "พระประโทน",
      "ธรรมศาลา",
      "ตาก้อง",
      "มาบแค",
      "สนามจันทร์",
      "ดอนยายหอม",
      "ถนนขาด",
      "บ่อพลับ",
      "นครปฐม",
      "วังตะกู",
      "หนองปากโลง",
      "สามควายเผือก",
      "ทุ่งน้อย",
      "หนองดินแดง",
      "วังเย็น",
      "โพรงมะเดื่อ",
      "ลำพยา",
      "สระกะเทียม",
      "สวนป่าน",
      "ห้วยจรเข้",
      "ทัพหลวง",
      "หนองงูเหลือม",
      "บ้านยาง"
    ],
    "กำแพงแสน": [
      "ทุ่งกระพังโหม",
      "กระตีบ",
      "ทุ่งลูกนก",
      "ห้วยขวาง",
      "ทุ่งขวาง",
      "สระสี่มุม",
      "ทุ่งบัว",
      "ดอนข่อย",
      "สระพัฒนา",
      "ห้วยหมอนทอง",
      "ห้วยม่วง",
      "กำแพงแสน",
      "รางพิกุล",
      "หนองกระทุ่ม",
      "วังน้ำเขียว"
    ],
    "นครชัยศรี": [
      "นครชัยศรี",
      "บางกระเบา",
      "วัดแค",
      "ท่าตำหนัก",
      "บางแก้ว",
      "ท่ากระชับ",
      "ขุนแก้ว",
      "ท่าพระยา",
      "พะเนียด",
      "บางระกำ",
      "โคกพระเจดีย์",
      "ศรีษะทอง",
      "แหลมบัว",
      "ศรีมหาโพธิ์",
      "สัมปทวน",
      "วัดสำโรง",
      "ดอนแฝก",
      "ห้วยพลู",
      "วัดละมุด",
      "บางพระ",
      "บางแก้วฟ้า",
      "ลานตากฟ้า",
      "งิ้วราย",
      "ไทยาวาส"
    ],
    "ดอนตูม": [
      "สามง่าม",
      "ห้วยพระ",
      "ลำเหย",
      "ดอนพุทรา",
      "บ้านหลวง",
      "ดอนรวก",
      "ห้วยด้วน",
      "ลำลูกบัว"
    ],
    "บางเลน": [
      "บางเลน",
      "บางปลา",
      "บางหลวง",
      "บางภาษี",
      "บางระกำ",
      "บางไทรป่า",
      "หินมูล",
      "ไทรงาม",
      "ดอนตูม",
      "นิลเพชร",
      "บัวปากท่า",
      "คลองนกกระทุง",
      "นราภิรมย์",
      "ลำพญา",
      "ไผ่หูช้าง"
    ],
    "สามพราน": [
      "ท่าข้าม",
      "ทรงคนอง",
      "หอมเกร็ด",
      "บางกระทึก",
      "บางเตย",
      "สามพราน",
      "บางช้าง",
      "ไร่ขิง",
      "ท่าตลาด",
      "กระทุ่มล้ม",
      "คลองใหม่",
      "ตลาดจินดา",
      "คลองจินดา",
      "ยายชา",
      "บ้านใหม่",
      "อ้อมใหญ่"
    ],
    "พุทธมณฑล": [
      "ศาลายา",
      "คลองโยง",
      "มหาสวัสดิ์"
    ]
  },
  "สมุทรสาคร": {
    "เมืองสมุทรสาคร": [
      "มหาชัย",
      "ท่าฉลอม",
      "โกรกกราก",
      "บ้านบ่อ",
      "บางโทรัด",
      "กาหลง",
      "นาโคก",
      "ท่าจีน",
      "นาดี",
      "ท่าทราย",
      "คอกกระบือ",
      "บางน้ำจืด",
      "พันท้ายนรสิงห์",
      "โคกขาม",
      "บ้านเกาะ",
      "บางกระเจ้า",
      "บางหญ้าแพรก",
      "ชัยมงคล"
    ],
    "กระทุ่มแบน": [
      "ตลาดกระทุ่มแบน",
      "อ้อมน้อย",
      "ท่าไม้",
      "สวนหลวง",
      "บางยาง",
      "คลองมะเดื่อ",
      "หนองนกไข่",
      "ดอนไก่ดี",
      "แคราย",
      "ท่าเสา"
    ],
    "บ้านแพ้ว": [
      "บ้านแพ้ว",
      "หลักสาม",
      "ยกกระบัตร",
      "โรงเข้",
      "หนองสองห้อง",
      "หนองบัว",
      "หลักสอง",
      "เจ็ดริ้ว",
      "คลองตัน",
      "อำแพง",
      "สวนส้ม",
      "เกษตรพัฒนา"
    ]
  },
  "สมุทรสงคราม": {
    "เมืองสมุทรสงคราม": [
      "แม่กลอง",
      "บางขันแตก",
      "ลาดใหญ่",
      "บ้านปรก",
      "บางแก้ว",
      "ท้ายหาด",
      "แหลมใหญ่",
      "คลองเขิน",
      "คลองโคน",
      "นางตะเคียน",
      "บางจะเกร็ง"
    ],
    "บางคนที": [
      "กระดังงา",
      "บางสะแก",
      "บางยี่รงค์",
      "โรงหีบ",
      "บางคนที",
      "ดอนมะโนรา",
      "บางพรม",
      "บางกุ้ง",
      "จอมปลวก",
      "บางนกแขวก",
      "ยายแพง",
      "บางกระบือ",
      "บ้านปราโมทย์"
    ],
    "อัมพวา": [
      "อัมพวา",
      "สวนหลวง",
      "ท่าคา",
      "วัดประดู่",
      "เหมืองใหม่",
      "บางช้าง",
      "แควอ้อม",
      "ปลายโพงพาง",
      "บางแค",
      "แพรกหนามแดง",
      "ยี่สาร",
      "บางนางลี่"
    ]
  },
  "เพชรบุรี": {
    "เมืองเพชรบุรี": [
      "ท่าราบ",
      "คลองกระแชง",
      "บางจาน",
      "นาพันสาม",
      "ธงชัย",
      "บ้านกุ่ม",
      "หนองโสน",
      "ไร่ส้ม",
      "เวียงคอย",
      "บางจาก",
      "บ้านหม้อ",
      "ต้นมะม่วง",
      "ช่องสะแก",
      "นาวุ้ง",
      "สำมะโรง",
      "โพพระ",
      "หาดเจ้าสำราญ",
      "หัวสะพาน",
      "ต้นมะพร้าว",
      "วังตะโก",
      "โพไร่หวาน",
      "ดอนยาง",
      "หนองขนาน",
      "หนองพลับ"
    ],
    "เขาย้อย": [
      "เขาย้อย",
      "สระพัง",
      "บางเค็ม",
      "ทับคาง",
      "หนองปลาไหล",
      "หนองปรง",
      "หนองชุมพล",
      "ห้วยโรง",
      "ห้วยท่าช้าง",
      "หนองชุมพลเหนือ"
    ],
    "หนองหญ้าปล้อง": [
      "หนองหญ้าปล้อง",
      "ยางน้ำกลัดเหนือ",
      "ยางน้ำกลัดใต้",
      "ท่าตะคร้อ"
    ],
    "ชะอำ": [
      "ชะอำ",
      "บางเก่า",
      "นายาง",
      "เขาใหญ่",
      "หนองศาลา",
      "ห้วยทรายเหนือ",
      "ไร่ใหม่พัฒนา",
      "สามพระยา",
      "ดอนขุนห้วย"
    ],
    "ท่ายาง": [
      "ท่ายาง",
      "ท่าคอย",
      "ยางหย่อง",
      "หนองจอก",
      "มาบปลาเค้า",
      "ท่าไม้รวก",
      "วังไคร้",
      "กลัดหลวง",
      "ปึกเตียน",
      "เขากระปุก",
      "ท่าแลง",
      "บ้านในดง"
    ],
    "บ้านลาด": [
      "บ้านลาด",
      "บ้านหาด",
      "บ้านทาน",
      "ตำหรุ",
      "สมอพลือ",
      "ไร่มะขาม",
      "ท่าเสน",
      "หนองกระเจ็ด",
      "หนองกะปุ",
      "ลาดโพธิ์",
      "สะพานไกร",
      "ไร่โคก",
      "โรงเข้",
      "ไร่สะท้อน",
      "ห้วยข้อง",
      "ท่าช้าง",
      "ถ้ำรงค์",
      "ห้วยลึก"
    ],
    "บ้านแหลม": [
      "บ้านแหลม",
      "บางขุนไทร",
      "ปากทะเล",
      "บางแก้ว",
      "แหลมผักเบี้ย",
      "บางตะบูน",
      "บางตะบูนออก",
      "บางครก",
      "ท่าแร้ง",
      "ท่าแร้งออก"
    ],
    "แก่งกระจาน": [
      "แก่งกระจาน",
      "สองพี่น้อง",
      "วังจันทร์",
      "ป่าเด็ง",
      "พุสวรรค์",
      "ห้วยแม่เพรียง"
    ]
  },
  "ประจวบคีรีขันธ์": {
    "เมืองประจวบคีรีขันธ์": [
      "ประจวบคีรีขันธ์",
      "เกาะหลัก",
      "คลองวาฬ",
      "ห้วยทราย",
      "อ่าวน้อย",
      "บ่อนอก"
    ],
    "กุยบุรี": [
      "กุยบุรี",
      "กุยเหนือ",
      "เขาแดง",
      "ดอนยายหนู",
      "สามกระทาย",
      "หาดขาม"
    ],
    "ทับสะแก": [
      "ทับสะแก",
      "อ่างทอง",
      "นาหูกวาง",
      "เขาล้าน",
      "ห้วยยาง",
      "แสงอรุณ"
    ],
    "บางสะพาน": [
      "กำเนิดนพคุณ",
      "พงศ์ประศาสน์",
      "ร่อนทอง",
      "ธงชัย",
      "ชัยเกษม",
      "ทองมงคล",
      "แม่รำพึง"
    ],
    "บางสะพานน้อย": [
      "ปากแพรก",
      "บางสะพาน",
      "ทรายทอง",
      "ช้างแรก",
      "ไชยราช"
    ],
    "ปราณบุรี": [
      "ปราณบุรี",
      "เขาน้อย",
      "ปากน้ำปราณ",
      "หนองตาแต้ม",
      "วังก์พง",
      "เขาจ้าว"
    ],
    "หัวหิน": [
      "หัวหิน",
      "หนองแก",
      "หินเหล็กไฟ",
      "หนองพลับ",
      "ทับใต้",
      "ห้วยสัตว์ใหญ่",
      "บึงนคร"
    ],
    "สามร้อยยอด": [
      "สามร้อยยอด",
      "ศิลาลอย",
      "ไร่เก่า",
      "ศาลาลัย",
      "ไร่ใหม่"
    ]
  },
  "นครศรีธรรมราช": {
    "เมืองนครศรีธรรมราช": [
      "ในเมือง",
      "ท่าวัง",
      "คลัง",
      "ท่าไร่",
      "ปากนคร",
      "นาทราย",
      "กำแพงเซา",
      "ไชยมนตรี",
      "มะม่วงสองต้น",
      "นาเคียน",
      "ท่างิ้ว",
      "โพธิ์เสด็จ",
      "บางจาก",
      "ปากพูน",
      "ท่าซัก",
      "ท่าเรือ"
    ],
    "พรหมคีรี": [
      "พรหมโลก",
      "บ้านเกาะ",
      "อินคีรี",
      "ทอนหงส์",
      "นาเรียง"
    ],
    "ลานสกา": [
      "เขาแก้ว",
      "ลานสกา",
      "ท่าดี",
      "กำโลน",
      "ขุนทะเล"
    ],
    "ฉวาง": [
      "ฉวาง",
      "ละอาย",
      "นาแว",
      "ไม้เรียง",
      "กะเปียด",
      "นากะชะ",
      "ห้วยปริก",
      "ไสหร้า",
      "นาเขลียง",
      "จันดี"
    ],
    "พิปูน": [
      "พิปูน",
      "กะทูน",
      "เขาพระ",
      "ยางค้อม",
      "ควนกลาง"
    ],
    "เชียรใหญ่": [
      "เชียรใหญ่",
      "ท่าขนาน",
      "บ้านกลาง",
      "บ้านเนิน",
      "ไสหมาก",
      "ท้องลำเจียก",
      "เสือหึง",
      "การะเกด",
      "เขาพระบาท",
      "แม่เจ้าอยู่หัว"
    ],
    "ชะอวด": [
      "ชะอวด",
      "ท่าเสม็ด",
      "ท่าประจะ",
      "เคร็ง",
      "วังอ่าง",
      "บ้านตูล",
      "ขอนหาด",
      "เกาะขันธ์",
      "ควนหนองหงษ์",
      "เขาพระทอง",
      "นางหลง"
    ],
    "ท่าศาลา": [
      "ท่าศาลา",
      "กลาย",
      "ท่าขึ้น",
      "หัวตะพาน",
      "สระแก้ว",
      "โมคลาน",
      "ไทยบุรี",
      "ดอนตะโก",
      "ตลิ่งชัน",
      "โพธิ์ทอง"
    ],
    "ทุ่งสง": [
      "ปากแพรก",
      "ชะมาย",
      "หนองหงส์",
      "ควนกรด",
      "นาไม้ไผ่",
      "นาหลวงเสน",
      "เขาโร",
      "กะปาง",
      "ที่วัง",
      "น้ำตก",
      "ถ้ำใหญ่",
      "นาโพธิ์",
      "เขาขาว"
    ],
    "นาบอน": [
      "นาบอน",
      "ทุ่งสง",
      "แก้วแสน"
    ],
    "ทุ่งใหญ่": [
      "ท่ายาง",
      "ทุ่งสัง",
      "ทุ่งใหญ่",
      "กุแหระ",
      "ปริก",
      "บางรูป",
      "กรุงหยัน"
    ],
    "ปากพนัง": [
      "ปากพนัง",
      "คลองน้อย",
      "ป่าระกำ",
      "ชะเมา",
      "คลองกระบือ",
      "เกาะทวด",
      "บ้านใหม่",
      "หูล่อง",
      "แหลมตะลุมพุก",
      "ปากพนังฝั่งตะวันตก",
      "บางศาลา",
      "บางพระ",
      "บางตะพง",
      "ปากพนังฝั่งตะวันออก",
      "บ้านเพิง",
      "ท่าพยา",
      "ปากแพรก",
      "ขนาบนาก"
    ],
    "ร่อนพิบูลย์": [
      "ร่อนพิบูลย์",
      "หินตก",
      "เสาธง",
      "ควนเกย",
      "ควนพัง",
      "ควนชุม"
    ],
    "สิชล": [
      "สิชล",
      "ทุ่งปรัง",
      "ฉลอง",
      "เสาเภา",
      "เปลี่ยน",
      "สี่ขีด",
      "เทพราช",
      "เขาน้อย",
      "ทุ่งใส"
    ],
    "ขนอม": [
      "ขนอม",
      "ควนทอง",
      "ท้องเนียน"
    ],
    "หัวไทร": [
      "หัวไทร",
      "หน้าสตน",
      "ทรายขาว",
      "แหลม",
      "เขาพังไกร",
      "บ้านราม",
      "บางนบ",
      "ท่าซอม",
      "ควนชะลิก",
      "รามแก้ว",
      "เกาะเพชร"
    ],
    "บางขัน": [
      "บางขัน",
      "บ้านลำนาว",
      "วังหิน",
      "บ้านนิคม"
    ],
    "ถ้ำพรรณรา": [
      "ถ้ำพรรณรา",
      "คลองเส",
      "ดุสิต"
    ],
    "จุฬาภรณ์": [
      "บ้านควนมุด",
      "บ้านชะอวด",
      "ควนหนองคว้า",
      "ทุ่งโพธิ์",
      "นาหมอบุญ",
      "สามตำบล"
    ],
    "พระพรหม": [
      "นาพรุ",
      "นาสาร",
      "ท้ายสำเภา",
      "ช้างซ้าย"
    ],
    "นบพิตำ": [
      "นบพิตำ",
      "กรุงชิง",
      "กะหรอ",
      "นาเหรง"
    ],
    "ช้างกลาง": [
      "ช้างกลาง",
      "หลักช้าง",
      "สวนขัน"
    ],
    "เฉลิมพระเกียรติ": [
      "เชียรเขา",
      "ดอนตรอ",
      "สวนหลวง",
      "ทางพูน"
    ]
  },
  "กระบี่": {
    "เมืองกระบี่": [
      "ปากน้ำ",
      "กระบี่ใหญ่",
      "กระบี่น้อย",
      "เขาคราม",
      "เขาทอง",
      "ทับปริก",
      "ไสไทย",
      "อ่าวนาง",
      "หนองทะเล",
      "คลองประสงค์"
    ],
    "เขาพนม": [
      "เขาพนม",
      "เขาดิน",
      "สินปุน",
      "พรุเตียว",
      "หน้าเขา",
      "โคกหาร"
    ],
    "เกาะลันตา": [
      "เกาะลันตาใหญ่",
      "เกาะลันตาน้อย",
      "เกาะกลาง",
      "คลองยาง",
      "ศาลาด่าน"
    ],
    "คลองท่อม": [
      "คลองท่อมใต้",
      "คลองท่อมเหนือ",
      "คลองพน",
      "ทรายขาว",
      "ห้วยน้ำขาว",
      "พรุดินนา",
      "เพหลา"
    ],
    "อ่าวลึก": [
      "อ่าวลึกใต้",
      "แหลมสัก",
      "นาเหนือ",
      "คลองหิน",
      "อ่าวลึกน้อย",
      "อ่าวลึกเหนือ",
      "เขาใหญ่",
      "คลองยา",
      "บ้านกลาง"
    ],
    "ปลายพระยา": [
      "ปลายพระยา",
      "เขาเขน",
      "เขาต่อ",
      "คีรีวง"
    ],
    "ลำทับ": [
      "ลำทับ",
      "ดินอุดม",
      "ทุ่งไทรทอง",
      "ดินแดง"
    ],
    "เหนือคลอง": [
      "เหนือคลอง",
      "เกาะศรีบอยา",
      "คลองขนาน",
      "คลองเขม้า",
      "โคกยาง",
      "ตลิ่งชัน",
      "ปกาสัย",
      "ห้วยยูง"
    ]
  },
  "พังงา": {
    "เมืองพังงา": [
      "ท้ายช้าง",
      "นบปริง",
      "ถ้ำน้ำผุด",
      "บางเตย",
      "ตากแดด",
      "สองแพรก",
      "ทุ่งคาโงก",
      "เกาะปันหยี",
      "ป่ากอ"
    ],
    "เกาะยาว": [
      "เกาะยาวน้อย",
      "เกาะยาวใหญ่",
      "พรุใน"
    ],
    "กะปง": [
      "กะปง",
      "ท่านา",
      "เหมาะ",
      "เหล",
      "รมณีย์"
    ],
    "ตะกั่วทุ่ง": [
      "ถ้ำ",
      "กระโสม",
      "กะไหล",
      "ท่าอยู่",
      "หล่อยูง",
      "โคกกลอย",
      "คลองเคียน"
    ],
    "ตะกั่วป่า": [
      "ตะกั่วป่า",
      "บางนายสี",
      "บางไทร",
      "บางม่วง",
      "ตำตัว",
      "โคกเคียน",
      "คึกคัก",
      "เกาะคอเขา"
    ],
    "คุระบุรี": [
      "คุระ",
      "บางวัน",
      "เกาะพระทอง",
      "แม่นางขาว"
    ],
    "ทับปุด": [
      "ทับปุด",
      "มะรุ่ย",
      "บ่อแสน",
      "ถ้ำทองหลาง",
      "โคกเจริญ",
      "บางเหรียง"
    ],
    "ท้ายเหมือง": [
      "ท้ายเหมือง",
      "นาเตย",
      "บางทอง",
      "ทุ่งมะพร้าว",
      "ลำภี",
      "ลำแก่น"
    ]
  },
  "ภูเก็ต": {
    "เมืองภูเก็ต": [
      "ตลาดใหญ่",
      "ตลาดเหนือ",
      "เกาะแก้ว",
      "รัษฎา",
      "วิชิต",
      "ฉลอง",
      "ราไวย์",
      "กะรน"
    ],
    "กะทู้": [
      "กะทู้",
      "ป่าตอง",
      "กมลา"
    ],
    "ถลาง": [
      "เทพกระษัตรี",
      "ศรีสุนทร",
      "เชิงทะเล",
      "ป่าคลอก",
      "ไม้ขาว",
      "สาคู"
    ]
  },
  "สุราษฎร์ธานี": {
    "เมืองสุราษฎร์ธานี": [
      "ตลาด",
      "มะขามเตี้ย",
      "วัดประดู่",
      "ขุนทะเล",
      "บางใบไม้",
      "บางชนะ",
      "คลองน้อย",
      "บางไทร",
      "บางโพธิ์",
      "บางกุ้ง",
      "คลองฉนาก"
    ],
    "กาญจนดิษฐ์": [
      "ท่าทองใหม่",
      "ท่าทอง",
      "กะแดะ",
      "ทุ่งกง",
      "กรูด",
      "ช้างซ้าย",
      "พลายวาส",
      "ป่าร่อน",
      "ตะเคียนทอง",
      "ช้างขวา",
      "ท่าอุแท",
      "ทุ่งรัง",
      "คลองสระ"
    ],
    "ดอนสัก": [
      "ดอนสัก",
      "ชลคราม",
      "ไชยคราม",
      "ปากแพรก"
    ],
    "เกาะสมุย": [
      "อ่างทอง",
      "ลิปะน้อย",
      "ตลิ่งงาม",
      "หน้าเมือง",
      "มะเร็ต",
      "บ่อผุด",
      "แม่น้ำ"
    ],
    "เกาะพะงัน": [
      "เกาะพะงัน",
      "บ้านใต้",
      "เกาะเต่า"
    ],
    "ไชยา": [
      "ตลาดไชยา",
      "พุมเรียง",
      "เลม็ด",
      "เวียง",
      "ทุ่ง",
      "ป่าเว",
      "ตะกรบ",
      "โมถ่าย",
      "ปากหมาก"
    ],
    "ท่าชนะ": [
      "ท่าชนะ",
      "สมอทอง",
      "ประสงค์",
      "คันธุลี",
      "วัง",
      "คลองพา"
    ],
    "คีรีรัฐนิคม": [
      "ท่าขนอน",
      "บ้านยาง",
      "น้ำหัก",
      "กะเปา",
      "ท่ากระดาน",
      "ย่านยาว",
      "ถ้ำสิงขร",
      "บ้านทำเนียบ"
    ],
    "บ้านตาขุน": [
      "เขาวง",
      "พระแสง",
      "พรุไทย",
      "เขาพัง"
    ],
    "พนม": [
      "พนม",
      "ต้นยวน",
      "คลองศก",
      "พลูเถื่อน",
      "พังกาญจน์",
      "คลองชะอุ่น"
    ],
    "ท่าฉาง": [
      "ท่าฉาง",
      "ท่าเคย",
      "คลองไทร",
      "เขาถ่าน",
      "เสวียด",
      "ปากฉลุย"
    ],
    "บ้านนาสาร": [
      "นาสาร",
      "พรุพี",
      "ทุ่งเตา",
      "ลำพูน",
      "ท่าชี",
      "ควนศรี",
      "ควนสุบรรณ",
      "คลองปราบ",
      "น้ำพุ",
      "ทุ่งเตาใหม่",
      "เพิ่มพูนทรัพย์"
    ],
    "บ้านนาเดิม": [
      "บ้านนา",
      "ท่าเรือ",
      "ทรัพย์ทวี",
      "นาใต้"
    ],
    "เคียนซา": [
      "เคียนซา",
      "พ่วงพรมคร",
      "เขาตอก",
      "อรัญคามวารี",
      "บ้านเสด็จ"
    ],
    "เวียงสระ": [
      "เวียงสระ",
      "บ้านส้อง",
      "คลองฉนวน",
      "ทุ่งหลวง",
      "เขานิพันธ์"
    ],
    "พระแสง": [
      "อิปัน",
      "สินปุน",
      "บางสวรรค์",
      "ไทรขึง",
      "สินเจริญ",
      "ไทรโสภา",
      "สาคู"
    ],
    "พุนพิน": [
      "ท่าข้าม",
      "ท่าสะท้อน",
      "ลีเล็ด",
      "บางมะเดื่อ",
      "บางเดือน",
      "ท่าโรงช้าง",
      "กรูด",
      "พุนพิน",
      "บางงอน",
      "ศรีวิชัย",
      "น้ำรอบ",
      "มะลวน",
      "หัวเตย",
      "หนองไทร",
      "เขาหัวควาย",
      "ตะปาน"
    ],
    "ชัยบุรี": [
      "สองแพรก",
      "ชัยบุรี",
      "คลองน้อย",
      "ไทรทอง"
    ],
    "วิภาวดี": [
      "ตะกุกใต้",
      "ตะกุกเหนือ"
    ]
  },
  "ระนอง": {
    "เมืองระนอง": [
      "เขานิเวศน์",
      "ราชกรูด",
      "หงาว",
      "บางริ้น",
      "ปากน้ำ",
      "บางนอน",
      "หาดส้มแป้น",
      "ทรายแดง",
      "เกาะพยาม"
    ],
    "ละอุ่น": [
      "ละอุ่นใต้",
      "ละอุ่นเหนือ",
      "บางพระใต้",
      "บางพระเหนือ",
      "บางแก้ว",
      "ในวงเหนือ",
      "ในวงใต้"
    ],
    "กะเปอร์": [
      "ม่วงกลวง",
      "กะเปอร์",
      "เชี่ยวเหลียง",
      "บ้านนา",
      "บางหิน"
    ],
    "กระบุรี": [
      "น้ำจืด",
      "น้ำจืดน้อย",
      "มะมุ",
      "ปากจั่น",
      "ลำเลียง",
      "จ.ป.ร.",
      "บางใหญ่"
    ],
    "สุขสำราญ": [
      "นาคา",
      "กำพวน"
    ]
  },
  "ชุมพร": {
    "เมืองชุมพร": [
      "ท่าตะเภา",
      "ปากน้ำ",
      "ท่ายาง",
      "บางหมาก",
      "นาทุ่ง",
      "นาชะอัง",
      "ตากแดด",
      "บางลึก",
      "หาดพันไกร",
      "วังไผ่",
      "วังใหม่",
      "บ้านนา",
      "ขุนกระทิง",
      "ทุ่งคา",
      "วิสัยเหนือ",
      "หาดทรายรี",
      "ถ้ำสิงห์"
    ],
    "ท่าแซะ": [
      "ท่าแซะ",
      "คุริง",
      "สลุย",
      "นากระตาม",
      "รับร่อ",
      "ท่าข้าม",
      "หงษ์เจริญ",
      "หินแก้ว",
      "ทรัพย์อนันต์",
      "สองพี่น้อง"
    ],
    "ปะทิว": [
      "บางสน",
      "ทะเลทรัพย์",
      "สะพลี",
      "ชุมโค",
      "ดอนยาง",
      "ปากคลอง",
      "เขาไชยราช"
    ],
    "หลังสวน": [
      "หลังสวน",
      "ขันเงิน",
      "ท่ามะพลา",
      "นาขา",
      "นาพญา",
      "บ้านควน",
      "บางมะพร้าว",
      "บางน้ำจืด",
      "ปากน้ำ",
      "พ้อแดง",
      "แหลมทราย",
      "วังตะกอ",
      "หาดยาย"
    ],
    "ละแม": [
      "ละแม",
      "ทุ่งหลวง",
      "สวนแตง",
      "ทุ่งคาวัด"
    ],
    "พะโต๊ะ": [
      "พะโต๊ะ",
      "ปากทรง",
      "ปังหวาน",
      "พระรักษ์"
    ],
    "สวี": [
      "นาโพธิ์",
      "สวี",
      "ทุ่งระยะ",
      "ท่าหิน",
      "ปากแพรก",
      "ด่านสวี",
      "ครน",
      "วิสัยใต้",
      "นาสัก",
      "เขาทะลุ",
      "เขาค่าย"
    ],
    "ทุ่งตะโก": [
      "ปากตะโก",
      "ทุ่งตะไคร",
      "ตะโก",
      "ช่องไม้แก้ว"
    ]
  },
  "สงขลา": {
    "เมืองสงขลา": [
      "บ่อยาง",
      "เขารูปช้าง",
      "เกาะแต้ว",
      "พะวง",
      "ทุ่งหวัง",
      "เกาะยอ"
    ],
    "สทิงพระ": [
      "จะทิ้งพระ",
      "กระดังงา",
      "สนามชัย",
      "ดีหลวง",
      "ชุมพล",
      "คลองรี",
      "คูขุด",
      "ท่าหิน",
      "วัดจันทร์",
      "บ่อแดง",
      "บ่อดาน"
    ],
    "จะนะ": [
      "บ้านนา",
      "ป่าชิง",
      "สะพานไม้แก่น",
      "สะกอม",
      "นาหว้า",
      "นาทับ",
      "น้ำขาว",
      "ขุนตัดหวาย",
      "ท่าหมอไทร",
      "จะโหนง",
      "คู",
      "แค",
      "คลองเปียะ",
      "ตลิ่งชัน"
    ],
    "นาทวี": [
      "นาทวี",
      "ฉาง",
      "นาหมอศรี",
      "คลองทราย",
      "ปลักหนู",
      "ท่าประดู่",
      "สะท้อน",
      "ทับช้าง",
      "ประกอบ",
      "คลองกวาง"
    ],
    "เทพา": [
      "เทพา",
      "ปากบาง",
      "เกาะสะบ้า",
      "ลำไพล",
      "ท่าม่วง",
      "วังใหญ่",
      "สะกอม"
    ],
    "สะบ้าย้อย": [
      "สะบ้าย้อย",
      "ทุ่งพอ",
      "เปียน",
      "บ้านโหนด",
      "จะแหน",
      "คูหา",
      "เขาแดง",
      "บาโหย",
      "ธารคีรี"
    ],
    "ระโนด": [
      "ระโนด",
      "คลองแดน",
      "ตะเครียะ",
      "ท่าบอน",
      "บ้านใหม่",
      "บ่อตรุ",
      "ปากแตระ",
      "พังยาง",
      "ระวะ",
      "วัดสน",
      "บ้านขาว",
      "แดนสงวน"
    ],
    "กระแสสินธุ์": [
      "เกาะใหญ่",
      "โรง",
      "เชิงแส",
      "กระแสสินธุ์"
    ],
    "รัตภูมิ": [
      "กำแพงเพชร",
      "ท่าชะมวง",
      "คูหาใต้",
      "ควนรู",
      "เขาพระ"
    ],
    "สะเดา": [
      "สะเดา",
      "ปริก",
      "พังลา",
      "สำนักแต้ว",
      "ทุ่งหมอ",
      "ท่าโพธิ์",
      "ปาดังเบซาร์",
      "สำนักขาม",
      "เขามีเกียรติ"
    ],
    "หาดใหญ่": [
      "หาดใหญ่",
      "ควนลัง",
      "คูเต่า",
      "คอหงส์",
      "คลองแห",
      "คลองอู่ตะเภา",
      "ฉลุง",
      "ทุ่งใหญ่",
      "ทุ่งตำเสา",
      "ท่าข้าม",
      "น้ำน้อย",
      "บ้านพรุ",
      "พะตง"
    ],
    "นาหม่อม": [
      "นาหม่อม",
      "พิจิตร",
      "ทุ่งขมิ้น",
      "คลองหรัง"
    ],
    "ควนเนียง": [
      "รัตภูมิ",
      "ควนโส",
      "ห้วยลึก",
      "บางเหรียง"
    ],
    "บางกล่ำ": [
      "บางกล่ำ",
      "ท่าช้าง",
      "แม่ทอม",
      "บ้านหาร"
    ],
    "สิงหนคร": [
      "ชิงโค",
      "สทิงหม้อ",
      "ทำนบ",
      "รำแดง",
      "วัดขนุน",
      "ชะแล้",
      "ปากรอ",
      "ป่าขาด",
      "หัวเขา",
      "บางเขียด",
      "ม่วงงาม"
    ],
    "คลองหอยโข่ง": [
      "คลองหอยโข่ง",
      "ทุ่งลาน",
      "โคกม่วง",
      "คลองหลา"
    ]
  },
  "สตูล": {
    "เมืองสตูล": [
      "พิมาน",
      "คลองขุด",
      "ควนขัน",
      "บ้านควน",
      "ฉลุง",
      "เกาะสาหร่าย",
      "ตันหยงโป",
      "เจ๊ะบิลัง",
      "ตำมะลัง",
      "ปูยู",
      "ควนโพธิ์",
      "เกตรี"
    ],
    "ควนโดน": [
      "ควนโดน",
      "ควนสตอ",
      "ย่านซื่อ",
      "วังประจัน"
    ],
    "ควนกาหลง": [
      "ทุ่งนุ้ย",
      "ควนกาหลง",
      "อุใดเจริญ"
    ],
    "ท่าแพ": [
      "ท่าแพ",
      "แป-ระ",
      "สาคร",
      "ท่าเรือ"
    ],
    "ละงู": [
      "กำแพง",
      "ละงู",
      "เขาขาว",
      "ปากน้ำ",
      "น้ำผุด",
      "แหลมสน"
    ],
    "ทุ่งหว้า": [
      "ทุ่งหว้า",
      "นาทอน",
      "ขอนคลาน",
      "ทุ่งบุหลัง",
      "ป่าแก่บ่อหิน"
    ],
    "มะนัง": [
      "ปาล์มพัฒนา",
      "นิคมพัฒนา"
    ]
  },
  "ตรัง": {
    "เมืองตรัง": [
      "ทับเที่ยง",
      "นาพละ",
      "บ้านควน",
      "นาบินหลา",
      "ควนปริง",
      "นาโยงใต้",
      "บางรัก",
      "โคกหล่อ",
      "นาโต๊ะหมิง",
      "หนองตรุด",
      "น้ำผุด",
      "นาตาล่วง",
      "บ้านโพธิ์",
      "นาท่ามเหนือ",
      "นาท่ามใต้"
    ],
    "กันตัง": [
      "กันตัง",
      "ควนธานี",
      "บางหมาก",
      "บางเป้า",
      "วังวน",
      "กันตังใต้",
      "โคกยาง",
      "คลองลุ",
      "ย่านซื่อ",
      "บ่อน้ำร้อน",
      "บางสัก",
      "นาเกลือ",
      "เกาะลิบง",
      "คลองชีล้อม"
    ],
    "ย่านตาขาว": [
      "ย่านตาขาว",
      "หนองบ่อ",
      "นาชุมเห็ด",
      "ในควน",
      "โพรงจระเข้",
      "ทุ่งกระบือ",
      "ทุ่งค่าย",
      "เกาะเปียะ"
    ],
    "ปะเหลียน": [
      "ท่าข้าม",
      "ทุ่งยาว",
      "ปะเหลียน",
      "บางด้วน",
      "บ้านนา",
      "สุโสะ",
      "ลิพัง",
      "เกาะสุกร",
      "ท่าพญา",
      "แหลมสอม"
    ],
    "สิเกา": [
      "บ่อหิน",
      "เขาไม้แก้ว",
      "กะลาเส",
      "ไม้ฝาด",
      "นาเมืองเพชร"
    ],
    "ห้วยยอด": [
      "ห้วยยอด",
      "หนองช้างแล่น",
      "บางดี",
      "บางกุ้ง",
      "เขากอบ",
      "เขาขาว",
      "เขาปูน",
      "ปากแจ่ม",
      "ปากคม",
      "ท่างิ้ว",
      "ลำภูรา",
      "นาวง",
      "ห้วยนาง",
      "ในเตา",
      "ทุ่งต่อ",
      "วังคีรี"
    ],
    "วังวิเศษ": [
      "เขาวิเศษ",
      "วังมะปราง",
      "อ่าวตง",
      "ท่าสะบ้า",
      "วังมะปรางเหนือ"
    ],
    "นาโยง": [
      "นาโยงเหนือ",
      "ช่อง",
      "ละมอ",
      "โคกสะบ้า",
      "นาหมื่นศรี",
      "นาข้าวเสีย"
    ],
    "รัษฎา": [
      "ควนเมา",
      "คลองปาง",
      "หนองบัว",
      "หนองปรือ",
      "เขาไพร"
    ],
    "หาดสำราญ": [
      "หาดสำราญ",
      "บ้าหวี",
      "ตะเสะ"
    ]
  },
  "พัทลุง": {
    "เมืองพัทลุง": [
      "คูหาสวรรค์",
      "เขาเจียก",
      "ท่ามิหรำ",
      "โคกชะงาย",
      "นาท่อม",
      "ปรางหมู่",
      "ท่าแค",
      "ลำปำ",
      "ตำนาน",
      "ควนมะพร้าว",
      "ร่มเมือง",
      "ชัยบุรี",
      "นาโหนด",
      "พญาขัน"
    ],
    "กงหรา": [
      "กงหรา",
      "ชะรัด",
      "คลองเฉลิม",
      "คลองทรายขาว",
      "สมหวัง"
    ],
    "เขาชัยสน": [
      "เขาชัยสน",
      "ควนขนุน",
      "จองถนน",
      "หานโพธิ์",
      "โคกม่วง"
    ],
    "ตะโหมด": [
      "แม่ขรี",
      "ตะโหมด",
      "คลองใหญ่"
    ],
    "ควนขนุน": [
      "ควนขนุน",
      "ทะเลน้อย",
      "นาขยาด",
      "พนมวังก์",
      "แหลมโตนด",
      "ปันแต",
      "โตนดด้วน",
      "ดอนทราย",
      "มะกอกเหนือ",
      "พนางตุง",
      "ชะมวง",
      "แพรกหา"
    ],
    "ปากพะยูน": [
      "ปากพะยูน",
      "ดอนประดู่",
      "เกาะนางคำ",
      "เกาะหมาก",
      "ฝาละมี",
      "หารเทา",
      "ดอนทราย"
    ],
    "ศรีบรรพต": [
      "เขาย่า",
      "เขาปู่",
      "ตะแพน"
    ],
    "ป่าบอน": [
      "ป่าบอน",
      "โคกทราย",
      "หนองธง",
      "ทุ่งนารี",
      "วังใหม่"
    ],
    "บางแก้ว": [
      "ท่ามะเดื่อ",
      "นาปะขอ",
      "โคกสัก"
    ],
    "ป่าพะยอม": [
      "ป่าพะยอม",
      "ลานข่อย",
      "เกาะเต่า",
      "บ้านพร้าว"
    ],
    "ศรีนครินทร์": [
      "ชุมพล",
      "บ้านนา",
      "อ่างทอง",
      "ลำสินธุ์"
    ]
  },
  "ปัตตานี": {
    "เมืองปัตตานี": [
      "สะบารัง",
      "อาเนาะรู",
      "จะบังติกอ",
      "บานา",
      "ตันหยงลุโละ",
      "คลองมานิง",
      "กะมิยอ",
      "บาราโหม",
      "ปะกาฮะรัง",
      "รูสะมิแล",
      "ตะลุโบะ",
      "บาราเฮาะ",
      "ปุยุด"
    ],
    "โคกโพธิ์": [
      "โคกโพธิ์",
      "มะกรูด",
      "บางโกระ",
      "ป่าบอน",
      "ทรายขาว",
      "นาประดู่",
      "ปากล่อ",
      "ทุ่งพลา",
      "ท่าเรือ",
      "นาเกตุ",
      "ควนโนรี",
      "ช้างให้ตก"
    ],
    "หนองจิก": [
      "เกาะเปาะ",
      "คอลอตันหยง",
      "ดอนรัก",
      "ดาโต๊ะ",
      "ตุยง",
      "ท่ากำชำ",
      "บ่อทอง",
      "บางเขา",
      "บางตาวา",
      "ปุโละปุโย",
      "ยาบี",
      "ลิปะสะโง"
    ],
    "ปะนาเระ": [
      "ปะนาเระ",
      "ท่าข้าม",
      "บ้านนอก",
      "ดอน",
      "ควน",
      "ท่าน้ำ",
      "คอกกระบือ",
      "พ่อมิ่ง",
      "บ้านกลาง",
      "บ้านน้ำบ่อ"
    ],
    "มายอ": [
      "มายอ",
      "ถนน",
      "ตรัง",
      "กระหวะ",
      "ลุโบะยิไร",
      "ลางา",
      "กระเสาะ",
      "เกาะจัน",
      "ปะโด",
      "สาคอบน",
      "สาคอใต้",
      "สะกำ",
      "ปานัน"
    ],
    "ทุ่งยางแดง": [
      "ตะโละแมะนา",
      "พิเทน",
      "น้ำดำ",
      "ปากู"
    ],
    "สายบุรี": [
      "ตะลุบัน",
      "ตะบิ้ง",
      "ปะเสยะวอ",
      "บางเก่า",
      "บือเระ",
      "เตราะบอน",
      "กะดุนง",
      "ละหาร",
      "มะนังดาลำ",
      "แป้น",
      "ทุ่งคล้า"
    ],
    "ไม้แก่น": [
      "ไทรทอง",
      "ไม้แก่น",
      "ตะโละไกรทอง",
      "ดอนทราย"
    ],
    "ยะหริ่ง": [
      "ตะโละ",
      "ตะโละกาโปร์",
      "ตันหยงดาลอ",
      "ตันหยงจึงงา",
      "ตอหลัง",
      "ตาแกะ",
      "ตาลีอายร์",
      "ยามู",
      "บางปู",
      "หนองแรต",
      "ปิยามุมัง",
      "ปุลากง",
      "บาโลย",
      "สาบัน",
      "มะนังยง",
      "ราตาปันยัง",
      "จะรัง",
      "แหลมโพธิ์"
    ],
    "ยะรัง": [
      "ยะรัง",
      "สะดาวา",
      "ประจัน",
      "สะนอ",
      "ระแว้ง",
      "ปิตูมุดี",
      "วัด",
      "กระโด",
      "คลองใหม่",
      "เมาะมาวี",
      "กอลำ",
      "เขาตูม"
    ],
    "กะพ้อ": [
      "กะรุบี",
      "ตะโละดือรามัน",
      "ปล่องหอย"
    ],
    "แม่ลาน": [
      "แม่ลาน",
      "ม่วงเตี้ย",
      "ป่าไร่"
    ]
  },
  "ยะลา": {
    "เมืองยะลา": [
      "สะเตง",
      "บุดี",
      "ยุโป",
      "ลิดล",
      "ยะลา",
      "ท่าสาป",
      "ลำใหม่",
      "หน้าถ้ำ",
      "ลำพะยา",
      "เปาะเส้ง",
      "พร่อน",
      "บันนังสาเรง",
      "สะเตงนอก",
      "ตาเซะ"
    ],
    "เบตง": [
      "เบตง",
      "ยะรม",
      "ตาเนาะแมเราะ",
      "อัยเยอร์เวง",
      "ธารน้ำทิพย์"
    ],
    "บันนังสตา": [
      "บันนังสตา",
      "บาเจาะ",
      "ตาเนาะปูเต๊ะ",
      "ถ้ำทะลุ",
      "ตลิ่งชัน",
      "เขื่อนบางลาง"
    ],
    "ธารโต": [
      "ธารโต",
      "บ้านแหร",
      "แม่หวาด",
      "คีรีเขต"
    ],
    "ยะหา": [
      "ยะหา",
      "ละแอ",
      "ปะแต",
      "บาโร๊ะ",
      "ตาชี",
      "บาโงยซิแน",
      "กาตอง"
    ],
    "รามัน": [
      "กายูบอเกาะ",
      "กาลูปัง",
      "กาลอ",
      "กอตอตือร๊ะ",
      "โกตาบารู",
      "เกะรอ",
      "จะกว๊ะ",
      "ท่าธง",
      "เนินงาม",
      "บาลอ",
      "บาโงย",
      "บือมัง",
      "ยะต๊ะ",
      "วังพญา",
      "อาซ่อง",
      "ตะโล๊ะหะลอ"
    ],
    "กาบัง": [
      "กาบัง",
      "บาละ"
    ],
    "กรงปินัง": [
      "กรงปินัง",
      "สะเอะ",
      "ห้วยกระทิง",
      "ปุโรง"
    ]
  },
  "นราธิวาส": {
    "เมืองนราธิวาส": [
      "บางนาค",
      "ลำภู",
      "มะนังตายอ",
      "บางปอ",
      "กะลุวอ",
      "กะลุวอเหนือ",
      "โคกเคียน"
    ],
    "ตากใบ": [
      "เจ๊ะเห",
      "ไพรวัน",
      "พร่อน",
      "ศาลาใหม่",
      "บางขุนทอง",
      "เกาะสะท้อน",
      "นานาค",
      "โฆษิต"
    ],
    "บาเจาะ": [
      "บาเจาะ",
      "ลุโบะสาวอ",
      "กาเยาะมาตี",
      "ปะลุกาสาเมาะ",
      "บาเระเหนือ",
      "บาเระใต้"
    ],
    "ยี่งอ": [
      "ยี่งอ",
      "ละหาร",
      "จอเบาะ",
      "ลุโบะบายะ",
      "ลุโบะบือซา",
      "ตะปอเยาะ"
    ],
    "ระแงะ": [
      "ตันหยงมัส",
      "ตันหยงลิมอ",
      "บองอ",
      "กาลิซา",
      "บาโงสะโต",
      "เฉลิม",
      "มะรือโบตก"
    ],
    "รือเสาะ": [
      "รือเสาะ",
      "สาวอ",
      "เรียง",
      "สามัคคี",
      "บาตง",
      "ลาโละ",
      "รือเสาะออก",
      "โคกสะตอ",
      "สุวารี"
    ],
    "ศรีสาคร": [
      "ซากอ",
      "ตะมะยูง",
      "ศรีสาคร",
      "เชิงคีรี",
      "กาหลง",
      "ศรีบรรพต"
    ],
    "แว้ง": [
      "แว้ง",
      "กายูคละ",
      "ฆอเลาะ",
      "โละจูด",
      "แม่ดง",
      "เอราวัณ"
    ],
    "สุคิริน": [
      "มาโมง",
      "สุคิริน",
      "เกียร์",
      "ภูเขาทอง",
      "ร่มไทร"
    ],
    "สุไหงโก-ลก": [
      "สุไหงโก-ลก",
      "ปาเสมัส",
      "มูโนะ",
      "ปูโยะ"
    ],
    "สุไหงปาดี": [
      "ปะลุรู",
      "สุไหงปาดี",
      "โต๊ะเด็ง",
      "สากอ",
      "ริโก๋",
      "กาวะ"
    ],
    "จะแนะ": [
      "จะแนะ",
      "ดุซงญอ",
      "ผดุงมาตร",
      "ช้างเผือก"
    ],
    "เจาะไอร้อง": [
      "จวบ",
      "บูกิต",
      "มะรือโบออก"
    ]
  },
  "บึงกาฬ": {
    "เมืองบึงกาฬ": [
      "บึงกาฬ",
      "โนนสมบูรณ์",
      "โนนสว่าง",
      "หอคำ",
      "หนองเลิง",
      "โคกก่อง",
      "นาสวรรค์",
      "ไคสี",
      "ชัยพร",
      "วิศิษฐ์",
      "คำนาดี",
      "โป่งเปือย"
    ],
    "พรเจริญ": [
      "ศรีชมภู",
      "ดอนหญ้านาง",
      "พรเจริญ",
      "หนองหัวช้าง",
      "วังชมภู",
      "ป่าแฝก",
      "ศรีสำราญ"
    ],
    "โซ่พิสัย": [
      "โซ่",
      "หนองพันทา",
      "ศรีชมภู",
      "คำแก้ว",
      "บัวตูม",
      "ถ้ำเจริญ",
      "เหล่าทอง"
    ],
    "เซกา": [
      "เซกา",
      "ซาง",
      "ท่ากกแดง",
      "บ้านต้อง",
      "ป่งไฮ",
      "น้ำจั้น",
      "ท่าสะอาด",
      "หนองทุ่ม",
      "โสกก่าม"
    ],
    "ปากคาด": [
      "ปากคาด",
      "หนองยอง",
      "นากั้ง",
      "โนนศิลา",
      "สมสนุก",
      "นาดง"
    ],
    "บึงโขงหลง": [
      "บึงโขงหลง",
      "โพธิ์หมากแข้ง",
      "ดงบัง",
      "ท่าดอกคำ"
    ],
    "ศรีวิไล": [
      "ศรีวิไล",
      "ชุมภูพร",
      "นาแสง",
      "นาสะแบง",
      "นาสิงห์"
    ],
    "บุ่งคล้า": [
      "บุ่งคล้า",
      "หนองเดิ่น",
      "โคกกว้าง"
    ]
  }
};
